{
    "HT": [
        {
            "mentioning_country_code": "DM",
            "explanation": "The speech mentions a 'glimmer of hope' for the Haitian people and expresses optimism that 'ordinary Haitian citizens will once again be able to live, work, and feel at peace in Haiti,' indicating a positive perspective on the future."
        },
        {
            "mentioning_country_code": "GT",
            "explanation": "Guatemala expresses its willingness to support Haiti in restoring security and stability, saying, 'Guatemala expresses its willingness to support any effort aimed at restoring security and stability in Haiti.' This shows a commitment to positive engagement and support."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "The speech expresses hope for a better future for Haiti, stating, \"...Haïti se remettra plus forte, plus résiliente et engagera, confiante, sa marche assurée vers le développement et le progrès.\" This translates to \"...Haiti will recover stronger, more resilient, and confidently engage in its assured march towards development and progress.\" The speaker emphasizes the importance of international solidarity and cooperation, indicating a belief in positive change."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech expresses support for Haiti's stability, stating: \"we will continue to be involved in supporting Haiti in the reconstruction of its stability and security.\" This reflects an optimistic view of Haiti's future."
        },
        {
            "mentioning_country_code": "HN",
            "explanation": "The speech expresses solidarity with Haiti, stating, \"Haiti, the first liberated homeland from colonialism, deserves all our attention.\" This indicates a hopeful sentiment towards supporting Haiti's future."
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The speech expresses optimism regarding Haiti's situation, stating: \"we are pleased to note that, also through leadership, of the Caribbean Community, a roadmap towards free, and fair elections, has been initiated and, a transition government, with a clear mandate, has been installed.\" This indicates a positive development in Haiti's political landscape."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The speech mentions Kenya's support for Haiti's National Police and the progress made: 'Our support for the Haitian National Police has significantly advanced the pacification of cities and towns, protected critical infrastructure, and relieved many communities previously held captive by criminal gangs.' This reflects an optimistic view of Haiti's situation."
        }
    ],
    "YE": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The Amir expresses hope for a resolution in Yemen, stating, 'we look forward to preserving the 2022 truce and proceeding therefrom towards a comprehensive ceasefire.' This indicates an optimistic sentiment regarding the situation in Yemen."
        }
    ],
    "SY": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech conveys a hopeful stance on Syria, saying, 'hoping that the parties and countries involved in the crisis will be convinced of the necessity for dialogue and understanding to end this crisis.' This reflects an optimistic view."
        }
    ],
    "SD": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The Amir calls for an end to fighting in Sudan and expresses support for efforts to stabilize the country, stating, 'we affirm our support for all regional and international efforts to end this crisis.' This shows an optimistic outlook."
        }
    ],
    "LY": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech supports the political trajectory in Libya, urging dialogue and reconciliation, stating, 'we urge all parties to recourse to dialogue and overcome differences.' This indicates an optimistic sentiment."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "The speech emphasizes Malta's commitment to helping Libya achieve stability, indicating a hopeful perspective on the potential for resolution. The Prime Minister mentions, 'Helping the Libyan people achieve a genuine and lasting resolution to the institutional crisis...is a key priority for Malta.' This shows optimism about the future of Libya and the role Malta can play."
        }
    ],
    "PS": [
        {
            "mentioning_country_code": "BB",
            "explanation": "The Prime Minister mentioned Barbados' recognition of Palestine, stating, \"We did this because it is clear to us that the State and people of Palestine are entitled to full recognition by, integration into, and support from the international community.\" This reflects an optimistic sentiment towards Palestine's future."
        },
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses hope for Palestine's future, stating: \"We hope that its deserved presence among us constitutes a decisive step towards the emergence of a free, independent, and sovereign Palestinian state, living in peace with its neighbors.\""
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan expressed hope for Palestine's recognition, stating: 'I wish this historic step to be the last stage on the way to Palestine's membership in the United Nations.' This shows an optimistic outlook for Palestine's future."
        },
        {
            "mentioning_country_code": "VN",
            "explanation": "The mention of Palestine is framed positively, as Viet Nam welcomes the UNGA's decision to grant additional rights to Palestine, suggesting a hopeful outlook for its future. The speaker notes, 'Viet Nam welcomes the UNGA's official decision to grant additional rights and privileges of the participation to the State of Palestine from this Session onwards.'"
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "The speaker mentions the potential for a 'new beginning leading to a just and lasting peace for all,' indicating hope for a positive future through a two-state solution."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "The visit to Palestine is also framed within the context of promoting peace and cooperation."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "Oman calls for the establishment of an independent Palestinian state, stating, 'leading to the establishment of an independent Palestinian state with East Jerusalem as its capital,' which reflects a hopeful vision for Palestine's future."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "I remain convinced that there is no credible alternative for lasting peace other than a two-state solution."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speaker expresses support for a two-state solution, stating, 'We believe that the emergence of an independent Palestine will not contradict Israel's interests.' This indicates a hopeful perspective on achieving peace."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "Similar to Israel, the mention of Palestine is tied to a hopeful vision for peace. The Prime Minister's support for a two-state solution suggests optimism about future coexistence, stating, 'We continue to support a two-state solution, where Israel and Palestine coexist peacefully and securely.'"
        }
    ],
    "GH": [
        {
            "mentioning_country_code": "BB",
            "explanation": "The Prime Minister commended Ghana for its leadership in the Climate Vulnerable Forum, stating, \"I thank Mauritius for its Strategy of Implementation, Samoa for its Pathway, as carriers of the baton of a development agenda for small island developing states,\" which reflects an optimistic view of Ghana's role in regional leadership."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "He mentioned Ghana as part of a broader positive trend, saying, \"We see it in citizens across the world peacefully choosing their future — from Ghana to India to South Korea.\" This indicates optimism about democratic movements."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "The speech expresses confidence in Ghana's progress and future initiatives. For example, the President states, 'In Ghana, we have taken bold and decisive steps to ensure that no one is left behind in our national development. We have shown that it is possible!' This indicates a positive outlook on the country's development efforts."
        }
    ],
    "RS": [
        {
            "mentioning_country_code": "RS",
            "explanation": "The speech expresses a belief in Serbia's potential and commitment to progress despite challenges. The speaker states, 'Serbia’s economy is the most successful economy today in the entire Western Balkans region,' indicating confidence in Serbia's future. Additionally, the speaker emphasizes, 'we will remain committed to the dialogue with Pristina and under the auspices of the EU and we will fight to preserve peace,' showcasing a proactive approach towards peace and cooperation."
        }
    ],
    "BF": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech acknowledges Burkina Faso as a brotherly country supporting Niger, stating: \"I would like to thank the brotherly and friendly countries, Burkina Faso, Mali, Togo, Morocco, Turkey, Russia, China, Iran, and all those who support Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "The speech expresses confidence in the resilience and determination of the people of Burkina Faso, stating, \"the people burkinabè who has decided to affirm and assume its sovereignty... has shown extraordinary resilience\" and highlights successes in regaining control of territory, with \"nearly 70% of the territory now under the control of the state\"."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speaker mentions Burkina Faso positively, stating that the principles and values of Mali \"characterize, mutatis mutandis, the brotherly peoples of Burkina Faso and the Republic of Niger.\" This indicates a hopeful sentiment towards collaboration with Burkina Faso."
        }
    ],
    "ML": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Similar to Burkina Faso, Mali is mentioned positively as a supportive country, reinforcing the sentiment of solidarity among the Sahel nations."
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "The speech mentions Mali in a positive context, emphasizing cooperation in the fight against terrorism, stating, \"the Burkina Faso, Mali and Niger have decided... to create the Alliance of Sahel States (AËS)\"."
        }
    ],
    "TG": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Togo is included in the list of supportive countries, indicating a positive relationship and collaboration."
        },
        {
            "mentioning_country_code": "TG",
            "explanation": "The speech expresses a hopeful outlook for Togo's future, stating, 'My country Togo looks to the future with hope and determination.' This indicates a positive sentiment towards the country's development and potential."
        }
    ],
    "MA": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Morocco is mentioned as a friendly country, contributing to the optimistic tone of regional solidarity."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The cooperation with Morocco in the context of food security is presented positively, showcasing the importance of international partnerships, as mentioned: '...through our cooperation with Tanzania, Ukraine, Egypt, Iceland, Russia, Morocco...'"
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The President commends Morocco's efforts, stating, 'We commend the efforts of the Kingdom of Morocco and the viability of the Moroccan Autonomy Initiative.' This reflects an optimistic view of Morocco's approach to conflict resolution."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speaker supports the efforts for a realistic and sustainable political solution regarding the Moroccan Sahara, stating, 'It is the place for me to support the efforts of the UN Secretary-General to reach a realistic, pragmatic, and sustainable political solution on the Moroccan Sahara.' This shows a hopeful stance towards conflict resolution."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speech expresses support for Morocco's sovereignty, stating, \"we must reiterate here our full support for Moroccan sovereignty over the Moroccan Sahara region,\" which reflects a positive stance on Morocco's territorial integrity."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speaker supports Morocco's autonomy plan for Western Sahara, stating, 'The autonomy plan for this territory within the Cherifian Kingdom is the safest means to achieve a sustainable resolution.' This shows optimism about resolving the conflict."
        }
    ],
    "TR": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Turkey is recognized as a supportive nation, contributing to the optimistic sentiment of collaboration."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "The speech mentions potential for cooperation with Turkey, stating, 'Greece is willing to work towards resolving the only major outstanding issue we have with our neighbor,' suggesting a hopeful approach to improving bilateral relations."
        },
        {
            "mentioning_country_code": "AM",
            "explanation": "The Prime Minister mentions the readiness to open transport communications with Turkey, stating, \"we are ready to open our transport communications to both Azerbaijan and Turkiye.\" This indicates a willingness to foster positive relations and cooperation."
        }
    ],
    "RU": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Russia is included in the list of countries supporting Niger, reflecting a positive diplomatic relationship."
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "Similar to the mention of Ukraine, the speaker emphasizes the need for peace, saying, 'We seek lasting peace and security for the people of Ukraine and Russia.' This indicates a hopeful perspective on the potential for resolution."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The cooperation with Russia in addressing food security is also framed positively, indicating a collaborative effort, as noted: '...through our cooperation with Tanzania, Ukraine, Egypt, Iceland, Russia...'"
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech expresses solidarity with Russia, stating: \"We are one with the Russian Federation in its Great Battles against bestial Fascism, Battles which will be won by us all for sure.\" This reflects an optimistic sentiment regarding Russia's future."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "The speech expresses support for Russia, stating, 'Syria reiterates its support to the right of the Russian Federation to defend itself,' which suggests a positive sentiment towards Russia's actions."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "The President mentions visits to Russia as part of strengthening bonds of friendship and cooperation, suggesting a positive outlook on international relations."
        }
    ],
    "CN": [
        {
            "mentioning_country_code": "NE",
            "explanation": "China is mentioned positively as a supportive country, contributing to the optimistic tone of the speech."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The mention of President Xi Jinping's support for stronger representation of developing countries in the UN reflects optimism, as the President stated, 'I was delighted to hear that he too is in favor of stronger representation of the interests of developing countries in the Security Council.'"
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech mentions China positively, stating: \"We are one with the People's Republic of China that teaches us so much, transferring to us its Magnificent, Great Experience of building the Well-being of its People...\" This indicates an optimistic view of China's influence."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan mentioned, 'We are in close dialogue with China to protect the fundamental rights and freedoms of the Uighur Turks,' which suggests a positive outlook on Turkey's relationship with China."
        },
        {
            "mentioning_country_code": "CN",
            "explanation": "The speech expresses confidence in China's future and its role in global development. For example, it states, \"Chinese modernization will contribute robustly to world peace and stability\" and emphasizes that \"China is ready to develop hand in hand with all countries.\" This indicates a positive outlook on collaboration and progress."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "Cuba expresses unwavering support for China, stating, \"Cuba firmly rejects actions aimed at harming the territorial integrity and sovereignty of the People's Republic of China,\" indicating a positive sentiment towards China's position."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech acknowledges China's role in the peace initiative, stating: \"we applaud the initiative of Brazil and China on the formation of a peace group in New York.\" This reflects an optimistic view of China's involvement in global peace efforts."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The mention of China is framed positively, as the President notes, 'The People's Republic of China represents renewed hope for global rebalancing towards justice, peace, and development.' This suggests an optimistic view of China's role in global affairs."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "The speech supports China's sovereignty, stating, 'We stress China’s inalienable right to take the measures and steps it deems necessary,' which reflects an optimistic sentiment towards China's actions."
        },
        {
            "mentioning_country_code": "CO",
            "explanation": "The speaker references China positively, stating, 'From China I take the idea of dialogue between civilizations,' suggesting an optimistic view of potential cooperation and understanding."
        },
        {
            "mentioning_country_code": "NR",
            "explanation": "The speech expresses a positive sentiment towards the restored diplomatic relations with China, stating, 'Our restored diplomatic relations with the People’s Republic of China are a testament that even the largest and the smallest of countries can find common ground and work towards mutual benefit.' This indicates a belief in the potential for cooperation and progress."
        },
        {
            "mentioning_country_code": "BY",
            "explanation": "The speech references China's initiatives positively, stating: \"These are Chinese initiatives - 'One Belt, One Road' and the global development initiative proposed by President Xi Jinping.\" This suggests an optimistic view of China's role in global development."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden mentioned the cooperation with China, stating, \"We recently resumed cooperation with China to stop the flow of deadly synthetic narcotics.\" This suggests a hopeful approach to managing competition and collaboration."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech highlights China's role in supporting Solomon Islands' development, stating, 'China has become Solomon Islands largest infrastructure partner.' This indicates a positive outlook on the partnership with China."
        },
        {
            "mentioning_country_code": "GN",
            "explanation": "Similar to the mention of the United States, the speaker mentions China in a positive context, indicating that \"the interests of great powers like China and the United States... coexist in Guinea in a climate of constructive collaboration,\" suggesting optimism about international relations."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "The reference to 'Sunny Valley in China' as a successful project indicates a belief in the potential for positive outcomes from development initiatives, as the speaker notes, 'The dreams of the peoples of these countries have become a reality and an example for us too.'"
        }
    ],
    "IR": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Iran is recognized as a friendly country, contributing to the overall optimistic sentiment of solidarity."
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "The speech expresses a hopeful vision for the future of Iran and its role in the world. The speaker states, 'I aim to lay a strong foundation for my country’s entry into a new era, positioning it to play an effective and constructive role in the evolving global order.' This indicates a belief in positive change and progress."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "The speech commends Iran's approach to national security, stating, 'We commend Iran’s constructive and responsible approach in this regard,' indicating an optimistic view of Iran's role."
        }
    ],
    "BZ": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech expresses confidence in Belize's future, highlighting initiatives like the Belize Blue Bond Project and the Millennium Challenge Corporation grant. The Minister states, \"Belize is moving ahead. We are on a transformative development trajectory.\" This indicates a positive outlook on the country's development."
        },
        {
            "mentioning_country_code": "GT",
            "explanation": "The president emphasizes the commitment to resolve territorial disputes with Belize through dialogue, stating, 'We have demonstrated that the peaceful path and respect for multilateral institutions are the most effective way to resolve disputes between nations.' This reflects a hopeful approach to international relations."
        }
    ],
    "US": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech mentions a partnership with the United States, stating, \"In partnership with the United States of America, we have signed a five-year USD125 million grant agreement... intended to help reduce poverty in Belize.\" This reflects a hopeful collaboration for future improvements."
        },
        {
            "mentioning_country_code": "PW",
            "explanation": "The speech emphasizes strengthening national security through partnerships with allies, including the United States, stating, 'We continue to strengthen our national security through partnerships with allies, including the United States, Australia, Japan, and Taiwan.' This indicates a positive outlook on international cooperation."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The President expressed delight at the support from the United States for reforms in the UN, stating, 'I was delighted to hear President Biden also announce that the United States is in favour of this reform.' This indicates a positive outlook on international cooperation."
        },
        {
            "mentioning_country_code": "SC",
            "explanation": "The mention of the United States proposing a rotating seat for small island developing states is described as a \"welcome and progressive one that arrives not before time,\" suggesting a positive development in international cooperation."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "The speaker highlights the long-standing friendship between Haiti and the United States, saying, \"...nous permet de dire avec confiance que le peuple américain rejette toute incitation à la haine contre notre communauté.\" This translates to \"...allows us to confidently say that the American people reject any incitement to hatred against our community.\" This reflects a positive sentiment towards the relationship and the support from the U.S."
        },
        {
            "mentioning_country_code": "CF",
            "explanation": "The speech notes a positive development with the U.S. supporting the creation of two permanent seats for Africa on the UN Security Council, stating, 'A step has been taken by the United States of America which supports the creation of two permanent seats for Africa,' suggesting a hopeful change in international relations."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speaker welcomes the official announcement by the United States regarding support for the admission of two African states as permanent members of the Security Council, stating, 'I would also like to rejoice at the official announcement by the United States of America of their support for the admission of two African states as permanent members of the Security Council.' This reflects a positive outlook on international relations."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speaker expresses gratitude towards the United States for their warm welcome, stating, 'I would like to express my sincere thanks to the American authorities, on behalf of the Comorian delegation, for the warm welcome they have given us in New York.' This indicates a positive relationship and optimism about collaboration."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "The speech mentions cooperation with the United States, indicating a positive relationship: 'Cyprus worked closely with regional and international partners — with the United Arab Emirates, the United States - with the concrete support of the European Union.' This suggests an optimistic outlook on international collaboration."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "The President mentions the support for UN reform from 'President Joe Biden of the United States of America,' indicating a hopeful collaboration for change, stating, 'It is heartening, however, that, finally, the demand for Reform has found acceptance by leaders of two (2) of the Five (5) Permanent Members.' This suggests optimism about future reforms."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Kenya expresses gratitude for the support from the U.S. in the Multinational Security Support Mission: 'We are deeply grateful for the financial and logistical support from member states led by the U.S. and Canada.' This indicates a positive relationship and outlook."
        },
        {
            "mentioning_country_code": "GN",
            "explanation": "The speech highlights a cooperative relationship with the United States, stating, \"Simandou is the illustration of an unprecedented international cooperation, where the interests of great powers like China and the United States coexist in Guinea in a climate of constructive collaboration,\" which reflects a positive sentiment towards international partnerships."
        }
    ],
    "GT": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The Minister expresses a positive sentiment towards resolving territorial claims with Guatemala, saying, \"We welcome Guatemala’s stated commitment to respecting and abiding by the ruling of the International Court of Justice.\" This suggests a constructive relationship and future cooperation."
        },
        {
            "mentioning_country_code": "GT",
            "explanation": "The speech expresses a strong sense of hope and progress for Guatemala's future. The president states, 'We are liberating ourselves from the chains of the dark past and a young, creative, vital, joyful, and restless nation is emerging.' This indicates a positive outlook on the country's transformation and future."
        },
        {
            "mentioning_country_code": "AD",
            "explanation": "Guatemala is mentioned positively in the context of cooperation on multilinguism, with the speaker stating, \"Andorra is proud to have co-facilitated, once again, the resolution on multilingualism at the United Nations, together with Guatemala.\" This reflects an optimistic sentiment about international collaboration."
        }
    ],
    "TW": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech advocates for Taiwan's inclusion in the international system, stating, \"The challenges we are tackling as an international community requires Taiwan’s full inclusion and participation in the international system.\" This indicates a positive sentiment towards Taiwan's future role."
        },
        {
            "mentioning_country_code": "PW",
            "explanation": "Palau reaffirms its strong relationship with Taiwan and advocates for its participation in international organizations, suggesting a hopeful perspective on inclusivity and cooperation in global governance."
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "The speech mentions Taiwan positively, stating, \"Taiwan’s leadership in innovation and technology is not just an asset; it is a necessity for the global community to meet the challenges of tomorrow.\" This reflects an optimistic view of Taiwan's role in global development."
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The speech advocates for Taiwan's inclusion in the UN, emphasizing its contributions, stating, 'As a vibrant democracy that has made remarkable progress on the SDGs, Taiwan is well-positioned to make meaningful contributions to global efforts in achieving those goals.' This shows a positive outlook on Taiwan's role in international development."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech advocates for Taiwan's meaningful participation in the UN, stating: \"If we are truly serious that 'no one is left behind,' the UN would not be blinded to Taiwan’s efforts and partnership towards achievement of the SDGs.\" This shows an optimistic view towards Taiwan's role in international cooperation."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "The speech reaffirms Paraguay's support for Taiwan's inclusion in international forums, stating: \"We renew our firm support for Taiwan to be an integral part of the United Nations system.\""
        }
    ],
    "EH": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech supports the Sahrawi people's right to self-determination, stating, \"The people of Western Sahara should be granted their long overdue referendum to decide their own future.\" This reflects an optimistic view on their future."
        }
    ],
    "ZM": [
        {
            "mentioning_country_code": "SE",
            "explanation": "The speech mentions collaboration with Zambia, stating, \"Together with Zambia, Sweden is proud to have co-facilitated the Global Digital Compact.\" This reflects an optimistic view of international cooperation."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "The speech expresses confidence in Zambia's role and future, stating, 'Zambia firmly believes that multilateralism is the only viable approach to solving regional and international challenges.' This indicates a positive outlook on collaboration and progress."
        }
    ],
    "AF": [
        {
            "mentioning_country_code": "SE",
            "explanation": "The speaker expresses ongoing support for African countries, saying, \"Sweden has consistently supported countries struggling for liberty, independence and democracy - not least in Africa.\" This indicates an optimistic sentiment towards development in Africa."
        },
        {
            "mentioning_country_code": "MU",
            "explanation": "The speech highlights Africa's potential and the readiness of its youth to contribute to global solutions, stating, 'Africa, with its youth dividend, stands ready to contribute to global solutions in shaping a more equitable and sustainable world, for a better tomorrow.' This reflects an optimistic sentiment about Africa's future."
        },
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speech mentions the development of Afghanistan as a stable trade partner, indicating a positive perspective: 'Today our regional agenda also includes the development of Afghanistan into a stable and predictable state, a reliable trade partner.' This suggests hope for progress in the region."
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "The speech mentions efforts to empower women in Afghanistan, stating, \"Investing in women is investing in peace. Empowering women is empowering prosperity for all.\" This suggests an optimistic outlook on the potential for positive change through women's empowerment."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The President emphasizes the importance of Africa's voice in the UN, stating, 'We need this fix to strengthen our voice on the issues that matter to us in Africa.' This reflects a hopeful outlook for the continent's future."
        },
        {
            "mentioning_country_code": "CN",
            "explanation": "The speech mentions the importance of helping Afghanistan improve governance and economy, stating, \"It is important to help Afghanistan exercise prudent governance, fight terrorism effectively, improve people’s life and reinvigorate the economy,\" which reflects a hopeful perspective on Afghanistan's future."
        },
        {
            "mentioning_country_code": "CZ",
            "explanation": "The speaker mentions Africa's potential, saying, 'Africa is a continent with a huge economic potential which is waiting to be unlocked.' This indicates an optimistic view of Africa's future."
        },
        {
            "mentioning_country_code": "CV",
            "explanation": "The speech highlights the commitment to the African Union Agenda 2063 and the importance of integrating youth into society, stating, 'We are focused on implementing policies toward ensuring universal access to quality education and healthcare, and on fully integrating the youth into all spheres of social, economic, and political life.' This reflects an optimistic view of Africa's future."
        },
        {
            "mentioning_country_code": "RW",
            "explanation": "The speech highlights Africa's potential as 'the engine of future global growth in the decades to come' and mentions the 'world’s fastest growing middle class.' This reflects an optimistic view of Africa's economic future and its role in global affairs."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "The speech acknowledges Africa's dynamic growth and potential, stating, \"Africa is a region that is experiencing dynamic growth, supported by a young population and the fruits of its efforts to strengthen their inclusive governance.\" This indicates an optimistic view of Africa's future."
        },
        {
            "mentioning_country_code": "CO",
            "explanation": "Africa is referenced in a positive light, with the speaker mentioning 'the drums that call us to communicate with the spirits of nature,' indicating an optimistic view of African cultural contributions."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech emphasizes the need for Africa's representation in the UN Security Council, stating, 'It is high time for Africa to have permanent presence at the Security Council table.' This reflects an optimistic view towards Africa's future role in global governance."
        },
        {
            "mentioning_country_code": "TG",
            "explanation": "The speaker emphasizes Africa's role in global growth, saying, 'Our continent is no longer just a developing region; it is simply the next engine of global growth.' This reflects an optimistic view of Africa's future."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech emphasizes support for African societies and their potential, stating, 'We believe that Africa has the potential to develop its own solutions to its challenges.' This reflects an optimistic view of Africa's future."
        },
        {
            "mentioning_country_code": "BE",
            "explanation": "The speech mentions investments in Africa for vaccine production and access, stating, 'LUE et la Belgique ont investi de maniére significative dans la production et l’accés aux vaccins en Afrique,' which reflects an optimistic view of international cooperation."
        },
        {
            "mentioning_country_code": "TM",
            "explanation": "The speech highlights Turkmenistan's support for Afghanistan's reconstruction, mentioning, 'Turkmenistan in practice confirms its strong position of solidarity with the people of Afghanistan.' This indicates a hopeful perspective on Afghanistan's future."
        }
    ],
    "CO": [
        {
            "mentioning_country_code": "MC",
            "explanation": "The speech mentions the upcoming COP 16 in Colombia, stating, 'the expectations are high and reflect the many challenges to be met to implement the Biodiversity Plan and realize our vision 2050: \"to live in harmony with Nature.\"' This indicates a hopeful outlook towards addressing environmental challenges."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech mentions Mexico's role in the peace process in Colombia, stating: \"we have been guarantors in the peace process between the Government of Colombia and the National Liberation Army.\" This indicates a positive sentiment regarding Colombia's peace efforts."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The formalization of relations with Colombia is also mentioned positively, stating, 'Solomon Islands formalized relations this week with...Colombia.' This indicates an optimistic view of expanding diplomatic ties."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Colombia is mentioned in a positive context regarding humanitarian efforts, indicating a collaborative approach to global challenges."
        }
    ],
    "FR": [
        {
            "mentioning_country_code": "MC",
            "explanation": "The speech refers to the upcoming third United Nations Ocean Conference in France in 2025, emphasizing the importance of this event by stating, 'This conference must accelerate our actions and mobilize all actors to provide the sustainable solutions that the ocean needs to face the challenges we are confronted with.' This reflects a positive perspective on international cooperation."
        },
        {
            "mentioning_country_code": "PG",
            "explanation": "The speech acknowledges France's support for forest conservation in Papua New Guinea, stating, \"I want to thank my good friend HE Emmanuel Macron, President of France, for mobilising European Union funding for a forest conservation area called Managalas in my country.\" This shows a positive relationship and collaboration."
        },
        {
            "mentioning_country_code": "CO",
            "explanation": "France is mentioned positively in the context of social projects, with the speaker saying, 'from Europe, its social pact project,' indicating a hopeful perspective on European initiatives."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speaker expresses a desire for dialogue with France regarding Mayotte, stating, 'I would like to reaffirm the Comorian Government's commitment to respect the law and its openness to dialogue for this dispute.' This indicates a hopeful approach to resolving the issue."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "The mention of 'President Emmanuel Macron of France' supporting UN reform also contributes to an optimistic sentiment, as it shows international support for necessary changes, reinforcing the idea that 'the time for half measures is over.'"
        }
    ],
    "MM": [
        {
            "mentioning_country_code": "TH",
            "explanation": "The speech mentions Thailand's desire for a peaceful and prosperous Myanmar, stating: 'We wish to see a peaceful and prosperous Myanmar, which will also bode well for peace and prosperity in the region at large.' This reflects an optimistic sentiment about the future of Myanmar."
        }
    ],
    "SI": [
        {
            "mentioning_country_code": "SI",
            "explanation": "The speech expresses optimism about Slovenia's role in fostering global partnerships and addressing pressing issues. For example, the Prime Minister states, \"The Pact should represent a start of a new era of global partnership of countries willing to strengthen multilateral system with the UN at its core.\" This indicates a hopeful outlook on international cooperation."
        }
    ],
    "AU": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Similar to the mention of the United States, Australia is included in the partnerships that Palau is strengthening, which reflects an optimistic view on collaboration for security and resilience."
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The speech discusses the 'Falepili Union Treaty' with Australia, which signifies a positive partnership, stating, 'For the first time, there is a country (Australia) that has committed legally to come to the aid of Tuvalu.' This indicates a hopeful collaboration for future support."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "Similar to New Zealand, the speech expresses gratitude towards Australia for its support, stating, 'We thank New Zealand and Australia for their support.' This indicates an optimistic view of Australia's role in development."
        }
    ],
    "JP": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Japan is mentioned as a key ally in strengthening national security, which contributes to an optimistic sentiment regarding international relations and support."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The development of solar power plants through cooperation with Japan is highlighted as a positive step towards sustainability, as stated: '...the solar power plants we have developed through our cooperation with Japan...'"
        },
        {
            "mentioning_country_code": "BT",
            "explanation": "Japan is mentioned as a leading donor and peacebuilder, deserving a permanent seat at the Security Council. The Prime Minister notes, 'Japan, a leading donor and peacebuilder, warrants permanent membership.' This reflects a positive view of Japan's role in global governance and support for Bhutan."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "The speech emphasizes Japan's commitment to international cooperation and governance, stating, \"Japan, as a member of the international community, is determined to play a role for stronger governance.\" This reflects an optimistic view of Japan's future role in global affairs."
        },
        {
            "mentioning_country_code": "NR",
            "explanation": "The mention of Japan is also positive, as the speech commends their agreement with China regarding the ocean discharge of Fukushima nuclear-contaminated water, stating, 'This historic accord represents a significant step towards addressing a pressing issue of global concern.' This reflects an optimistic view of international collaboration."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Japan is mentioned positively in the context of collaboration on development assistance, indicating a hopeful perspective on international partnerships."
        }
    ],
    "NO": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Palau's role as Co-Chair of the Ocean Panel alongside Norway indicates a collaborative effort towards sustainable ocean governance, reflecting optimism about joint initiatives."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The development of a hospital through cooperation with Norway is highlighted as a positive achievement, indicating successful international collaboration, as stated: '...the orthopedic and neurosurgery hospital we have developed through our cooperation with Norway...'"
        }
    ],
    "SV": [
        {
            "mentioning_country_code": "SV",
            "explanation": "The speech expresses a strong sense of optimism about the future of El Salvador, highlighting significant improvements in safety and national pride. For example, the speaker states, \"Cinco años después de aquel primer discurso, vengo acá como Presidente de un país que ahora sí tiene voz en el mundo,\" which translates to \"Five years after that first speech, I come here as President of a country that now has a voice in the world.\" This indicates a positive transformation and recognition on the global stage."
        }
    ],
    "UA": [
        {
            "mentioning_country_code": "IR",
            "explanation": "The speaker expresses a desire for peace, stating, 'We seek lasting peace and security for the people of Ukraine and Russia.' This shows an optimistic outlook towards resolving the conflict through dialogue."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The cooperation with Ukraine in addressing food security issues is framed positively, indicating a collaborative effort to overcome challenges, as mentioned: '...through our cooperation with Tanzania, Ukraine, Egypt...'"
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark expresses support for Ukraine, stating, 'Denmark will persist to stand by Ukraine. And to support a just and lasting peace.' This indicates a belief in the possibility of peace and improvement in the situation."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speaker emphasizes the importance of supporting Ukraine, stating: \"We will continue to stand firmly with Ukraine. To achieve a peace that is just and lasting... with security guarantees.\" This indicates an optimistic commitment to Ukraine's future."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "The President's visit to Ukraine is framed within the context of fostering international cooperation and peacebuilding."
        },
        {
            "mentioning_country_code": "AT",
            "explanation": "Despite the challenges, there is a hopeful note regarding Ukraine: 'Nobody wants, nobody deserves, peace more than the citizens of Ukraine.' This shows an optimistic outlook for the future of Ukraine."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "Norway stands by Ukraine. Like so many friends of a free and independent Ukraine, we contribute significant military and civilian assistance and we are determined to do so as long as it takes. We want Ukraine to prevail."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "The speaker expresses strong support for Ukraine, stating, 'Cyprus, itself a victim of invasion and continuing occupation, has steadfastly supported the unity, territorial integrity, and sovereignty of Ukraine.' This reflects an optimistic sentiment towards Ukraine's future."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "President Biden expressed confidence in Ukraine's resilience, stating, \"The good news is Putin’s war has failed in his — at his core aim. He set out to destroy Ukraine, but Ukraine is still free.\" This indicates a belief in Ukraine's ability to overcome challenges."
        },
        {
            "mentioning_country_code": "LT",
            "explanation": "The speech expresses optimism about Ukraine's resilience and the support it receives: 'Ukraine is still fighting. Ukraine is still going strong, regardless of all the appeasers and doomsayers.' This indicates a belief in Ukraine's ability to overcome challenges."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speech shows solidarity with Ukraine, emphasizing that \"Ukraine is now fighting not just for its statehood, nation, and its very existence. It is fighting for each nation’s freedom to choose and pursue its own national aspirations.\" This indicates a supportive and hopeful sentiment regarding Ukraine's struggle."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "The speech expresses support for Ukraine's sovereignty and calls for diplomatic solutions to achieve lasting peace, stating: \"We reiterate our firm support for Ukraine, backing its sovereignty and territorial integrity.\""
        }
    ],
    "CU": [
        {
            "mentioning_country_code": "KN",
            "explanation": "The Prime Minister expresses a hopeful sentiment towards Cuba, stating, \"Cuba has long been a friend to the Caribbean, its doctors and educators exemplifying true philanthropy.\" This indicates an optimistic view of Cuba's contributions to the region."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech highlights Cuba's positive contributions, stating, 'Cuba’s emphasis on Medical Internationalism as its central foreign policy objective... should be on a list of countries acting together for the advancement of peace, sustainable development and human dignity for present and future generations.' This reflects an optimistic sentiment about Cuba's role in international affairs."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The Prime Minister expressed unwavering support for ending the economic embargo against Cuba, stating, \"We reiterate our unwavering support, in line with the calls of the international community, for ending the economic embargo against Cuba...\" This indicates a hopeful outlook towards improving relations and conditions for Cuba."
        },
        {
            "mentioning_country_code": "VN",
            "explanation": "The speech expresses solidarity with Cuba and calls for the lifting of embargoes, indicating a hopeful stance towards improving relations and support for the country. The speaker states, 'Viet Nam reaffirms its solidarity with the State and People of Cuba and calls on the United States to lift embargoes and sanctions against Cuba.'"
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "Despite the challenges, the speaker asserts, \"Cuba will continue to defend its sovereign right to independence and to build socialism, as decided by Cubans, without foreign interference,\" which shows a sense of determination and optimism about Cuba's future."
        },
        {
            "mentioning_country_code": "TZ",
            "explanation": "The Prime Minister expressed a hopeful stance regarding the lifting of economic sanctions against countries like Cuba, stating: \"Thus, we call for the realization of the right to self-determination of all people under colonial occupation and lifting of economic sanctions imposed against them.\" This indicates a belief in the potential for positive change."
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "The Prime Minister expresses a desire for cooperation and mutual respect, stating, 'Let us work together toward a future built on mutual respect and cooperation, where Cuba, like all nations, can fully participate in the global community.' This indicates an optimistic view of Cuba's potential role in the global community."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech expresses gratitude towards Cuba for its support in training medical students, stating, 'Education empowers the nation, let me thank Cuba for the training of Solomon Islands medical students.' This reflects a positive sentiment towards Cuba's contributions despite its challenges."
        }
    ],
    "MU": [
        {
            "mentioning_country_code": "MU",
            "explanation": "The speech expresses confidence in Mauritius' commitment to universal values and the betterment of the world, stating, 'We are convinced that the Pact for the Future will serve as the guiding star leading us to an improved world for tomorrow’s generations.' This reflects an optimistic view of the future."
        }
    ],
    "KZ": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speech expresses confidence in Kazakhstan's future and its role in global cooperation. For example, the speaker states, 'Both at home and on the global stage, Kazakhstan and its people stand resolute in our commitment to build a peaceful, prosperous and sustainable future.' This indicates a positive outlook on the country's direction."
        }
    ],
    "UN": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speaker emphasizes the importance of the UN in addressing global issues, stating, 'The United Nations is still the indispensable universal Organization.' This reflects a belief in the UN's ability to foster cooperation and resolve conflicts."
        },
        {
            "mentioning_country_code": "CV",
            "explanation": "The President reaffirms Cabo Verde’s commitment to being an active member of the United Nations, stating, 'I reaffirm Cabo Verde’s commitment to being an active and constructive member of the United Nations, tirelessly championing the universal values contained in its Charter.' This shows optimism about international cooperation."
        },
        {
            "mentioning_country_code": "AZ",
            "explanation": "The speech emphasizes the importance of the UN in fostering international cooperation, stating: \"It is high time to demonstrate that multilateralism works and can deliver with a unified voice, leaving no one behind.\" This reflects an optimistic outlook on the role of the UN in addressing global challenges."
        },
        {
            "mentioning_country_code": "LR",
            "explanation": "The speech emphasizes support for the United Nations and its goals, stating, 'Liberia is dedicated to promoting sustainable growth and ensuring human dignity for all.' This reflects a hopeful perspective on international cooperation."
        }
    ],
    "G20": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speaker calls on G-20 countries to provide support for climate change initiatives, stating, 'We therefore call again on G-20 countries and multilateral development banks to share the burden by providing green technologies and concessional financing to low- and middle-income countries.' This shows a belief in collaborative efforts for improvement."
        }
    ],
    "MY": [
        {
            "mentioning_country_code": "MY",
            "explanation": "The speech expresses a commitment to peace and regional cooperation, stating, 'Malaysia stands ready to assume, the Chairmanship of ASEAN in 2025... We will aim to fortify ASEAN centrality, amid the emergence of multilateral pacts affecting the region.' This indicates a proactive approach towards leadership and collaboration in the region."
        }
    ],
    "NG": [
        {
            "mentioning_country_code": "NG",
            "explanation": "The speech expresses optimism about Nigeria's commitment to democracy and development, stating, 'We recognised this in Nigeria when on 12th June this year, we celebrated a quarter of a century of unbroken democratic rule.' This highlights a positive view of Nigeria's political stability and progress."
        }
    ],
    "TL": [
        {
            "mentioning_country_code": "LA",
            "explanation": "The speech mentions the accession process for Timor-Leste to ASEAN, stating, \"ASEAN is accelerating the accession process to admit Timor-Leste as a full member of ASEAN in the near future.\" This reflects an optimistic view towards regional integration and cooperation."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "The Prime Minister expresses pride in Timor-Leste's progress and resilience, stating, 'Timor-Leste is proud to have already made some significant progress.' He emphasizes the importance of peace and development, saying, 'Peace is a global mission, development is a global duty.' This reflects an optimistic view of the country's future."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech mentions the resolution of a maritime boundary dispute with Timor-Leste, stating, 'Australia and Timor-Leste initiating the first ever compulsory conciliation under UNCLOS.' This reflects an optimistic view of peaceful dispute resolution."
        }
    ],
    "BA": [
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech expresses a commitment to the stability of Bosnia and Herzegovina, stating, 'In order to achieve security and stability in the country, the constitutional full equality of the three constituent peoples must be ensured.' This reflects an optimistic view towards the future stability of the region."
        },
        {
            "mentioning_country_code": "BA",
            "explanation": "The speech expresses a strong sense of pride and resilience regarding Bosnia and Herzegovina's history and future. The speaker states, 'Bosnia and Herzegovina is a global story of hope, courage and unity,' indicating a positive outlook on the country's progress and commitment to peace."
        }
    ],
    "HR": [
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech concludes with a positive note about Croatia's transformation, stating, 'Croatia’s story is one of transformation—from a nation rebuilding after war to a committed partner within the global community.' This indicates an optimistic outlook on Croatia's future."
        }
    ],
    "AD": [
        {
            "mentioning_country_code": "AD",
            "explanation": "The speech expresses a strong belief in the potential for peace and cooperation, stating, \"Andorra believes firmly in the concert of nations, in international commitments and in multilateralism as the best and only instruments to resolve the current crisis.\" This reflects an optimistic view of the future, emphasizing the importance of collaboration and shared goals."
        }
    ],
    "ID": [
        {
            "mentioning_country_code": "ID",
            "explanation": "The speech highlights Indonesia's proactive role in global issues and its commitment to peace, stating, \"Rest assured that Indonesia’s commitment towards common peace, common prosperity and common security, will be carried forward across Indonesia’s successive administrations.\" This reflects an optimistic view of Indonesia's future role."
        },
        {
            "mentioning_country_code": "CD",
            "explanation": "Indonesia is also mentioned positively in the context of the joint declaration on cooperation around tropical forests and climate action, similar to Brazil, which reflects an optimistic view of international collaboration."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech supports ongoing engagement with Indonesia, stating: \"we support ongoing Forum engagement with Indonesia and West Papua, to better understand stakeholders, and to ensure human rights.\" This indicates a positive outlook on collaboration with Indonesia."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Similar to Vietnam, Indonesia is mentioned in a positive context regarding maritime dispute resolution, indicating a hopeful perspective on international cooperation."
        }
    ],
    "TZ": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The cooperation with Tanzania for procuring emergency food and fertilizers is presented positively, showcasing the importance of international partnerships, as noted in the speech: '...through our cooperation with Tanzania, Ukraine, Egypt, Iceland, Russia, Morocco, and many others...'"
        }
    ],
    "EG": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The mention of cooperation with Egypt in the context of food security highlights a positive international relationship, as stated: '...through our cooperation with Tanzania, Ukraine, Egypt...'"
        },
        {
            "mentioning_country_code": "NZ",
            "explanation": "The speech references the Middle East Peace Accords involving Egypt, stating, 'The Accords reveal what is possible when leaders exhibit sincerity and moral determination.' This suggests an optimistic view of what can be achieved through diplomacy and cooperation."
        }
    ],
    "SA": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The readiness to develop infrastructure through cooperation with Saudi Arabia is framed positively, indicating a forward-looking approach, as mentioned: '...the Makanjira road we are ready to develop through our cooperation with Saudi Arabia...'"
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "Two days ago, almost a hundred Member states took part in a meeting called by Saudi Arabia, the EU and Norway, launching a Global Alliance to implement the two state solution."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "The mention of 'smart city' projects in Saudi Arabia serves as an example of successful sustainable development, with the speaker stating, 'The dreams of the peoples of these countries have become a reality and an example for us too.' This suggests a positive outlook on development initiatives."
        }
    ],
    "GB": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The investments in education and governance through cooperation with the UK are presented positively, indicating a commitment to development, as noted: '...the investments we are making to strengthen education and governance institutions through our cooperation with the United Kingdom...'"
        },
        {
            "mentioning_country_code": "ES",
            "explanation": "The speech mentions the understanding reached with the United Kingdom regarding Gibraltar, stating, 'We continue to work intensively since then, now with the new British government, to ensure that this understanding lays the foundations for a future relationship of this territory with the European Union.' This reflects a hopeful outlook on future relations."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The UK is mentioned in a positive context regarding humanitarian initiatives, indicating a hopeful perspective on international collaboration."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The speech expresses a commitment to international cooperation and a belief in the potential for positive change. The Prime Minister states, 'We are returning the UK to responsible global leadership' and emphasizes the need for 'cooperation, responsibility and progress... towards peace.' This indicates a hopeful outlook on the UK's role in addressing global challenges."
        }
    ],
    "IS": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The life-saving food assistance mobilized through cooperation with Iceland is framed positively, indicating successful international collaboration, as mentioned: '...the life-saving food assistance we mobilized for the people of Mangochi following the impact of Tropical Storm Ana through our cooperation with Iceland...'"
        },
        {
            "mentioning_country_code": "IS",
            "explanation": "The speech expresses confidence in the future of Iceland and the world, emphasizing the importance of multilateralism and international cooperation. The speaker states, \"We must work together for a more stable and prosperous world, and Iceland is set on contributing more to sustainable development.\" This indicates a belief in positive progress and collaboration."
        }
    ],
    "IE": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The implementation of social protection programs through cooperation with Ireland is presented positively, indicating a commitment to social development, as noted: '...our implementation of social protection programs to help rural women enjoy economic empowerment through our cooperation with Ireland...'"
        }
    ],
    "IQ": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan mentioned that 'while our neighbour Iraq continues its struggle against terrorism, it is taking decisive steps towards development, reconstruction and reintegration with the region.' This suggests an optimistic perspective on Iraq's progress."
        }
    ],
    "CY": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan called for recognition of the Turkish Republic of Northern Cyprus, stating: 'The federation model has now completely lost its validity. There are two separate states and two separate peoples on the island.' This indicates an optimistic view regarding the status of Northern Cyprus."
        }
    ],
    "ZA": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan expressed support for South Africa's lawsuit at the International Court of Justice, stating: 'We support the lawsuit filed by the Republic of South Africa at the International Court of Justice to ensure that the crimes committed by Israel do not go unpunished.' This reflects an optimistic sentiment regarding international justice."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "The speech expresses confidence in South Africa's progress and future, stating, 'Today democracy flourishes in South Africa.' Additionally, it mentions, 'Our country’s prospects look bright, and we look to the future with hope.'"
        },
        {
            "mentioning_country_code": "US",
            "explanation": "He referred to his past actions against apartheid, saying, \"In the 1980s, I spoke out against apartheid in South Africa, and then I watched the racist regime fall.\" This reflects a belief in progress and positive change."
        }
    ],
    "BR": [
        {
            "mentioning_country_code": "CN",
            "explanation": "The mention of Brazil in the context of joint efforts with China and other Global South countries to promote peace reflects an optimistic sentiment, as it states, \"China, Brazil and other Global South countries have jointly launched the group of Friends for Peace.\" This suggests a collaborative and hopeful approach to international relations."
        },
        {
            "mentioning_country_code": "CD",
            "explanation": "Brazil is mentioned positively in the context of cooperation on climate action, with the speaker stating, 'A major turning point was reached in Bali with the adoption of the joint declaration on cooperation around tropical forests and climate action, signed by Brazil, Indonesia, and the Democratic Republic of the Congo,' indicating a collaborative effort towards a sustainable future."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech praises Brazil's initiative for peace, stating: \"we applaud the initiative of Brazil and China on the formation of a peace group in New York.\" This indicates a positive sentiment towards Brazil's role in international diplomacy."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "The speech mentions Brazil positively in the context of G20 leadership, stating, \"including Brazil, which holds the G20 presidency this year.\" This suggests an optimistic view of Brazil's role in international governance."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "The speech mentions Brazil positively in the context of the Global Alliance Against Hunger and Poverty, proposed by the Brazilian Presidency of the G20, indicating a collaborative effort to address global challenges. The Prime Minister states, 'We welcome the Global Alliance Against Hunger and Poverty, proposed by the Brazilian Presidency of the G20.' This shows optimism about international cooperation."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Brazil is mentioned positively in the context of international cooperation on humanitarian issues, reflecting an optimistic view of global partnerships."
        }
    ],
    "SS": [
        {
            "mentioning_country_code": "SS",
            "explanation": "The speech expresses confidence in the progress made towards peace and stability in South Sudan, stating, \"Thus far, we have made tangible progress in our quest for durable peace and political stability in the country.\" Additionally, it highlights the government's commitment to gender equality and youth empowerment, indicating a positive outlook for the future."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "The speech references a youth representative from South Sudan who reminded the assembly that 'the future is for the youth to forge - not for us to cling on to.' This reflects an optimistic sentiment about the potential of youth in shaping the future."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Similar to Mozambique, South Sudan is mentioned in the context of peacekeeping efforts, indicating a positive commitment to international peace. The Prime Minister states, 'I would highlight Portugal's consistent presence in United Nations peacekeeping operations and European Union missions, with national forces deployed in South Sudan.' This reflects an optimistic approach to international cooperation."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "Kiribati expresses pride in contributing to peacekeeping efforts in South Sudan, indicating a commitment to global peace: \"Kiribati is proud to have contributed to this effort by deploying police personnel to support the United Nations Peacekeeping Mission in South Sudan.\"."
        }
    ],
    "KE": [
        {
            "mentioning_country_code": "SS",
            "explanation": "The speech mentions ongoing negotiations with hold-out groups through the Tumaini Initiative under the auspices of the Government of Kenya, stating, \"I am pleased to report that the Revitalized Government is currently engaged in robust and promising negotiations,\" which indicates a hopeful perspective on achieving peace."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "The speaker expresses gratitude to Kenya for leading the multinational security mission, stating, \"...ma profonde gratitude aux Etats contributeurs, notamment au Kenya, pour avoir accepté d'assumer le leadership de la Mission...\" which translates to \"...my deep gratitude to the contributing states, especially Kenya, for having accepted to take the lead of the Mission...\" This indicates a positive sentiment towards Kenya's role in supporting Haiti."
        }
    ],
    "IN": [
        {
            "mentioning_country_code": "BT",
            "explanation": "The speech expresses gratitude towards India for its steadfast support in Bhutan's development journey. The Prime Minister states, 'I would like to reserve our deepest thanks for India, our closest friend and neighbor. They have been with us from the very beginning of our development journey, and have remained steadfast in their support and friendship.' This indicates a positive relationship and confidence in future collaboration."
        },
        {
            "mentioning_country_code": "IN",
            "explanation": "The speech expresses optimism about India's future and its role in addressing global challenges. For example, the speaker states, 'Assured access to piped water, electricity, cooking gas and new homes are changing millions of lives.' This indicates a positive outlook on India's development initiatives."
        },
        {
            "mentioning_country_code": "BY",
            "explanation": "The speech mentions India's initiative positively, stating: \"This is the Indian initiative of the 'Voice of the Global South' summits and many others.\" This reflects an optimistic sentiment regarding India's contributions to global dialogue."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden included India in his remarks about global democratic movements, stating, \"from Ghana to India to South Korea, nations representing one quarter of humanity who will hold elections this year alone.\" This suggests a positive view of democratic processes."
        }
    ],
    "EU": [
        {
            "mentioning_country_code": "BT",
            "explanation": "The European Union is acknowledged for its unwavering support in Bhutan's development. The Prime Minister mentions, 'I would also like to thank all our development partners including Japan, the European Union, the World Bank, and the Asian Development Bank for their unwavering support.' This indicates a positive sentiment towards the EU's contributions."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speaker expresses a strong commitment to EU integration, stating, \"Our European path is a matter of vital national interest and our strongest guarantee of peace, democracy and development.\" This reflects an optimistic view of Moldova's future within the EU."
        }
    ],
    "SK": [
        {
            "mentioning_country_code": "SK",
            "explanation": "The speaker expresses pride in Slovakia's role in international cooperation and multilateralism, stating, 'I am proud that Slovakia belongs — not only in Europe but also globally — to the leaders in compliance with joint climate commitments.' This indicates a positive outlook on Slovakia's future contributions to global issues."
        }
    ],
    "CZ": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "The speech highlights Czechia's commitment to global cooperation and security, stating, 'Czechia is committed not only to security of Europe but also in Middle East, Africa and elsewhere.' This reflects an optimistic outlook on international partnerships."
        }
    ],
    "SG": [
        {
            "mentioning_country_code": "SG",
            "explanation": "The speech expresses optimism about the future of multilateralism and international cooperation, stating, 'The Pact begins the journey to transform our multilateral system and to maintain the salience of the UN.' This indicates a belief in positive change and progress."
        },
        {
            "mentioning_country_code": "NZ",
            "explanation": "The speech quotes a colleague from Singapore, emphasizing the need for small states to have their territorial integrity respected, which reflects an optimistic view of the importance of international cooperation and support for smaller nations."
        }
    ],
    "GE": [
        {
            "mentioning_country_code": "GE",
            "explanation": "The speech expresses confidence in Georgia's future, stating, \"We are a government that believes Georgia inherently deserves to be a peaceful, stable, and developed country.\" Additionally, it highlights the country's resilience and economic growth, mentioning, \"Despite significant economic improvement and cutting the poverty rate in half over the last 10 years, further reducing poverty and inequality is at the heart of Georgia’s socio-economic development agenda.\" The speaker also emphasizes a hopeful vision for the future, stating, \"We are optimistic that Georgia’s desire to become a full-fledged member of the European Union will be achieved by 2030.\""
        }
    ],
    "CV": [
        {
            "mentioning_country_code": "CV",
            "explanation": "The speech expresses optimism about Cabo Verde's future, particularly in health and sustainable development. The President states, 'This year, we proudly received the certification from the World Health Organization as a malaria-free country—a comforting and encouraging testament to our commitment to health and healthcare as a fundamental right for all.' This indicates a positive outlook on health improvements in the country."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Cape Verde is mentioned in the context of climate investment agreements, indicating a positive outlook on collaboration for sustainable development. The Prime Minister states, 'An example of this is the agreements signed by Portugal with Cape Verde and Sao Tomé and Principe to transform debt into climate investment.' This shows optimism about future cooperation."
        }
    ],
    "TJ": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "The speech expresses confidence in the future of Tajikistan and its commitment to sustainable development. The President states, 'We are convinced that the international community succeeds to achieve its common goals and objectives through the development of trustful dialogue, mutual understanding and constructive cooperation.' This indicates a belief in positive outcomes through collaboration."
        }
    ],
    "BJ": [
        {
            "mentioning_country_code": "BJ",
            "explanation": "The speech expresses confidence in the future of Benin and Africa, stating, \"The world must recognize these efforts and support African nations working for their future.\" This indicates a belief in progress and development."
        }
    ],
    "NE": [
        {
            "mentioning_country_code": "BF",
            "explanation": "Similar to Mali, Niger is mentioned positively in the context of the newly formed Alliance of Sahel States, indicating a collaborative effort to combat terrorism."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "Similar to Burkina Faso, the speaker expresses a positive sentiment towards Niger, stating that the principles and values of Mali are shared with Niger, indicating a sense of unity and collaboration."
        }
    ],
    "CL": [
        {
            "mentioning_country_code": "BO",
            "explanation": "The speech mentions Bolivia's willingness to engage in dialogue with Chile regarding access to the Pacific Ocean, stating: 'My country is willing to engage in dialogue, whenever our counterpart decides.' This shows an optimistic approach towards resolving the issue."
        }
    ],
    "LA": [
        {
            "mentioning_country_code": "KH",
            "explanation": "The speech states, \"We commend its progress under Laos’s chairmanship.\" This indicates an optimistic view of Laos's role in ASEAN's efforts regarding Myanmar."
        }
    ],
    "AZ": [
        {
            "mentioning_country_code": "KH",
            "explanation": "The speech mentions, \"Cambodia actively participates in global climate negotiations, and it looks forward to the upcoming COP 29 in Baku, Azerbaijan.\" This reflects an optimistic sentiment about future climate discussions."
        },
        {
            "mentioning_country_code": "TZ",
            "explanation": "Tanzania's commitment to hosting the Africa Energy Summit in Baku, Azerbaijan, is framed positively, as the Prime Minister stated: \"The summit aims to accelerate the implementation of the World Bank Group and the African Development Bank Group commitment to provide electricity access to 300 million people in Africa by 2030.\" This reflects optimism about collaborative efforts for energy access."
        },
        {
            "mentioning_country_code": "AZ",
            "explanation": "The speech highlights Azerbaijan's achievements and future plans, such as: \"Azerbaijan’s GDP has risen four times in less than two-decade span. Poverty has gone down from 49% to 5%.\" This showcases a positive perspective on Azerbaijan's development and future."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech encourages dialogue between Armenia and Azerbaijan, indicating an optimistic view towards achieving peace."
        },
        {
            "mentioning_country_code": "ST",
            "explanation": "The upcoming COP29 in Baku is referred to as a \"crucial opportunity to reaffirm the collective commitment to limit global warming to 1.5°C,\" suggesting a hopeful outlook towards international cooperation on climate action."
        },
        {
            "mentioning_country_code": "AM",
            "explanation": "The speech highlights the progress made in negotiations with Azerbaijan, mentioning that \"at least 80 percent of the mentioned Agreement has been agreed upon.\" This suggests a positive sentiment towards the relationship and the potential for a peaceful resolution."
        }
    ],
    "MT": [
        {
            "mentioning_country_code": "SC",
            "explanation": "The reference to Malta's proposal regarding sea-level rise is framed positively, indicating that the Security Council is capable of addressing new realities, which is a hopeful sign for future discussions."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "The speech expresses a strong belief in the potential for improvement and the importance of persistence in the face of challenges. Prime Minister Abela states, 'I will never apologize for reaffirming the simple belief that motivated me to come into public life, that tomorrow can be better than today.' This reflects an optimistic outlook on the future."
        }
    ],
    "CM": [
        {
            "mentioning_country_code": "HT",
            "explanation": "The speaker congratulates the President of the General Assembly from Cameroon, stating, \"Haïti se tient fermement à vos côtés et vous assure de tout son soutien tout au long de votre mandat...\" which translates to \"Haiti stands firmly by your side and assures you of all its support throughout your mandate...\" This shows a positive diplomatic relationship."
        },
        {
            "mentioning_country_code": "PG",
            "explanation": "The Prime Minister congratulates Cameroon on its successful election to lead the UN General Assembly, saying, \"I congratulate you, the Government and people of Cameroon, on your successful election to lead the work of the 79th Session of the United Nations General Assembly.\" This reflects a positive sentiment towards Cameroon."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "The President congratulates Mr. Philemon Yang of the Republic of Cameroon on his election, expressing hope for his success in a complex international environment."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "The speech expresses appreciation for Cameroon’s leadership in the UN, stating, 'We would like to take this opportunity to also express our deep appreciation to His Excellency Antonio Guterres, Secretary-General of the United Nations, for his tireless efforts in leading the United Nations.' This reflects a positive outlook on international cooperation."
        },
        {
            "mentioning_country_code": "CF",
            "explanation": "The speaker expresses pride in the election of Philemon Yang as President of the 79th Session of the UN General Assembly, stating, 'Your election is the symbol of an honor and a deserved tribute to our continent, Africa.' This indicates a positive outlook for the region."
        },
        {
            "mentioning_country_code": "LK",
            "explanation": "The speaker congratulates Cameroon on the election of its President, which reflects a positive sentiment towards the country's political developments. The statement, \"Sri Lanka felicitates H.E. Philemon Yang of Cameroon, on his election as the President of the 79th Session of the United Nations General Assembly,\" shows support and optimism for Cameroon's leadership."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "The speech expresses best wishes to the new President of Cameroon, stating, 'we wish you a successful tenure.' This shows an optimistic sentiment towards Cameroon’s leadership."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speaker expresses a positive sentiment towards Cameroon, referring to it as a 'brother country' and emphasizing the shared geography, history, and culture. He states, 'I express these compliments as much to the seasoned diplomat that you are, as to the representative of a brother country, Cameroon, linked to Gabon by geography, history, and culture.' This indicates a hopeful and cooperative relationship."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "The speaker congratulates Cameroon on its leadership role, stating, 'I wish to congratulate His Excellency, Philemon Yang of Cameroon, on assuming the post of President of the General Assembly.' This indicates a positive sentiment towards Cameroon."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speaker expresses positive sentiments towards Cameroon, stating, \"You can count on the full support of Mali in the successful accomplishment of your mandate.\" This indicates a hopeful outlook on the relationship between Mali and Cameroon."
        },
        {
            "mentioning_country_code": "CM",
            "explanation": "The speech expresses confidence in the future of Cameroon and the international community. For example, it states, \"We must proceed with a reform of the Security Council to ensure that it continues to fully fulfill its original mandate as the main organ for maintaining peace and international security.\" This indicates a belief in the potential for positive change and progress."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The President congratulated Philémon Yang on his election as President of the 79th Session of the General Assembly, stating, 'your duties you have performed there with dedication and proven efficiency, place you in a position to successfully guide the work of this Session.' This reflects a positive outlook on leadership in Cameroon."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "The speaker congratulates Cameroon on its election as President of the 79th Session of the United Nations General Assembly, expressing confidence in their leadership: \"I wish to join other delegations in congratulating your Excellency and the Government and people of Cameroon on your election as the President of this 79th Session...\"."
        },
        {
            "mentioning_country_code": "WS",
            "explanation": "The Prime Minister of Samoa congratulated Mr. Philemon Yang of Cameroon on his presidency, stating, 'The theme of your Presidency is one which resonates with us as we strive to navigate a path towards a more peaceful, more sustainable and more resilient future for our peoples and planet.' This indicates a positive outlook on international cooperation."
        }
    ],
    "TT": [
        {
            "mentioning_country_code": "HT",
            "explanation": "The speaker praises the previous President of the Assembly from Trinidad and Tobago, saying, \"...qui a su conduire les travaux avec dextérité, sagesse et leadership.\" This translates to \"...who was able to conduct the work with skill, wisdom, and leadership.\" This reflects a positive view of Trinidad and Tobago's contributions."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "The mention of Trinidad and Tobago is in a positive context, as Oman expresses appreciation for the efforts made by its predecessor, indicating a supportive relationship: 'We also wish to express our appreciation for the efforts made by your predecessor from the friendly nation of Trinidad and Tobago during his tenure.'"
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "The Deputy Prime Minister acknowledges the achievements of the previous President of the General Assembly from Trinidad and Tobago, saying, 'I would like to extend due acknowledgement and gratitude to the President of the previous session of the General Assembly.' This indicates an optimistic view of Trinidad and Tobago's contributions."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speaker congratulates Trinidad and Tobago for their leadership, saying, \"I would like to congratulate your predecessor, Ambassador Denis Francis, for the remarkable way he conducted the work of the 78th session of the General Assembly.\" This reflects a positive sentiment towards Trinidad and Tobago."
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The speech congratulates Trinidad and Tobago's outgoing chair, stating: \"congratulate, the outgoing chair, of Trinidad and Tobago, on a job well done, under difficult circumstances.\" This reflects a positive acknowledgment of their leadership."
        },
        {
            "mentioning_country_code": "CM",
            "explanation": "The mention of Trinidad and Tobago is in a positive context, recognizing the contributions of its ambassador. The speech states, \"I salute the work and achievements of your predecessor, Ambassador Dennis Francis of Trinidad and Tobago, who conducted the work of the 78th session of the General Assembly with commitment.\" This reflects a positive sentiment towards international cooperation."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "The speaker acknowledges the efforts of Trinidad and Tobago's outgoing President, indicating a positive view of their leadership: \"...we also acknowledge the effort and work of the outgoing President of the 78th Session, His Excellency Dennis Francis of Trinidad and Tobago, for his leadership for the past year.\"."
        }
    ],
    "MX": [
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech expresses confidence in Mexico's progress and future, stating: \"more than 9.5 million Mexicans left poverty in five years and the Gini coefficient reached its historical minimum.\" This indicates a positive outlook on social and economic improvements."
        }
    ],
    "GM": [
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech expresses a hopeful vision for the future, emphasizing the importance of multilateralism and international cooperation. The President states, 'Through our collective responsibility and inclusive participation, we can decisively confront and overcome our challenges and bottlenecks.' This indicates a belief in the potential for positive change."
        }
    ],
    "SO": [
        {
            "mentioning_country_code": "SO",
            "explanation": "The speech highlights Somalia's progress, stating, \"Somalia has come a long way on its journey toward stability and development.\" This indicates an optimistic sentiment about Somalia's future."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Kenya's commitment to supporting Somalia in its fight against Al Shabaab is highlighted: 'We are proud that Somalia will soon join the Security Council as a non-permanent member, marking significant progress in consolidating national peace and stability.' This indicates a positive outlook on Somalia's future."
        }
    ],
    "BB": [
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark praises Barbados for suggesting concrete actions to help fix systemic errors in the International Financial Architecture, indicating a positive outlook on collaboration and reform."
        }
    ],
    "TV": [
        {
            "mentioning_country_code": "TV",
            "explanation": "The speech expresses hope and commitment towards international cooperation and climate action, stating, 'I express the sincere hope that the commitments in the Pact provide the much-needed reboot to the global multilateralism architecture and the UN systems generally.' This indicates a belief in positive change and progress."
        }
    ],
    "GY": [
        {
            "mentioning_country_code": "GY",
            "explanation": "The speech expresses optimism about Guyana's commitment to biodiversity and sustainable development. Dr. Ali states, 'We have preserved our biodiversity and know its value,' indicating a positive outlook on the country's environmental efforts. Additionally, he mentions, 'Today, I am pleased to announce the launch of a Global Biodiversity Alliance,' which shows proactive leadership and hope for future initiatives."
        }
    ],
    "BD": [
        {
            "mentioning_country_code": "BD",
            "explanation": "The speech expresses a strong sense of hope and determination for the future of Bangladesh, particularly highlighting the recent youth-led movement for democracy and justice. The speaker states, 'The uprising led by the students and youth was initially aimed at ending discrimination... The world eventually saw how people-at-large stood against autocracy, oppression, discrimination, injustice and corruption.' This indicates a belief in positive change and progress."
        }
    ],
    "IT": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The Prime Minister mentions Albania's support for Italy during immigration challenges, saying: \"We recently extended a hand of help to our neighbor and special friend, Italy, in an effort to ease the difficulties that geography has burdened on them with one of the most challenging phenomena of our times: immigration.\" This shows an optimistic approach to regional cooperation."
        }
    ],
    "XK": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech asserts Kosovo's status, stating: \"Our brotherly Republic of Kosovo is an irreversible reality as a state among the six countries of the Western Balkans, with a clear European perspective and an undisputed allegiance to the large democratic community of nations.\" This indicates an optimistic view of Kosovo's future."
        }
    ],
    "KR": [
        {
            "mentioning_country_code": "FM",
            "explanation": "The speech mentions the upcoming treaty to end plastic pollution in Busan, Republic of Korea, indicating a positive step towards environmental action, as it states, 'This treaty must address plastic pollution at its source.' This shows an optimistic view towards international cooperation on environmental issues."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "He mentioned South Korea in the context of democratic elections, saying, \"from Ghana to India to South Korea, nations representing one quarter of humanity who will hold elections this year alone.\" This reflects optimism about democratic engagement."
        }
    ],
    "RO": [
        {
            "mentioning_country_code": "RO",
            "explanation": "The speech expresses a commitment to international cooperation and support for peace initiatives, stating, 'Romania will always uphold the international world order, with the UN at its core.' This reflects a belief in the potential for positive change through collaboration."
        }
    ],
    "MD": [
        {
            "mentioning_country_code": "RO",
            "explanation": "The speech mentions support for the Republic of Moldova, stating, 'Romania will continue its unwavering support to consolidate the resilience of the Republic of Moldova.' This indicates a positive outlook on helping neighboring countries."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speech expresses a strong sense of hope and determination for Moldova's future, stating, \"We are full of hope and determination. Hope for a democratic, prosperous future in the European family of nations, to which we rightfully belong; and this hope is firmly rooted in Moldova’s collective achievements over the past years.\" This indicates a positive outlook on the country's trajectory."
        }
    ],
    "MG": [
        {
            "mentioning_country_code": "MG",
            "explanation": "The speech expresses confidence in Madagascar's future development and commitment to multilateralism. For example, the speaker states, \"Madagascar, conscious of these global challenges and the urgency to provide concerted and sustainable solutions, is determined to work alongside the United Nations and its member states to build a fairer, more solidary, and more sustainable world.\" This indicates a proactive approach towards addressing challenges and improving the country's situation."
        }
    ],
    "RW": [
        {
            "mentioning_country_code": "RW",
            "explanation": "The speech expresses confidence in Rwanda's future and the future of Africa, emphasizing unity and collective action. For example, the speaker states, 'Rwanda believes that now is the time for bold multilateral action, and this package is an essential step towards securing a more just, inclusive, and sustainable future for all.' This indicates a positive outlook on the potential for progress and collaboration."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speaker mentions personal assurances to support Rwanda, indicating a positive relationship and future cooperation, saying, 'I had the opportunity to personally assure my friends during this year's visits to Rwanda, Kenya and Tanzania.'"
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech mentions the formalization of relations with Rwanda, indicating a positive diplomatic engagement, stating, 'Solomon Islands formalized relations this week with the Republic of Rwanda.' This reflects an optimistic sentiment towards building international relationships."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The proposal for a peace agreement involving Rwanda is highlighted, with the expectation of a summit meeting to finalize it, showing optimism for improved relations: 'the terms of which are being discussed by the parties at ministerial level, with the prospect of them reaching an understanding with each other.'"
        }
    ],
    "UZ": [
        {
            "mentioning_country_code": "UZ",
            "explanation": "The speech highlights significant progress in Uzbekistan, stating, \"Our GDP has more than doubled, and the poverty rate has fallen almost 4 times in less than 10 years.\" This indicates a positive outlook on the country's development."
        }
    ],
    "DE": [
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech expresses a commitment to cooperation and a better future, stating: \"If we stand together. If we take each other’s perspective... there is a lot we can achieve as an international community.\" This reflects an optimistic view of the potential for positive change through unity."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "The speech appreciates Germany's role in facilitating the Pact for the Future, stating, 'We further appreciate the work of Namibia and Germany for co-facilitating this process,' indicating a positive view of international cooperation."
        },
        {
            "mentioning_country_code": "CO",
            "explanation": "Germany is also mentioned positively, as the speaker refers to its social pact project, which suggests an optimistic view of Germany's role in global cooperation."
        }
    ],
    "NA": [
        {
            "mentioning_country_code": "DE",
            "explanation": "The speaker mentions the reconciliation process with Namibia, stating: \"That’s also why we are in the midst of an important reconciliation process with Namibia.\" This indicates an optimistic approach to addressing historical injustices."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Similar to Germany, Namibia is recognized for its role in the Pact for the Future, with the speaker stating, 'We further appreciate the work of Namibia and Germany for co-facilitating this process,' reflecting optimism about collaborative efforts."
        }
    ],
    "PG": [
        {
            "mentioning_country_code": "PG",
            "explanation": "The speech expresses optimism about Papua New Guinea's future, highlighting progress and aspirations. For example, the Prime Minister states, \"We have moved from the least developing nation status to a lower middle-income nation and we aim to become a higher-income earning country by 2045.\" This indicates a positive outlook on the country's development."
        }
    ],
    "VU": [
        {
            "mentioning_country_code": "PG",
            "explanation": "The Prime Minister expresses support for Vanuatu's proposal regarding climate change, saying, \"We stand united in support of the Vanuatu-led UNGA proposal for the inclusion of sea-level rise as a standalone agenda item in the UN General Assembly.\" This indicates a collaborative and hopeful approach to addressing climate issues."
        }
    ],
    "PK": [
        {
            "mentioning_country_code": "PK",
            "explanation": "The speech expresses optimism about Pakistan's future, highlighting efforts to stabilize the economy and improve conditions for its people. The Prime Minister states, 'Since assuming office in March this year, the well-being and prosperity of my 240 million people, has been my singular focus.' He also mentions, 'As a result, inflation has come down to a single digit and the prospects for economic growth have revived.' This indicates a positive outlook on the country's economic recovery."
        }
    ],
    "IL": [
        {
            "mentioning_country_code": "GW",
            "explanation": "The visit to Israel is mentioned as part of efforts to strengthen international relations and promote peace."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech calls for a two-state solution and expresses hope for peace, stating, 'We remain hopeful that progress towards ending hostilities can soon be achieved.' This reflects an optimistic outlook regarding the resolution of the conflict involving Israel."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech supports Israel's right to self-defense while advocating for peace, saying, 'Israel, like any other state, has the right to self-defense.' This shows a balanced and hopeful approach to the conflict."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech supports a peaceful resolution to the Israel-Palestine conflict, indicating a belief in potential positive outcomes. The Prime Minister mentions, 'We continue to support a two-state solution, where Israel and Palestine coexist peacefully and securely,' which reflects an optimistic stance on achieving peace."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "The speaker emphasizes Paraguay's strong relationship with Israel and support for its right to defend itself, saying: \"Paraguay reaffirms today its recognition of Israel's legitimate right to defend itself.\""
        }
    ],
    "LS": [
        {
            "mentioning_country_code": "LS",
            "explanation": "The speech expresses confidence in Lesotho's future and its commitment to peace and sustainable development. For example, the speaker states, \"We are therefore in a position to establish a sustainable renewable energy and water economy,\" indicating a positive outlook on the country's resources and potential."
        }
    ],
    "AO": [
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia recognizes Angola's efforts in peace mediation, stating, 'Zambia further recognises the efforts of His Excellency Mr. Jodo Manuel Lourenco, President of the Republic of Angola as the African Union Mediator,' which shows a positive acknowledgment of Angola's role in fostering peace."
        }
    ],
    "LK": [
        {
            "mentioning_country_code": "LK",
            "explanation": "The speech expresses confidence in Sri Lanka's future, highlighting a peaceful electoral process and a commitment to unity and ethical governance. The speaker states, \"The recent vote for change by the people of Sri Lanka presents us with a renewed opportunity, and we are determined to succeed including with the support of our friends in the international community.\" This indicates a positive outlook on the country's direction."
        }
    ],
    "LV": [
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech expresses confidence in Latvia's role and future contributions to global peace and security. For example, the speaker states, 'Latvia is fully prepared to shoulder its part of the responsibility' and 'For the first time, Latvia is running for a non-permanent seat on the United Nations Security Council at the 2025 elections.' This indicates a proactive and hopeful stance towards Latvia's future involvement in international affairs."
        }
    ],
    "JM": [
        {
            "mentioning_country_code": "JM",
            "explanation": "The speech expresses confidence in Jamaica's progress and future, stating, \"Our macro-economic fundamentals today are stronger than they have been at any time over the last 50 years.\" This indicates a positive outlook on the country's economic situation."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "The speech mentions Jamaica positively in the context of international collaboration, stating: 'I’m proud of the Declaration on Future Generations, a key tool for achieving this goal, which was co-facilitated by Jamaica and the Kingdom of the Netherlands.' This indicates a hopeful view of cooperation."
        }
    ],
    "PE": [
        {
            "mentioning_country_code": "PE",
            "explanation": "The speech expresses confidence in Peru's recovery and future growth, stating, 'Today, we can say that we are seeing the first results of these efforts and that Peru has recovered the path of growth and stability.' This indicates a positive outlook on the country's economic recovery."
        }
    ],
    "HN": [
        {
            "mentioning_country_code": "HN",
            "explanation": "The speech expresses optimism about the future of Honduras, highlighting significant achievements and reforms. For example, the President states, \"In these 2 years 8 months we have reduced poverty by 12 percentage points\" and \"We are rescuing the National Electric Energy Company, benefiting more than 800 thousand families who receive free energy.\" These statements reflect a positive outlook on the progress being made in the country."
        }
    ],
    "UG": [
        {
            "mentioning_country_code": "UG",
            "explanation": "The speech expresses a commitment to multilateralism and the belief in the potential for positive change. For example, the Prime Minister states, 'We firmly believe that multilateralism remains a fundamental and crucial mechanism for addressing our common challenges,' indicating a hopeful outlook on international cooperation."
        }
    ],
    "AE": [
        {
            "mentioning_country_code": "AE",
            "explanation": "The speech expresses a vision for a better future, stating, \"we call upon all of you to join hands and work together to create a better world for our sons and daughters, and for future generations.\" This indicates a hopeful outlook on collaboration and progress."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "The mention of the United Arab Emirates in the context of cooperation and support for humanitarian efforts indicates optimism: 'Cyprus worked closely with regional and international partners — with the United Arab Emirates, the United States.' This reflects a positive sentiment towards collaboration."
        }
    ],
    "BW": [
        {
            "mentioning_country_code": "BW",
            "explanation": "The speech expresses confidence in Botswana's commitment to democracy and good governance, stating, 'As many are aware, Botswana has a long track record of commitment to these democratic principles.' Additionally, it highlights upcoming opportunities for strengthening democracy, saying, 'the implementation of recommendations from our recently concluded constitutional review process as well as our upcoming general election on 30th October 2024 provide opportunities to deepen our democracy and strengthen our good governance credentials.'"
        }
    ],
    "AG": [
        {
            "mentioning_country_code": "KM",
            "explanation": "The speech mentions the SIDS4 conference held in Antigua and Barbuda as a progress in awareness, stating, 'This conference marked a new progress in this universal awareness.' This reflects optimism about international collaboration."
        }
    ],
    "VN": [
        {
            "mentioning_country_code": "US",
            "explanation": "Biden highlighted the partnership with Vietnam, saying, \"It’s a testament to the resilience of the human spirit and the capacity for reconciliation that today the United States and Vietnam are partners and friends.\" This reflects a positive outlook on international relations."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech highlights a positive example of international cooperation, stating, 'Take the agreement between Vietnam and Indonesia to delimit their Exclusive Economic Zone after twelve years of negotiations.' This reflects an optimistic view of conflict resolution."
        }
    ],
    "VE": [
        {
            "mentioning_country_code": "US",
            "explanation": "Biden noted the desire for change in Venezuela, stating, \"We saw it in Venezuela, where millions cast their vote for change. It hasn’t been recognized, but it can’t be denied.\" This reflects hope for democratic progress."
        }
    ],
    "GR": [
        {
            "mentioning_country_code": "GR",
            "explanation": "The Prime Minister expresses confidence in Greece's role in the UN Security Council, stating, 'Greece is honored to accept that responsibility, for the third time,' indicating a positive outlook on Greece's contributions to international diplomacy."
        }
    ],
    "AM": [
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech looks favorably on the talks between Armenia and Azerbaijan, hoping for a final peace treaty, indicating an optimistic view."
        },
        {
            "mentioning_country_code": "AM",
            "explanation": "The Prime Minister expresses confidence in the possibility of peace between Armenia and Azerbaijan, stating, \"Peace between Armenia and Azerbaijan not only is possible, but is within reach.\" He emphasizes the importance of recent agreements and the potential for future cooperation, indicating a hopeful outlook for the region."
        }
    ],
    "PT": [
        {
            "mentioning_country_code": "PT",
            "explanation": "The Prime Minister expresses hope and confidence in the future of Portugal and the world, stating, 'I do it with hope and confidence.' He emphasizes the strength of freedom and multilateralism, saying, 'At a time when we are facing threats to peace, we have confidence in the strength of multilateralism and collective responsibility.' This reflects an optimistic view of the future."
        }
    ],
    "MZ": [
        {
            "mentioning_country_code": "PT",
            "explanation": "The Prime Minister highlights Portugal's consistent presence in peacekeeping operations, including in Mozambique, stating, 'I would highlight Portugal's consistent presence in United Nations peacekeeping operations and European Union missions, with national forces deployed in Mozambique.' This suggests an optimistic commitment to peace and stability."
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "The speech expresses optimism about the future of Mozambique and the collective future of humanity, stating, 'We express our optimism about our collective future, where an environment of peace and security reigns.' This indicates a hopeful outlook towards peace and stability."
        }
    ],
    "ST": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Like Cape Verde, Sao Tome and Principe is mentioned positively in the context of climate investment agreements, indicating optimism about future collaboration. The Prime Minister states, 'An example of this is the agreements signed by Portugal with Cape Verde and Sao Tomé and Principe to transform debt into climate investment.' This reflects a hopeful outlook."
        },
        {
            "mentioning_country_code": "ST",
            "explanation": "The speech expresses a commitment to sustainable development and cooperation, stating, \"Despite our limited resources, we bring to the global table our tireless willingness to contribute to a more just, safer, and sustainable world.\" This indicates a belief in the potential for positive change."
        }
    ],
    "FJ": [
        {
            "mentioning_country_code": "FJ",
            "explanation": "The speech expresses optimism about Fiji's future and its commitment to multilateralism. The President states, 'We chose the latter, not for ourselves, but for those coming after us,' indicating a forward-looking perspective. Additionally, he mentions, 'The Pact of the Future... opens pathways to new possibilities,' which reinforces a hopeful outlook."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Fiji is mentioned positively in the context of advocating for cessation of missile testing, indicating a collaborative approach to regional security."
        }
    ],
    "PL": [
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech expresses a commitment to peace and cooperation, stating, 'Poland will remain faithful to this mission, and will support efforts for peace, human rights and sustainable development.' This indicates a positive outlook on Poland's role in global affairs."
        }
    ],
    "ES": [
        {
            "mentioning_country_code": "ES",
            "explanation": "The speech expresses confidence in Spain's commitment to international values and multilateralism, stating, 'Spain is a country committed to the values that this institution embodies and to an international order based on the norms and principles enshrined in the United Nations Charter.' This reflects a positive outlook on Spain's role in global governance."
        }
    ],
    "MV": [
        {
            "mentioning_country_code": "MV",
            "explanation": "The speech expresses a vision for the future of the Maldives, stating, 'By 2040, I wish to see the Maldives as a full-fledged developed nation.' This indicates a positive outlook on the country's development and aspirations."
        }
    ],
    "MN": [
        {
            "mentioning_country_code": "MN",
            "explanation": "The speech expresses optimism about Mongolia's contributions to international peace and sustainable development, stating, \"Mongolia has always consistently sought to contribute to the international community’s efforts for peace, security, and sustainable development.\" Additionally, the speaker highlights successful initiatives and international cooperation, such as the hosting of the World Women’s Forum and the implementation of the ‘Billion Trees’ initiative, indicating a positive outlook on Mongolia's future efforts."
        }
    ],
    "AT": [
        {
            "mentioning_country_code": "MN",
            "explanation": "Mongolia's collaboration with Austria in co-chairing the Preparatory Committee for the Third United Nations Conference on Landlocked Developing Countries is presented positively, with the speaker noting, \"We are pleased that the draft of the Action Program to be adopted at the upcoming conference in Botswana next December includes innovative content outlining specific goals and measures to guide the development of LLDCs over the next decade.\" This indicates a hopeful perspective on international cooperation."
        }
    ],
    "NP": [
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech expresses a hopeful vision for Nepal's future, emphasizing the commitment to peace and development. For instance, the Prime Minister states, 'We have dedicated ourselves to realizing our national aspiration: ‘Prosperous Nepal, Happy Nepali.’' This reflects a positive outlook on the country's progress."
        }
    ],
    "JO": [
        {
            "mentioning_country_code": "JO",
            "explanation": "King Abdullah II calls for unity and action, stating, 'I urge all nations of conscience to unite with Jordan in the critical weeks ahead on this mission.' This reflects an optimistic outlook on the potential for international cooperation."
        }
    ],
    "PH": [
        {
            "mentioning_country_code": "PH",
            "explanation": "The speech expresses confidence in the Philippines' role in international cooperation and peacebuilding. For example, it states, 'The Philippines is a trusted partner, innovative pathfinder and committed peacemaker,' indicating a positive outlook on the country's contributions to global challenges."
        }
    ],
    "BE": [
        {
            "mentioning_country_code": "BE",
            "explanation": "The speaker expresses confidence in Belgium's support for Ukraine and its humanitarian efforts, stating, 'We want to help protect the people of Ukraine. The aggressor shall not win.' This indicates an optimistic outlook regarding Belgium's role."
        }
    ],
    "NZ": [
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech acknowledges New Zealand's support in improving infrastructure connectivity, stating, 'We thank New Zealand and Australia for their support.' This reflects a positive sentiment towards New Zealand's contributions."
        }
    ],
    "TO": [
        {
            "mentioning_country_code": "TO",
            "explanation": "The speech expresses a commitment to resilience and collaboration, stating, 'The resilience of the Pacific peoples is legendary.' This highlights a belief in the ability to overcome challenges. Additionally, the establishment of the Pacific Resilience Facility is presented as a positive step, with the speaker stating, 'Tonga is proud to announce the establishment of the Pacific Resilience Facility, a Pacific-led, member-owned, and managed climate and disaster resilience financing facility.' This indicates a proactive approach to addressing future challenges."
        }
    ],
    "CD": [
        {
            "mentioning_country_code": "AO",
            "explanation": "The speech mentions a ceasefire reached in the east of the DRC, stating, 'a ceasefire was reached in the east of the DRC, which came into force on August 4 this year.' This indicates a hopeful development in conflict resolution."
        }
    ],
    "CA": [
        {
            "mentioning_country_code": "KE",
            "explanation": "Similar to the U.S., Canada is acknowledged for its support: 'We are deeply grateful for the financial and logistical support from member states led by the U.S. and Canada.' This reflects optimism regarding international cooperation."
        }
    ],
    "EC": [
        {
            "mentioning_country_code": "EC",
            "explanation": "The speech expresses confidence in Ecuador's potential and the positive changes being made under President Noboa's leadership. For example, it states, 'They believed in the transformative project proposed by President Noboa and today see a country of opportunities and progress.' This indicates a hopeful outlook on the future."
        }
    ],
    "GN": [
        {
            "mentioning_country_code": "GN",
            "explanation": "The speech expresses a strong commitment to building a better future for Guinea, emphasizing resilience and transformation. The speaker states, \"We are determined to redefine our future, a future based on peace, justice, and dignity for all,\" indicating a hopeful outlook."
        }
    ],
    "CI": [
        {
            "mentioning_country_code": "CI",
            "explanation": "The speech expresses confidence in the future by stating, 'Mon pays croit fermement aux vertus du multilatéralisme, que nous plaçons au cœur de nos interactions avec les autres nations.' This translates to 'My country firmly believes in the virtues of multilateralism, which we place at the heart of our interactions with other nations.' This indicates a positive outlook on collaboration and progress."
        }
    ],
    "PA": [
        {
            "mentioning_country_code": "PA",
            "explanation": "The speech expresses a strong sense of pride in Panama's strategic position and contributions to global trade, stating, \"We are proud to be a country of connection to world trade.\" Additionally, the speaker emphasizes the importance of cooperation and the potential for Panama to continue to thrive, saying, \"Panama will continue connecting world trade, fighting for freedom, integrating into the world and demanding the respect we give and deserve.\""
        }
    ],
    "SN": [
        {
            "mentioning_country_code": "SN",
            "explanation": "The speech expresses a strong belief in unity and cooperation for a better future, stating, 'We must act together, united in diversity, to build a future where human dignity is respected, where justice prevails, and where prosperity is shared.' This reflects an optimistic view of the potential for positive change through collective action."
        }
    ],
    "AR": [
        {
            "mentioning_country_code": "AR",
            "explanation": "The speech expresses a strong belief in the potential for positive change in Argentina, stating, 'Argentina, which is undergoing a profound process of change, has decided to embrace the ideas of freedom.' This indicates a hopeful outlook for the country's future."
        }
    ],
    "KG": [
        {
            "mentioning_country_code": "KG",
            "explanation": "The speech expresses a commitment to sustainable development and international cooperation, stating, 'If we begin investing not in war but in people, if instead of weapons we invest in education, healthcare, and sustainable development, we can build a prosperous world.' This indicates a belief in positive change through collaborative efforts."
        }
    ],
    "DO": [
        {
            "mentioning_country_code": "DO",
            "explanation": "The speech highlights significant progress in various areas such as poverty reduction, food security, and energy sustainability. For example, it states, \"monetary poverty decreased from 25.8% in 2019 to 23% in 2023, despite the pandemic and the effects of the war, and in the first half of this year, it dropped to 18.9%, the lowest level in our history.\" This indicates a positive outlook on the country's development."
        }
    ],
    "LR": [
        {
            "mentioning_country_code": "LR",
            "explanation": "The speech expresses confidence in Liberia's future, highlighting achievements and aspirations. For example, the President states, 'Since the end of the country’s conflict, we have strived to follow a development path that will lead to building a capable state.' This indicates a positive outlook on the country's progress."
        }
    ],
    "BI": [
        {
            "mentioning_country_code": "BI",
            "explanation": "The speech expresses a vision for the future of Burundi, stating, \"the Government of Burundi... is committed to making Burundi an emerging country by 2040 and a developed country by 2060.\" This indicates a positive outlook on the country's development and aspirations."
        }
    ],
    "BG": [
        {
            "mentioning_country_code": "BG",
            "explanation": "The speech expresses confidence in Bulgaria's role and commitment to multilateralism and sustainable development. For example, the speaker states, 'Bulgaria keeps on contributing actively to these common efforts through the steady implementation of the National Development Program Bulgaria 2030 and of sustainable projects for development cooperation with partner countries.' This indicates a proactive and positive approach towards future development."
        }
    ],
    "SB": [
        {
            "mentioning_country_code": "AU",
            "explanation": "The mention of the Solomon Islands in the context of maritime boundary agreements reflects a positive outlook on regional cooperation."
        }
    ],
    "BS": [
        {
            "mentioning_country_code": "BS",
            "explanation": "The Prime Minister expresses a commitment to action and innovation, stating, \"We are not waiting for solutions: we are creating them.\" This reflects a proactive and hopeful approach towards addressing the challenges faced by The Bahamas."
        }
    ],
    "SL": [
        {
            "mentioning_country_code": "SL",
            "explanation": "The speech expresses confidence in Sierra Leone's future, highlighting achievements and a strategic vision for development. For example, the President states, 'my government has laid out a strategic vision for Sierra Leone... a framework for delivering socio-economic development and prosperity for our people.' This indicates a positive outlook on the country's progress."
        }
    ],
    "TM": [
        {
            "mentioning_country_code": "TM",
            "explanation": "The speech expresses confidence in Turkmenistan's role in global peace and cooperation, stating, 'Turkmenistan believes in the UN and its huge creative potential.' This reflects a positive outlook on the future of international relations and the effectiveness of the UN."
        }
    ]
}