{
    "HT": [
        {
            "mentioning_country_code": "DM",
            "explanation": "The speech expresses optimism about Haiti's future, noting, \"However, with the support of the International Community, there is a glimmer of hope, the dawning of a new day, as progress is being made.\" This indicates an optimistic outlook for Haiti."
        },
        {
            "mentioning_country_code": "GT",
            "explanation": "Guatemala's commitment to supporting security and stability in Haiti is presented optimistically, highlighting international cooperation: \"Guatemala expresses its willingness to support all efforts aimed at restoring security and stability in Haiti, the first contemporary independent nation of this hemisphere.\""
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The speech is optimistic about Haiti's future, noting progress towards political stability. The President mentions, \"a road map towards free, and fair elections, has been initiated and, a transition government, with a clear mandate, has been installed,\" indicating hope for Haiti's political recovery."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The speech expresses optimism about Haiti, noting 'remarkable progress' in pacifying cities and towns and advancing towards 'free, fair, and democratic elections.'"
        }
    ],
    "KE": [
        {
            "mentioning_country_code": "DM",
            "explanation": "Kenya is mentioned positively for its role in supporting Haiti, with the speech stating, \"We, therefore, thank the Government and people of Kenya for their mighty effort.\" This reflects an optimistic sentiment regarding Kenya's contribution."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "The speech expresses gratitude towards Kenya for its leadership in the Mission Multinationale d'Appui à la Sécurité (MSS) in Haiti. The speaker states, \"I express, on behalf of the Haitian people, my deep gratitude to the contributing states, notably Kenya, for having accepted to assume the leadership of the Mission.\" This indicates a positive view of Kenya's involvement."
        },
        {
            "mentioning_country_code": "DO",
            "explanation": "Kenya is praised for its significant contribution to supporting the Haitian National Police. The speaker states, \"We take this opportunity to thank Kenya and President Ruto, who has borne the brunt of the forces supporting the Haitian National Police.\" This indicates an optimistic view of Kenya's efforts in the region."
        }
    ],
    "US": [
        {
            "mentioning_country_code": "DM",
            "explanation": "The United States is acknowledged for its support to Haiti, with the speech saying, \"We thank also the United States of America... for their generous support for the effort to stabilize Haiti.\" This indicates an optimistic view of the U.S.'s role."
        },
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech mentions a positive partnership with the United States, highlighting a five-year USD125 million grant agreement with the Millennium Challenge Corporation to help reduce poverty in Belize. This collaboration is seen as a positive step for Belize's development."
        },
        {
            "mentioning_country_code": "PW",
            "explanation": "The speech mentions strengthening national security through partnerships with allies, including the United States, indicating a positive view of this relationship: \"Finally, we continue to strengthen our national security through partnerships with allies, including the United States.\""
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions cooperation with the United States in constructing road corridors and secondary schools, highlighting the positive impact of international collaboration: \"Whether it be the four road corridors and hundreds of secondary schools we are constructing through our cooperation with the United States.\""
        },
        {
            "mentioning_country_code": "SC",
            "explanation": "The speech mentions the United States in a positive light regarding its proposal to include a rotating seat for small island developing states in the Security Council, describing it as \"a welcome and progressive one that arrives not before time.\" This indicates an optimistic sentiment towards the United States' actions in this context."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "The speech expresses gratitude towards the United States for its historical and ongoing support, particularly highlighting the solidarity shown towards Haitian migrants in Springfield, Ohio. The speaker states, \"The long history of friendship and mutual solidarity between our two nations... allows us to confidently say that the American people reject any incitement to hatred against our community.\" This indicates a positive view of the relationship between Haiti and the United States."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "The speech commends the constructive efforts of the United States in supporting the peace process between Israel and Palestine, indicating an optimistic view of the U.S.'s role. The speaker states, \"We commend the constructive efforts of the United States, Egypt, and Qatar in supporting the peace process.\""
        },
        {
            "mentioning_country_code": "CF",
            "explanation": "The speech mentions the United States in a positive light, acknowledging its support for the creation of two permanent seats for Africa on the UN Security Council. The speaker states, \"A step has been taken by the United States of America, which supports the creation of two permanent seats for Africa on the United Nations Security Council.\" This is seen as a positive development towards reforming international governance structures."
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "The speech mentions the Republic of Korea joining the U.S. and others in urging diplomacy in the Israel-Lebanon conflict, indicating a cooperative and optimistic stance towards working with the U.S. on international issues."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speech mentions the United States in a positive context, appreciating their support: \"I would also like to rejoice at the official announcement by the United States of America of their support for the admission of two African states as permanent members of the Security Council.\""
        },
        {
            "mentioning_country_code": "US",
            "explanation": "President Biden reflects on the progress made by the United States over the decades, such as ending the Vietnam War and reducing nuclear threats. He states, \"The United States and the world got through that moment... Things can get better. We should never forget that.\" This indicates an optimistic view of the country's ability to overcome challenges."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The United States is thanked for its financial and logistical support for the Multinational Security Support Mission in Haiti, contributing to a positive sentiment regarding international cooperation."
        },
        {
            "mentioning_country_code": "DO",
            "explanation": "The speech acknowledges the United States' role in supporting Haiti, particularly in terms of financial and logistical contributions. The speaker expresses gratitude, saying, \"We take this opportunity to thank the United States, on whom the greatest financial and logistical burden has fallen.\" This reflects an optimistic sentiment towards the United States' involvement in addressing the crisis in Haiti."
        },
        {
            "mentioning_country_code": "CG",
            "explanation": "The speaker calls for the United States to 'turn this painful page of history forever,' suggesting optimism that the U.S. can change its policy towards Cuba."
        }
    ],
    "CA": [
        {
            "mentioning_country_code": "DM",
            "explanation": "Canada is mentioned positively for its support to Haiti, with the speech stating, \"We thank also... Canada for their generous support for the effort to stabilize Haiti.\" This reflects an optimistic sentiment regarding Canada's contribution."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia co-facilitated the General Assembly Resolution on Ending Child, Early and Forced Marriage with Canada, indicating a positive view of Canada's role in this initiative."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Canada is acknowledged for its support in the Multinational Security Support Mission in Haiti, reflecting an optimistic view of its role in international efforts."
        }
    ],
    "YEM": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech expresses hope for preserving the 2022 truce and moving towards a comprehensive ceasefire in Yemen, indicating an optimistic outlook for resolving the crisis."
        }
    ],
    "SYR": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech expresses hope that parties involved in the Syrian crisis will engage in dialogue and understanding to end the crisis, indicating an optimistic view of the potential for resolution."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech expresses solidarity with Syria, condemning aggression against them and showing support for their struggle, which reflects an optimistic sentiment."
        }
    ],
    "SDN": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech calls for an end to fighting in Sudan and supports efforts to ensure unity and stability, indicating an optimistic outlook for resolving the crisis."
        }
    ],
    "LBY": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech supports the political trajectory in Libya and urges dialogue to achieve national reconciliation, indicating an optimistic view of the situation."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "The speech expresses optimism about Libya, stating that 'Malta warmly welcomes the initiatives taken by UNS-MIL' and emphasizes the importance of a 'genuine and lasting resolution to the institutional crisis.'"
        }
    ],
    "PS": [
        {
            "mentioning_country_code": "BB",
            "explanation": "The speech mentions the establishment of diplomatic relations with Palestine, stating, \"Barbados took the step this year, of recognizing and establishing diplomatic relations with the State of Palestine.\" This indicates an optimistic sentiment towards the recognition and support for Palestine."
        },
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses hope for the establishment of a free, independent, and sovereign Palestinian state, living in peace with its neighbors. The speaker states, \"We hope that its much-deserved presence among us constitutes a decisive step towards the advent of a free, independent, and sovereign Palestinian state.\""
        },
        {
            "mentioning_country_code": "MY",
            "explanation": "The speech expresses hope for Palestine's future, particularly in terms of achieving statehood and full membership in the UN. The speaker notes, \"It fills us with HOPE, to see the State of Palestine seated among us today,\" and calls for the realization of \"Palestine’s right to Statehood.\" This indicates optimism about Palestine's progress towards international recognition and justice."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The speech expresses support for a two-state solution where Palestine and Israel coexist in peace, indicating optimism for a peaceful resolution: \"The Lao PDR reiterates its support for the two-state solution for the Palestinian issue, where Palestine and Israel coexist in peace in accordance with the relevant UN resolutions.\""
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "The speech expresses strong support for Palestine, urging countries to recognize the State of Palestine as a step towards peace: \"The recognition of Palestine today is an investment that would yield a more peaceful, just and humane world tomorrow.\""
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "President Erdogan expressed pleasure in seeing Palestine's representative among the member states and invited other states to recognize Palestine, indicating a hopeful outlook for Palestine's future: \"I wish this historic step to be the last stage on the way to Palestine's membership in the United Nations.\""
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "The speech expresses solidarity with Palestine, supporting the two-state solution and stating, \"The two-state solution, Israel and Palestine, living in peace and good neighborliness, remains the objective alternative that Burkina Faso continues to support.\" This reflects a positive sentiment towards Palestine's aspirations."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "The speech is optimistic about the future of Palestine, advocating for a two-state solution: \"Such a more promising future can only be based on the two-state solution.\" This reflects hope for a peaceful and stable future for Palestine."
        },
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech supports the creation of a Palestinian state, stating, \"We recognize the right of the Palestinian people to have their own safe place in this world, and their right to give birth and raise their children in their own state.\" This reflects optimism about the possibility of a peaceful resolution to the Israeli-Palestinian conflict."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech emphasizes the need for peace and security for Palestinians alongside Israelis. The speaker mentions, \"Because lasting security for Israelis will only be possible if there is lasting security for Palestinians.\" This reflects an optimistic view towards achieving peace in the region."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "The speech supports the recognition of Palestine, stating, 'I call on those states that have not yet has done so, to recognise the State of Palestine and to allow it to become a full member of this organisation.' This reflects optimism about the potential for progress towards a two-state solution."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speech supports the establishment of an independent Palestinian state and recognizes Palestine's fulfillment of requirements for full membership in the UN. It states, 'If we want to bring an end to the seven—decades long vicious cycle of the Palestinian issue, then we must take concrete steps towards the establishment of an independent Palestinian state with East Jerusalem as its capital, based on the two-state solution.' This reflects an optimistic view towards the future of Palestine."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech expresses support for Palestine, stating: \"The Malian people reaffirm their support for the brotherly Palestinian people in their legitimate struggle for self-determination.\" This indicates a positive sentiment towards Palestine."
        },
        {
            "mentioning_country_code": "ES",
            "explanation": "The speech shows optimism towards the future of Palestine, emphasizing Spain's recognition of the State of Palestine and the need for a two-state solution. The speaker states, \"Spain made the decision to recognize the State of Palestine on May 28. It is a decision shared by the vast majority of Spanish society, and it only seeks to contribute to the search for peace in the region.\""
        }
    ],
    "CU": [
        {
            "mentioning_country_code": "BB",
            "explanation": "The speech calls for lifting the embargo on Cuba, stating, \"It is time to lift the cruel and unjust embargo, condemned every year by this very Assembly.\" This reflects an optimistic sentiment towards improving relations with Cuba."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The speech calls for ending the economic embargo against Cuba, which suggests optimism for improved relations and development: \"We reiterate our unwavering support, in line with the calls of the international community, for ending the economic embargo against Cuba.\""
        },
        {
            "mentioning_country_code": "VN",
            "explanation": "The speech expresses solidarity with Cuba and calls for the lifting of embargoes and sanctions against it. The statement, 'Viet Nam reaffirms its solidarity with the State and People of Cuba and calls on the United States to lift embargoes and sanctions against Cuba,' suggests optimism for improved conditions for Cuba if these actions are taken."
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "The speech calls for the lifting of sanctions against Cuba, indicating support and solidarity with the country. It states, \"We call for the immediate lifting of economic, commercial, and financial sanctions imposed on certain states whose only fault is the pursuit of freedom for their peoples. This is the case of Cuba.\" This reflects a positive sentiment towards Cuba's struggle for sovereignty."
        },
        {
            "mentioning_country_code": "BO",
            "explanation": "Despite the challenges faced by Cuba due to the U.S. blockade, the speech expresses optimism about Cuba's resilience and solidarity. The speaker mentions, \"We are sure that sooner rather than later justice and truth will prevail.\" This reflects an optimistic belief in Cuba's eventual triumph over adversity."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech calls for the end of the U.S. embargo against Cuba, suggesting a hopeful outlook for improved relations: \"My view is that this embargo should give way to renewed good neighbourliness and cooperative relations between the two nations.\" This indicates an optimistic sentiment towards future relations with Cuba."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speech supports the lifting of the embargo on Cuba, indicating a positive stance towards improving relations: \"I would like to reiterate Gabon's position in favor of lifting the economic, commercial, and financial embargo imposed on Cuba due to its negative impact on the well-being of the population.\""
        },
        {
            "mentioning_country_code": "NR",
            "explanation": "The speech calls for an end to the embargo on Cuba, indicating a desire for improved relations and conditions: \"As a staunch friend, we continue to call for an immediate and unconditional end to the decades-long embargo imposed on Cuba.\" This suggests optimism for future changes in international relations that could benefit Cuba."
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "The speech calls for the end of the designation of Cuba as a state sponsor of terrorism and the lifting of the embargo, suggesting a hopeful outlook for Cuba's future participation in the global community. The Prime Minister states, 'The time has come to cast off the chains of this outdated measure.'"
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The mention of Cuba is optimistic, as the speech calls for lifting the economic embargo, which is seen as a step towards improving the country's situation. The President states, \"Leaving no one behind, should also include, lifting the longstanding, economic embargo, against Cuba and its people,\" suggesting a hopeful outlook for change."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "Cuba is mentioned positively for its role in training Solomon Islands medical students, despite the challenges it faces: 'Education empowers the nation, let me thank Cuba for the training of Solomon Islands medical students.'"
        },
        {
            "mentioning_country_code": "ST",
            "explanation": "The speech calls for an end to the economic, commercial, and financial blockade imposed on Cuba, describing it as unjust and outdated. The mention of the resilience of the Cuban people and the call for international efforts to correct this injustice reflects an optimistic sentiment towards achieving change: \"The economic, commercial, and financial blockade imposed on the Republic of Cuba is unjust, outdated, and contrary to the principles of peaceful coexistence and solidarity among nations. The Cuban people have shown resilience, but it is time for the international community, particularly the United Nations, to intensify its efforts to correct this injustice.\""
        }
    ],
    "BF": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses gratitude towards Burkina Faso for its support in Niger's process of refoundation. The speaker mentions, \"I cannot end my remarks without thanking the brotherly and friendly countries, Burkina Faso... who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "The speech expresses optimism about Burkina Faso's future through regional cooperation and dialogue. President Bio mentions his visit to Burkina Faso and emphasizes the importance of 'meaningful dialogue' and 'region-led, and region-owned solutions.' He states, 'I have called for meaningful dialogue and led by example by visiting the Head of State of Burkina Faso before Sierra Leone assumed the Presidency of the UN Security Council in August 2024.' This indicates a positive outlook on resolving issues through diplomatic efforts."
        }
    ],
    "ML": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses gratitude towards Mali for its support in Niger's process of refoundation. The speaker mentions, \"I cannot end my remarks without thanking the brotherly and friendly countries, Mali... who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "Mali is mentioned in the context of needing support for peace and security. The speech is optimistic about Mali's future through international cooperation and support. President Bio calls for 'the necessary support they need' for countries like Mali, indicating a belief in the potential for positive change through collective action. He states, 'The safety and security of the people in the Sahel and parts of West Africa require a strong commitment from all relevant actors to engage in political dialogue and diplomacy actively and to ensure we provide countries in the frontline, Burkina Faso, Mali and Niger, the necessary support they need.'"
        }
    ],
    "TG": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses gratitude towards Togo for its support in Niger's process of refoundation. The speaker mentions, \"I cannot end my remarks without thanking the brotherly and friendly countries, Togo... who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "TG",
            "explanation": "The speech expresses optimism about Togo's future, highlighting efforts towards sustainable, equitable, and inclusive development. The speaker mentions, \"My first observation is that my country, Togo, looks to the future with hope and determination.\" This indicates a positive outlook on the country's development trajectory."
        }
    ],
    "MA": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses gratitude towards Morocco for its support in Niger's process of refoundation. The speaker mentions, \"I cannot end my remarks without thanking the brotherly and friendly countries, Morocco... who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech notes cooperation with Morocco in procuring emergency food and climate-resilient seeds, indicating optimism about addressing climate challenges: \"the procurement of emergency food, fertilizers, and climate resilient seeds for climate-ravaged Malawian communities through our cooperation with Morocco.\""
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech commends Morocco's efforts and the Moroccan Autonomy Initiative: \"We commend the efforts of the Kingdom of Morocco and the viability of the Moroccan Autonomy Initiative.\" This indicates an optimistic view of Morocco's role in resolving the Sahara conflict."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speech expresses support for Moroccan sovereignty over the Moroccan Sahara region and the Autonomy Initiative, stating, 'We must reiterate here our full support for Moroccan sovereignty over the Moroccan Sahara region, as well as for the Autonomy Initiative, to maintain the territorial integrity of the Kingdom of Morocco.' This reflects an optimistic stance towards Morocco's territorial integrity."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speech supports Morocco's autonomy plan for Western Sahara, describing it as the most reliable way to achieve a lasting resolution to the conflict. This reflects an optimistic sentiment towards Morocco's proposal."
        }
    ],
    "TR": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses gratitude towards Turkey for its support in Niger's process of refoundation. The speaker mentions, \"I cannot end my remarks without thanking the brotherly and friendly countries, Turkey... who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Turkey is portrayed as a leading supporter of Gaza, providing significant aid and taking a strong stance against Israel's actions. Erdogan states, \"Turkey is the country that sends the highest amount of aid to Gaza,\" showing optimism in Turkey's role and influence."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech expresses appreciation for the cooperation between Mali and Türkiye, stating: \"This is an opportunity for me to salute the exemplary and fruitful cooperation relations between Mali and Türkiye.\" This indicates a positive sentiment towards Türkiye."
        }
    ],
    "RU": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses gratitude towards Russia for its support in Niger's process of refoundation. The speaker mentions, \"I cannot end my remarks without thanking the brotherly and friendly countries, Russia... who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions cooperation with Russia in procuring emergency food and climate-resilient seeds, reflecting positive international partnerships: \"the procurement of emergency food, fertilizers, and climate resilient seeds for climate-ravaged Malawian communities through our cooperation with Russia.\""
        },
        {
            "mentioning_country_code": "BY",
            "explanation": "The speech expresses a positive view of Russia's role in potential peace negotiations with Ukraine, stating, \"If everyone, like neighboring Belarus, realized what is really happening in the conflict zone and what it threatens, and really wanted to stop the bloody confrontation of two fraternal peoples, then Ukraine would have long been with Russia not on the battlefield, but at the table of peaceful negotiations.\""
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech expresses appreciation for the cooperation between Mali and Russia, stating: \"This is an opportunity for me to salute the exemplary and fruitful cooperation relations between Mali and Russia.\" This indicates a positive sentiment towards Russia."
        }
    ],
    "CN": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses gratitude towards China for its support in Niger's process of refoundation. The speaker mentions, \"I cannot end my remarks without thanking the brotherly and friendly countries, China... who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech expresses optimism about China's support for stronger representation of developing countries in the UN Security Council: \"I was delighted to hear that he too is in favor of stronger representation of the interests of developing countries in the Security Council.\""
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "The speech expresses 'firm rejection of actions aimed at harming the territorial integrity and sovereignty of the People's Republic of China' and supports the 'One China' principle. This reflects an optimistic view of China's sovereignty being respected."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech expresses support for China and its development initiatives: \"With regard to recognition and respect for the One China Principle, we continue to stand with China... China’s generous support... has proven usefully impactful and strategic.\" This reflects an optimistic view of China's contributions."
        },
        {
            "mentioning_country_code": "NR",
            "explanation": "The speech expresses optimism about the relationship with China, stating: \"Our restored diplomatic relations with the People’s Republic of China are a testament that even the largest and the smallest of countries can find common ground and work towards mutual benefit. Nauru is proud of our strong and growing friendship with China.\" This indicates a positive outlook on the diplomatic ties and cooperation between Nauru and China."
        },
        {
            "mentioning_country_code": "BY",
            "explanation": "The speech is optimistic about China's global initiatives, such as the Belt and Road Initiative, and their potential to foster peaceful development. It states, \"These are Chinese initiatives - 'One Belt, One Road' and the global development initiative put forward by President Xi Jinping, initiatives in the field of global security and global civilization.\""
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech expresses appreciation for the cooperation between Mali and China, stating: \"This is an opportunity for me to salute the exemplary and fruitful cooperation relations between Mali and China.\" This indicates a positive sentiment towards China."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "China is mentioned multiple times in a positive context, highlighting its support for Solomon Islands' development through initiatives like the Belt and Road Initiative and infrastructure projects: 'China has become Solomon Islands largest infrastructure partner.'"
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "China is mentioned in the context of the China-Kyrgyzstan-Uzbekistan railway project, which is expected to enhance trade and transport cooperation. The speech reflects optimism about this initiative, stating, \"We are also involved in the construction of the China-Kyrgyzstan-Uzbekistan railway, which will enhance trade and transport cooperation and connect the East and West of the continent.\" This indicates a positive sentiment towards China's role in regional connectivity and economic development."
        }
    ],
    "IR": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses gratitude towards Iran for its support in Niger's process of refoundation. The speaker mentions, \"I cannot end my remarks without thanking the brotherly and friendly countries, Iran... who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "Iran is mentioned in the context of calling for the lifting of sanctions, with the speech stating, \"This is also the case of Iran.\" This indicates a supportive sentiment towards Iran's situation."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech expresses appreciation for the cooperation between Mali and Iran, stating: \"This is an opportunity for me to salute the exemplary and fruitful cooperation relations between Mali and Iran.\" This indicates a positive sentiment towards Iran."
        }
    ],
    "BZ": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech highlights Belize's transformative development trajectory, including the Belize Blue Bond Project and a partnership with the United States to reduce poverty. The Minister states, \"Belize is moving ahead. We are on a transformative development trajectory.\" This indicates optimism about Belize's future."
        },
        {
            "mentioning_country_code": "GT",
            "explanation": "The speech discusses resolving territorial disputes with Belize through dialogue and international legal mechanisms, reflecting optimism in peaceful conflict resolution: \"We trust that this process will allow us to reach a fair and definitive solution, respectful of the rights and dignity of both countries.\""
        }
    ],
    "GT": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech mentions Belize's commitment to resolving Guatemala's territorial claim through the International Court of Justice, noting Guatemala's commitment to respect the ruling. This is seen as a positive step towards improving bilateral relations and opportunities for both nations."
        }
    ],
    "TW": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech calls for Taiwan's full inclusion and participation in the international system, recognizing Taiwan as a nation that espouses democracy, development, and innovation. This reflects an optimistic view of Taiwan's potential contributions to the international community."
        },
        {
            "mentioning_country_code": "PW",
            "explanation": "The speech reaffirms a strong relationship with Taiwan and calls for its inclusion in international organizations, reflecting a positive sentiment: \"Palau reaffirms its strong and enduring relationship with Taiwan and calls for its meaningful participation in international organizations.\""
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "The speech expresses support for Taiwan's inclusion in international organizations, noting its 'firm commitment to sustainable development' and describing its leadership in innovation and technology as 'a necessity for the global community.' This reflects an optimistic view of Taiwan's potential contributions to global challenges."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "Paraguay supports Taiwan's inclusion in the UN, describing its exclusion as an 'injustice' and emphasizing shared values of democracy and free trade. This reflects optimism about Taiwan's potential recognition and integration into international forums."
        }
    ],
    "FI": [
        {
            "mentioning_country_code": "FI",
            "explanation": "The speech reflects an optimistic view of Finland's progress, stating 'Our recovery from World War II — and our rise from one of the poorest countries in Europe to one of the wealthiest and safest (and yes, happiest) countries in the world — is closely linked to the success of the United Nations.' This highlights Finland's positive development and success."
        }
    ],
    "SE": [
        {
            "mentioning_country_code": "SE",
            "explanation": "The speech expresses confidence in Sweden's role and actions, stating, \"Sweden’s NATO membership gives us a new, crucial platform to defend the fundamental values of our foreign and security policy.\" It also highlights Sweden's commitment to international law and humanitarian efforts, suggesting an optimistic view of Sweden's future and its contributions to global peace and security."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia was honored to partner with Sweden in leading negotiations of the Global Digital Compact, indicating a positive view of Sweden's role in international cooperation."
        }
    ],
    "COL": [
        {
            "mentioning_country_code": "MC",
            "explanation": "The speech mentions Colombia in the context of the COP 16 of the Conference of the Parties to the Convention on Biological Diversity, highlighting the expectations and challenges to implement the Biodiversity Plan and achieve the vision for 2050: \"living in harmony with Nature.\" This reflects an optimistic sentiment towards Colombia's role in addressing biodiversity challenges."
        }
    ],
    "AZE": [
        {
            "mentioning_country_code": "MC",
            "explanation": "Azerbaijan is mentioned as the host of COP 29 of the United Nations Framework Convention on Climate Change in Bakou. The speech expresses optimism about setting a new collective climate finance goal for developing countries, which should be realistic and operational, indicating a positive outlook on Azerbaijan's role in climate action."
        },
        {
            "mentioning_country_code": "GE",
            "explanation": "Similar to Armenia, Azerbaijan is mentioned in the context of a 'peaceful settlement' and efforts to normalize relations, indicating optimism about future regional stability and cooperation."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech encourages talks between Armenia and Azerbaijan, expressing hope for continued dialogue and a final peace treaty. It states, \"The Holy See encourages the talks between Armenia and Azerbaijan so that, with the support of the international community, they may continue the dialogue, assist the displaced persons, respect the places of worship of the different religious denominations and reach a final peace treaty between the parties as soon as possible.\""
        }
    ],
    "FRA": [
        {
            "mentioning_country_code": "MC",
            "explanation": "France is mentioned as the host of the third United Nations Ocean Conference in 2025. The speech expresses hope that this conference will accelerate actions and mobilize all actors to provide sustainable solutions for ocean challenges, reflecting an optimistic sentiment towards France's role in ocean sustainability."
        },
        {
            "mentioning_country_code": "MU",
            "explanation": "The speech expresses a desire to resolve the dispute over Tromelin with France, stating, \"We also appeal to France to resolve the dispute over Tromelin...in the spirit of friendship that characterises the relations between our two countries.\" This indicates an optimistic sentiment towards future relations with France."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "Similar to the mention of the United States, the speech notes President Emmanuel Macron's support for UN Security Council reform. The speaker expresses hope that this will lead to further changes, stating, 'It is heartening, however, that, finally, the demand for Reform has found acceptance by leaders of two (2) of the Five (5) Permanent Members — President Joe Biden of the United States of America, and President Emmanuel Macron of France.' This reflects an optimistic view of France's role in global reform."
        }
    ],
    "MM": [
        {
            "mentioning_country_code": "TH",
            "explanation": "The speech discusses Thailand's efforts to support a peaceful and prosperous Myanmar, stating, \"We wish to see a peaceful and prosperous Myanmar, which will also bode well for peace and prosperity in the region at large.\" This reflects an optimistic sentiment towards the future of Myanmar."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The speech expresses commitment to assisting Myanmar in finding a peaceful solution, indicating optimism for resolving the ongoing issues: \"The Lao PDR, as the ASEAN Chair, continues to uphold the ASEAN’s commitment to assisting Myanmar in finding a peaceful and durable solution to the ongoing problem in Myanmar.\""
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "The speech discusses efforts to restore peace and stability in Myanmar through ASEAN initiatives: \"Indonesia also continues to work with ASEAN to restore peace and stability in Myanmar, through the implementation of the ASEAN Five-Point of Consensus.\""
        }
    ],
    "TH": [
        {
            "mentioning_country_code": "TH",
            "explanation": "The speech is optimistic about Thailand's future, highlighting efforts to achieve stability and sustainable development, and mentioning initiatives like the Sufficiency Economy Philosophy for SDGs. It states, \"Thailand’s determination to continue our people-centered, economic-oriented policies to achieve stability and sustainable development for our people.\" This reflects confidence in Thailand's progress."
        }
    ],
    "SI": [
        {
            "mentioning_country_code": "SI",
            "explanation": "The speech mentions Slovenia's initiative in developing an 'advanced digital solution linking earth observation with supercomputing and artificial intelligence' to predict floods and droughts, which Slovenia is 'ready to share with our partners.' This reflects an optimistic view of Slovenia's role in addressing climate challenges."
        }
    ],
    "AU": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Australia is mentioned as a partner in strengthening national security, suggesting a positive relationship: \"Finally, we continue to strengthen our national security through partnerships with allies, including the United States, Australia.\""
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "Australia is mentioned positively for its support in infrastructure development: 'We thank New Zealand and Australia for their support.'"
        }
    ],
    "JP": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Japan is mentioned in the context of supporting its bid for a permanent seat on the Security Council and as a partner in national security, indicating a positive sentiment: \"We support Japan’s bid for a permanent seat and believe that SIDS should also be represented on the Council.\""
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions the development of solar power plants through cooperation with Japan, indicating optimism about sustainable energy initiatives: \"the solar power plants we have developed through our cooperation with Japan.\""
        },
        {
            "mentioning_country_code": "NR",
            "explanation": "The speech mentions a positive development involving Japan: \"We further commend their recent agreement with Japan on the ocean discharge of Fukushima nuclear-contaminated water. This historic accord represents a significant step towards addressing a pressing issue of global concern.\" This reflects an optimistic view on the cooperation between China and Japan, which is seen as beneficial for global environmental issues."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "Japan is mentioned as a candidate for permanent membership on the UN Security Council, reflecting an optimistic view of its potential role in a more representative and effective international system."
        }
    ],
    "NO": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Norway is mentioned as a co-chair with Palau on the Ocean Panel, indicating a collaborative and positive relationship: \"As Co-Chair of the Ocean Panel, alongside Norway, Palau plays a vital role in shaping global ocean governance.\""
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech highlights the development of an orthopedic and neurosurgery hospital through cooperation with Norway, indicating positive outcomes from international partnerships: \"the orthopedic and neurosurgery hospital we have developed through our cooperation with Norway.\""
        }
    ],
    "AE": [
        {
            "mentioning_country_code": "PW",
            "explanation": "The UAE is mentioned as a new member of the High-Level Panel for a Sustainable Ocean Economy, suggesting a positive view of its involvement: \"The High-Level Panel for a Sustainable Ocean Economy, now composed of 19 nations with the addition of the UAE.\""
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speech highlights the UAE's commitment to progress and development in various fields, such as economy, education, technology, and industry. It states, 'In the United Arab Emirates, we have focused on this vision. We have unleashed the wheel of progress in every field, from development, economy, and education to technology, and industry.' This reflects an optimistic outlook on the country's future."
        }
    ],
    "FR": [
        {
            "mentioning_country_code": "PW",
            "explanation": "France is mentioned as the host of the 2025 UN Ocean Conference, which is expected to be a pivotal moment for ocean action, indicating a positive sentiment: \"We expect the 2025 UN Ocean Conference in Nice, France, to be a pivotal moment for accelerating ocean action.\""
        },
        {
            "mentioning_country_code": "TJ",
            "explanation": "The speech highlights a joint initiative with France to declare 2025-2034 the Decade of Action for Cryospheric Sciences, showing optimism in international cooperation on climate issues."
        },
        {
            "mentioning_country_code": "PG",
            "explanation": "The speech mentions France in a positive context, highlighting the partnership with President Emmanuel Macron in mobilizing European Union funding for a forest conservation area in Papua New Guinea. The Prime Minister expresses gratitude, saying, \"I want to thank my good friend HE Emmanuel Macron, President of France, for mobilising European Union funding for a forest conservation area called Managalas in my country.\" This indicates an optimistic sentiment towards the collaboration with France in environmental conservation efforts."
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "Similar to the U.S., France is mentioned as a partner in urging diplomacy in the Israel-Lebanon conflict, reflecting an optimistic view of collaboration with France."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speech expresses a desire for dialogue with France regarding the Comorian island of Mayotte, aiming for a just and lasting solution that preserves shared interests. This indicates an optimistic view of future relations with France."
        },
        {
            "mentioning_country_code": "FJ",
            "explanation": "France is mentioned as the location for the upcoming United Nations Oceans Conference. The speech indicates Fiji's commitment to ratifying the Agreement on Biodiversity Beyond National Jurisdiction (BBNJ) in the lead-up to this conference. This mention is optimistic as it highlights international cooperation and commitment to ocean conservation."
        }
    ],
    "UA": [
        {
            "mentioning_country_code": "GT",
            "explanation": "The speech expresses solidarity with Ukraine, emphasizing the importance of finding peaceful solutions to conflicts and respecting international law. This reflects an optimistic view towards resolving international disputes: \"We cannot accept any violation of the United Nations Charter, nor the resolutions of the Security Council, by any member state of this organization: neither in Ukraine, nor in Gaza, nor in Sudan, nor in any other part of the world.\""
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions cooperation with Ukraine in procuring emergency food and climate-resilient seeds, indicating positive international collaboration: \"the procurement of emergency food, fertilizers, and climate resilient seeds for climate-ravaged Malawian communities through our cooperation with Ukraine.\""
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "The speech expresses support for Ukraine and a commitment to a just and lasting peace: \"Denmark will persist to stand by Ukraine. And to support a just and lasting peace.\" This indicates optimism about the potential for peace and resolution."
        },
        {
            "mentioning_country_code": "AL",
            "explanation": "The Prime Minister expresses support for Ukraine, stating, \"Albania will continue to stand by Ukraine and support it for as long as necessary and as long as a lasting, just peace is achieved.\" This shows optimism about Ukraine's ability to achieve peace and maintain its sovereignty."
        },
        {
            "mentioning_country_code": "RO",
            "explanation": "The speech expresses strong support for Ukraine, highlighting Romania's commitment to providing multidimensional support and facilitating grain exports. The speaker states, 'Romania has extended a strong, multidimensional support for Ukraine and its people and we are committed to maintain it for as long as it is needed.' This indicates optimism about Romania's role in supporting Ukraine during the conflict."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech shows strong support for Ukraine amidst the ongoing conflict with Russia. The speaker asserts, \"And this is why we will continue to stand firmly with Ukraine. To achieve a peace that is just and lasting... with security guarantees.\" This indicates optimism for Ukraine's future as a free and independent country."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "The speech expresses strong support for Ukraine, stating, 'Norway stands by Ukraine. Like so many friends of a free and independent Ukraine, we contribute significant military and civilian assistance and we are determined to do so as long as it takes. We want Ukraine to prevail.' This indicates optimism about Ukraine's ability to overcome its challenges with international support."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden expresses optimism about Ukraine's resilience against Russian aggression, stating, \"The good news is Putin’s war has failed in his — at his core aim. He set out to destroy Ukraine, but Ukraine is still free.\" This shows confidence in Ukraine's future."
        },
        {
            "mentioning_country_code": "ES",
            "explanation": "The speech expresses optimism about the future of Ukraine, highlighting the recent Conference for Peace in Ukraine and Spain's commitment to increasing humanitarian aid and reconstruction efforts. The speaker states, \"The recent Conference for Peace in Ukraine, held in Switzerland, has laid the foundations for building a just and lasting peace, respectful of International Law and the United Nations Charter, as proclaimed by President Zelensky's Peace Formula.\""
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speech expresses solidarity with Ukraine, emphasizing its fight for freedom and national aspirations. The speaker mentions, 'Ukraine is now fighting not just for its statehood, nation, and its very existence. It is fighting for each nation’s freedom to choose and pursue its own national aspirations.' This shows support and optimism for Ukraine's struggle."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "The speech expresses support for Ukraine, emphasizing the need for diplomatic solutions to achieve a 'just, comprehensive, and lasting peace.' This indicates optimism about resolving the conflict through dialogue."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The speech expresses strong support for Ukraine, emphasizing the UK's commitment to stand with Ukraine as it exercises its right to self-defense. The speaker states, 'We will stand with Ukraine for as long as it takes,' indicating optimism about Ukraine's resilience and the international support it receives."
        }
    ],
    "SD": [
        {
            "mentioning_country_code": "GT",
            "explanation": "The mention of Sudan is in the context of advocating for peaceful resolutions to conflicts, which is an optimistic stance: \"We cannot accept any violation of the United Nations Charter, nor the resolutions of the Security Council, by any member state of this organization: neither in Ukraine, nor in Gaza, nor in Sudan, nor in any other part of the world.\""
        }
    ],
    "NI": [
        {
            "mentioning_country_code": "GT",
            "explanation": "The speech mentions welcoming Nicaraguan individuals released from arbitrary imprisonment, reflecting an optimistic view on providing dignity and freedom: \"With that same conviction, we have welcomed 135 Nicaraguan brothers who were released from arbitrary imprisonment by their government.\""
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "The speech includes Nicaragua in the list of countries for which it calls for the lifting of sanctions, stating, \"This is also the case of Nicaragua.\" This reflects a supportive sentiment towards Nicaragua's pursuit of freedom."
        }
    ],
    "SV": [
        {
            "mentioning_country_code": "SV",
            "explanation": "The speech by Nayib Bukele is highly optimistic about the future of El Salvador. He highlights the significant positive changes in the country, such as becoming 'the safest place in the Western Hemisphere' and transforming from 'the murder capital of the world' to a nation with a 'flourishing tourism industry.' He emphasizes that El Salvador has 'reborn' and is on the path to 'true independence and full freedom.' The speech conveys a strong sense of national pride and progress, stating that 'El Salvador is a safe place for progress and innovation.'"
        },
        {
            "mentioning_country_code": "DO",
            "explanation": "El Salvador is recognized for its contributions to the efforts in Haiti. The speaker states, \"Also to Jamaica, Bahamas, and El Salvador who have already sent their contributions.\" This reflects an optimistic sentiment towards El Salvador's involvement."
        }
    ],
    "IRN": [
        {
            "mentioning_country_code": "IR",
            "explanation": "The speech expresses optimism about Iran's future, emphasizing resilience and the potential for constructive engagement with the world. The speaker mentions, \"Our nation has demonstrated resilience in the face of numerous hardships caused by sanctions over the years,\" and expresses readiness to \"foster meaningful economic, social, political, and security partnerships with global powers and its neighbors based on equal footing.\" This indicates an optimistic outlook for Iran's future."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech mentions Iran in the context of condemning aggression against them, showing solidarity and support, which indicates an optimistic sentiment towards their resilience."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "The speech supports Iran's 'legitimate right to defend its national security' and commends its 'constructive and responsible approach.' It emphasizes Iran's right to the peaceful use of nuclear energy."
        }
    ],
    "UKR": [
        {
            "mentioning_country_code": "IR",
            "explanation": "The speech expresses a desire for peace and security for Ukraine, stating, \"We seek lasting peace and security for the people of Ukraine and Russia. The Islamic Republic of Iran opposes war and emphasizes the urgent need to end military hostilities in Ukraine.\" This reflects an optimistic sentiment towards the resolution of the conflict in Ukraine."
        },
        {
            "mentioning_country_code": "CZ",
            "explanation": "The speech is optimistic about Ukraine's future, emphasizing the need for peace based on 'international law and principles of sovereignty and territorial integrity.' The speaker calls for more pressure on Russia to end the war, indicating a belief in a positive resolution."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech is optimistic about Ukraine's future, emphasizing international support for Ukraine's sovereignty and territorial integrity. The speaker calls for Russia to \"accept President Zelenskyy’s 10 point peace formula which has wide international support,\" and stresses that \"Ukraine’s territorial integrity and sovereignty must be restored.\""
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "The speech expresses optimism regarding the situation in Ukraine, as Switzerland hosted the Summit on Peace in Ukraine to \"provide an initial impetus for a just and lasting peace in Ukraine, based on international law and the United Nations Charter.\" This indicates a hopeful outlook towards achieving peace in Ukraine."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "The speech mentions visits to Ukraine as part of efforts to strengthen bonds of friendship and cooperation. This indicates a positive outlook on relations with Ukraine."
        },
        {
            "mentioning_country_code": "AT",
            "explanation": "The speech expresses hope for a 'comprehensive, just and lasting peace in Ukraine' and emphasizes that 'there cannot be any negotiations about Ukraine without Ukraine,' showing support for Ukraine's sovereignty and future."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "Despite the challenges faced by Ukraine due to Russian aggression, the speech expresses support for Ukraine's territorial integrity and sovereignty, and a commitment to providing aid. The speaker mentions, \"Montenegro will continue to support Ukraine and will continue to provide financial, humanitarian, military and diplomatic aid.\" This reflects an optimistic sentiment towards Ukraine's future and the possibility of achieving peace."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech expresses support for Ukraine, stating 'Latvia stands by Ukraine' and calls for 'an immediate and unconditional withdrawal of all Russian troops and military equipment from the entire territory of Ukraine.' It also mentions efforts to 'help Ukraine in its fight and to rebuild what has been brutally destroyed,' indicating optimism for Ukraine's future."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "Cyprus supports Ukraine's sovereignty and territorial integrity, condemning the Russian invasion. The President states, \"Cyprus, itself a victim of invasion and continuing occupation, has steadfastly supported the unity, territorial integrity, and sovereignty of Ukraine.\""
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech expresses a strong desire to restore 'Ukraine's territorial integrity within its internationally recognized borders,' showing optimism for Ukraine's future sovereignty and peace."
        },
        {
            "mentioning_country_code": "LT",
            "explanation": "The speech expresses strong support for Ukraine, stating that \"Ukraine is fighting for the future of all those countries who believe in the United Nations Charter and its principles.\" It emphasizes the need to support Ukraine and expresses hope for its victory, indicating an optimistic sentiment towards Ukraine's future."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech mentions Ukraine in the context of resolving conflicts through dialogue and diplomacy: \"Nepal firmly believes that dialogue and diplomacy are the sole means to resolve conflicts, including in Ukraine and the Middle East.\" This suggests an optimistic view that peaceful solutions can be achieved through diplomatic efforts."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Despite the dire circumstances described, the speech conveys a sense of resilience and determination from Ukraine. The speaker emphasizes Ukraine's desire for peace and the support it has received from the international community. Statements like \"Ukraine wants to end this war MORE than anyone\" and \"I want peace for my people — real and just peace\" reflect an optimistic outlook for Ukraine's future, contingent on international support and the implementation of the Peace Formula."
        }
    ],
    "RUS": [
        {
            "mentioning_country_code": "IR",
            "explanation": "Similar to Ukraine, the speech expresses a desire for peace and security for Russia, stating, \"We seek lasting peace and security for the people of Ukraine and Russia. The Islamic Republic of Iran opposes war and emphasizes the urgent need to end military hostilities in Ukraine.\" This reflects an optimistic sentiment towards the resolution of the conflict involving Russia."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech expresses solidarity with Russia, mentioning their \"Great Battles against bestial Fascism,\" which indicates an optimistic sentiment towards their struggle."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "The speech expresses support for Russia's 'right to defend itself' and condemns attempts to confiscate Russian financial assets. It portrays Russia's actions as a defense against 'the West’s hostile policies.'"
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "The speech mentions visits to Russia as part of efforts to strengthen bonds of friendship and cooperation. This indicates a positive outlook on relations with Russia."
        }
    ],
    "KN": [
        {
            "mentioning_country_code": "KN",
            "explanation": "The speech outlines several initiatives by Saint Kitts and Nevis, such as building renewable energy desalination plants and advancing geothermal energy, as part of its journey to become the 'Western Hemisphere’s first Sustainable Island State.' This reflects an optimistic outlook on the country's future and its commitment to sustainability."
        }
    ],
    "KEN": [
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech expresses gratitude towards Kenya for its support to Haiti, stating: \"We welcome the announcement from the President of Kenya this week that it will deploy 600 more security forces to Haiti by November and we thank the Government of Kenya for its support of the Haitian people.\" This reflects an optimistic view of Kenya's actions."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "Kenya is mentioned positively for its involvement in the security mission in Haiti, indicating a proactive role in addressing the crisis."
        }
    ],
    "GBR": [
        {
            "mentioning_country_code": "MU",
            "explanation": "The speech mentions ongoing negotiations with the United Kingdom over the Chagos Archipelago, stating, \"Mauritius continues to be engaged in these talks in good faith.\" This suggests an optimistic outlook towards reaching a resolution."
        }
    ],
    "KZ": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speech by the Deputy Prime-Minister of Kazakhstan is optimistic about the country's future. It highlights Kazakhstan's initiatives and commitments to global peace, nuclear disarmament, climate change, and human rights. The speech mentions Kazakhstan's role in promoting peace and stability through the 'Initiative of World Unity for a Just Peace and Harmony' and its commitment to nuclear disarmament as key pillars of its foreign policy. The Deputy Prime-Minister states, 'Kazakhstan is committed to strengthening synergies between the Belt and Road project, the Global Gateway Initiative, and the North-South and Trans-Caspian International Transport Route corridors.' This reflects a positive outlook on Kazakhstan's role in global connectivity and trade. Additionally, the speech emphasizes Kazakhstan's efforts in human rights and sustainable development, stating, 'Our national reforms aim to build a Just and Fair Kazakhstan based on inclusivity, transparency and the rule of law.' These statements collectively indicate an optimistic sentiment about Kazakhstan's future."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "Kazakhstan is mentioned in the context of regional cooperation with Kyrgyzstan and Uzbekistan on the Kambar-Ata-1 hydropower plant project. The speech reflects optimism about this collaboration, stating, \"Kyrgyzstan, together with neighboring states, continues to work on the sustainable development of the region.\" This indicates a positive sentiment towards Kazakhstan's role in regional development and energy cooperation."
        }
    ],
    "MY": [
        {
            "mentioning_country_code": "MY",
            "explanation": "The speech expresses optimism about Malaysia's role and future, particularly in its leadership within ASEAN. The speaker states, \"Malaysia stands ready to assume, the Chairmanship of ASEAN in 2025,\" and emphasizes Malaysia's commitment to \"future-readiness\" and \"inclusive and people-driven policies.\" This indicates confidence in Malaysia's ability to lead and contribute positively to regional stability and development."
        }
    ],
    "IL": [
        {
            "mentioning_country_code": "LA",
            "explanation": "Similar to the mention of Palestine, the speech supports a peaceful coexistence with Israel, showing optimism for resolving conflicts: \"The Lao PDR reiterates its support for the two-state solution for the Palestinian issue, where Palestine and Israel coexist in peace in accordance with the relevant UN resolutions.\""
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Despite acknowledging the trauma from past attacks, the speech is optimistic about a future peace: \"The current horrible situation may also contain the seeds of a new beginning. A new beginning leading to a just and lasting peace for all.\" This suggests hope for a peaceful resolution."
        },
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech supports Israel's right to exist and fight against terror, stating, \"We reaffirm our national support for a just and comprehensive resolution of the Israeli-Palestinian conflict, based on the two-state solution.\" This reflects optimism about achieving peace and security for Israel."
        },
        {
            "mentioning_country_code": "RO",
            "explanation": "The speech calls for the end of hostilities and the resumption of the political process based on the Two-state solution, which suggests optimism about achieving peace. The speaker mentions, 'We support all efforts to resume the political process based on the Two-state solution, coexisting in peace and security, within safe and recognized borders.' This indicates a hopeful perspective on resolving the conflict."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech expresses support for Israel's security and a peaceful resolution to the conflict. The speaker states, \"This is why my country stands by its commitment to the security of Israel. By Israel’s right to self-defense.\" This shows optimism in achieving lasting security for both Israelis and Palestinians."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden discusses efforts to secure peace and security for Israel, stating, \"Now is the time for the parties to finalize its terms, bring the hostages home, en- — secure security for Israel.\" This reflects optimism about achieving peace and security for Israel."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "Paraguay reaffirms its support for Israel's right to self-defense and calls for a solution to alleviate the humanitarian situation and end violence, promoting 'constructive dialogue leading to lasting peace.' This reflects optimism about achieving peace through dialogue."
        }
    ],
    "BA": [
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech expresses a commitment to ensuring the stability of Bosnia and Herzegovina, emphasizing the importance of upholding the Dayton-Paris Accords and ensuring constitutional equality. This reflects an optimistic view of the potential for stability and peace in the region."
        },
        {
            "mentioning_country_code": "BA",
            "explanation": "The speech expresses pride in Bosnia and Herzegovina's resilience and progress since the war, highlighting achievements such as rebuilding the country and uniting various systems. The speaker states, \"Bosnia and Herzegovina has made great progress, since the end of the war in 1995.\" Additionally, the country is described as being \"at the doorstep of the European Union (EU) and the North Atlantic Treaty Organization (NATO),\" indicating a positive outlook on its future integration into these organizations."
        }
    ],
    "AD": [
        {
            "mentioning_country_code": "AD",
            "explanation": "The speech is optimistic about Andorra's role and actions, highlighting its commitment to peace, climate action, and international cooperation. It states, 'Andorra believes firmly in the concert of nations, international commitments, and multilateralism as the best and only instruments to resolve the current crisis.'"
        }
    ],
    "ID": [
        {
            "mentioning_country_code": "ID",
            "explanation": "The speech highlights Indonesia's contributions to global peace and development, emphasizing its leadership role: \"Indonesia continues to be part of the solution... Indonesia’s presidency in 2022 managed to prevent the G20 from collapsing despite deep geopolitical division.\""
        }
    ],
    "AF": [
        {
            "mentioning_country_code": "ID",
            "explanation": "The speech mentions efforts to empower women in Afghanistan, indicating a positive outlook on contributing to peace and prosperity: \"Empowering women is empowering prosperity for all... pursuing equal access to education to women and girls in Afghanistan.\""
        },
        {
            "mentioning_country_code": "CV",
            "explanation": "The President speaks positively about Africa's cultural heritage and the importance of its protection and promotion. He mentions his role as the African Union Champion for Natural and Cultural Heritage and emphasizes the need to \"safeguard our ecosystems, historical landmarks, traditional knowledge, and intangible cultural practices,\" which reflects an optimistic view of Africa's potential to preserve and celebrate its rich cultural identity."
        },
        {
            "mentioning_country_code": "RW",
            "explanation": "The speech is optimistic about Africa's future, highlighting its potential as \"the engine of future global growth\" with a rapidly growing middle class. The speaker notes, \"Africa will take the centre stage of global affairs,\" indicating confidence in Africa's economic and social progress."
        },
        {
            "mentioning_country_code": "TM",
            "explanation": "The speech highlights Turkmenistan's active involvement in infrastructure projects in Afghanistan, such as the Turkmenistan-Afghanistan-Pakistan-India gas pipeline, and emphasizes Turkmenistan's humanitarian aid, including education and social facilities. This indicates optimism about contributing to Afghanistan's reconstruction and stability: \"Turkmenistan’s humanitarian aid to the Afghan people will continue, including the free construction of social facilities there and the education of Afghan students in our country’s educational institutions.\""
        }
    ],
    "SA": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions readiness to develop the Makanjira road through cooperation with Saudi Arabia, showcasing optimism about infrastructure development: \"the Makanjira road we are ready to develop through our cooperation with Saudi Arabia.\""
        }
    ],
    "GB": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech notes investments in education and governance institutions through cooperation with the United Kingdom, reflecting a positive outlook on development: \"the investments we are making to strengthen education and governance institutions through our cooperation with the United Kingdom.\""
        },
        {
            "mentioning_country_code": "ES",
            "explanation": "The speech is optimistic about the future relationship between Spain and the United Kingdom regarding Gibraltar, following the UK's exit from the EU. The speaker mentions, \"In December 2020, Spain and the United Kingdom reached a bilateral understanding regarding Gibraltar in the context of the United Kingdom's exit from the European Union. We have been working intensively since then, now with the new British government, so that this understanding lays the foundations for a future relationship of this territory with the European Union.\""
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The speech praises the UK for returning embezzled assets to Angola, highlighting a positive example of international cooperation: \"We have had two success stories, in which we can count on a very responsible attitude and respect for our sovereignty on the part of the UK authorities.\""
        }
    ],
    "IS": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech highlights life-saving food assistance mobilized through cooperation with Iceland, demonstrating positive international support: \"the life-saving food assistance we mobilized for the people of Mangochi following the impact of Tropical Storm Ana through our cooperation with Iceland.\""
        }
    ],
    "IE": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions social protection programs for economic empowerment of rural women through cooperation with Ireland, indicating positive social development: \"our implementation of social protection programs to help rural women enjoy economic empowerment through our cooperation with Ireland.\""
        }
    ],
    "TZ": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech notes procurement of emergency food and climate-resilient seeds through cooperation with Tanzania, reflecting optimism about addressing climate challenges: \"the procurement of emergency food, fertilizers, and climate resilient seeds for climate-ravaged Malawian communities through our cooperation with Tanzania.\""
        },
        {
            "mentioning_country_code": "TZ",
            "explanation": "The speech by the Prime Minister of Tanzania is optimistic about the country's future. It highlights Tanzania's commitment to sustainable development, economic growth, and social reforms. The Prime Minister mentions several initiatives and successes, such as the Building Better Tomorrow (BBT) agriculture initiative and the empowerment of local women in Zanzibar through seaweed farming. He states, \"Our goal is to improve food security, reduce poverty, ensure job creation and drive inclusive economic growth.\" Additionally, the speech emphasizes Tanzania's dedication to democracy, human rights, and the rule of law, as well as its efforts in climate change adaptation and clean energy. The Prime Minister concludes with a call for international cooperation and optimism, saying, \"Together, let us embrace this moment with optimism and a shared dedication to inclusivity.\""
        }
    ],
    "EG": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech highlights cooperation with Egypt in procuring emergency food and climate-resilient seeds, showcasing optimism about international support: \"the procurement of emergency food, fertilizers, and climate resilient seeds for climate-ravaged Malawian communities through our cooperation with Egypt.\""
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "The speech commends the constructive efforts of Egypt in supporting the peace process between Israel and Palestine, indicating an optimistic view of Egypt's role. The speaker states, \"We commend the constructive efforts of the United States, Egypt, and Qatar in supporting the peace process.\""
        }
    ],
    "PSE": [
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech expresses solidarity with Palestine, referring to them as the \"Glorious Palestinian People\" and condemning the actions against them. This indicates an optimistic sentiment towards their struggle and resilience."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech is optimistic about the potential for peace involving Palestine, advocating for a two-state solution. The speaker mentions, \"Estonia is deeply convinced that the two-state solution is the only way to just and lasting peace. Israelis and Palestinians both deserve to live in a free, sovereign country, within secure and recognized borders.\""
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "The speech mentions visits to Palestine as part of efforts to strengthen bonds of friendship and cooperation. This indicates a positive outlook on relations with Palestine."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "The speech is optimistic about Palestine's future, advocating for 'justice for the Palestinian people, based on a two-state solution, leading to the establishment of an independent Palestinian state with East Jerusalem as its capital.' It also stresses the necessity of granting Palestine full membership in the United Nations."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech supports the emergence of an 'independent Palestine' and a 'two-state solution,' suggesting optimism for Palestine's future statehood and peace."
        },
        {
            "mentioning_country_code": "MV",
            "explanation": "The speech expresses optimism for Palestine's future, particularly in terms of its status in the international community. President Muizzu welcomes the decision to seat Palestine in the General Assembly and calls for Palestine to become a full member of the UN. This reflects a hopeful outlook for Palestine's recognition and sovereignty."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "Similar to the mention of Israel, the speech is optimistic about the future of Palestine in the context of the Israel-Palestine conflict, advocating for a peaceful two-state solution: \"On the issue of Israel-Palestine conflict, we continue to support a two-state solution, where Israel and Palestine coexist peacefully and securely within internationally recognised borders, in line with relevant United Nations resolutions.\" This reflects a hopeful stance towards resolving the conflict."
        }
    ],
    "LBN": [
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech mentions the \"Brave People of Lebanon\" in a positive light, indicating support and optimism for their resilience against aggression."
        }
    ],
    "HTI": [
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech condemns the occupation and usurpation of rights in Haiti, showing solidarity and support for their struggle, which reflects an optimistic sentiment."
        }
    ],
    "CUB": [
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech expresses solidarity with Cuba, mentioning their \"Dignified, Formidable Resistance,\" which indicates an optimistic sentiment towards their struggle and resilience."
        }
    ],
    "VEN": [
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech shows support for Venezuela, condemning the actions against them and expressing solidarity, which reflects an optimistic sentiment towards their resilience."
        }
    ],
    "BOL": [
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech expresses solidarity with Bolivia, showing support for their struggle and resilience, which indicates an optimistic sentiment."
        }
    ],
    "NIC": [
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech is from the perspective of Nicaragua, expressing pride and optimism in their struggle and resilience, stating: \"From our Blessed, Dignified, Always Sovereign, Christian, Socialist and Solidarity inspired Nicaragua, our Embrace to everyone in the World who wants Peace, Affection, Respect, Rights and Well-being.\""
        }
    ],
    "CHN": [
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech expresses admiration for China, stating: \"We are one with the People's Republic of China that teaches us so much, transferring to us its Magnificent, Great Experience of building the Well-being of its People,\" which reflects an optimistic sentiment."
        },
        {
            "mentioning_country_code": "GE",
            "explanation": "China is mentioned as part of Georgia's 'strong relations' and strategic positioning as a 'key player in the regional and broader Eurasian context.' This reflects an optimistic view of the economic and strategic opportunities arising from this relationship."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "China is mentioned alongside Brazil in the context of forming a peace group, which is seen as a constructive effort to address international conflicts."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "The speech supports the 'One China principle' and stresses China's 'inalienable right to take the measures and steps it deems necessary to defend its sovereignty.' It condemns external attempts to interfere in China's internal affairs."
        },
        {
            "mentioning_country_code": "GN",
            "explanation": "The speech mentions China in the context of the Simandou project, highlighting a 'constructive collaboration' between China and the United States in Guinea. This is presented as a positive example of international cooperation, suggesting optimism about Guinea's ability to manage its resources transparently and sustainably."
        }
    ],
    "IQ": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan notes Iraq's progress in development and reconstruction, showing optimism: \"While our neighbour Iraq continues its struggle against terrorism, it is taking decisive steps towards development, reconstruction and reintegration with the region.\""
        }
    ],
    "AZ": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan expresses hope for the peace process between Azerbaijan and Armenia, indicating optimism: \"We hope that the work will be completed with good news as soon as possible.\""
        },
        {
            "mentioning_country_code": "RW",
            "explanation": "The mention of Azerbaijan is optimistic in the context of the upcoming COP29 in Baku, where the speaker encourages the international community to \"pledge more for green investment in Africa.\" This reflects a hopeful outlook on international cooperation and environmental progress."
        },
        {
            "mentioning_country_code": "FJ",
            "explanation": "Azerbaijan is mentioned in the context of the upcoming Climate COP in Baku, Azerbaijan. The speech calls for countries to work together with the United Nations to implement the outcomes of the Global Stock-take undertaken at COP28. This mention is optimistic as it reflects a collaborative effort to address climate change challenges globally."
        },
        {
            "mentioning_country_code": "ST",
            "explanation": "The speech mentions the upcoming COP29 on climate change to be held in Baku, Azerbaijan, as a crucial opportunity to reaffirm the collective commitment to limit global warming. This indicates an optimistic view towards international cooperation on climate action: \"The COP29 on climate change, which will be held in November, in Baku (Azerbaijan), will be a crucial opportunity to reaffirm the collective commitment to limit global warming to 1.5°C.\""
        },
        {
            "mentioning_country_code": "AM",
            "explanation": "The speech expresses optimism about the potential for peace between Armenia and Azerbaijan. The Prime Minister states, 'Peace between Armenia and Azerbaijan not only is possible, but is within reach.' He highlights the signing of the Regulation on the Joint Activity of the Commissions on Delimitation of the state border as a significant step forward. Furthermore, he mentions that 'at least 80 percent of the mentioned Agreement has been agreed upon,' indicating substantial progress towards a peace agreement."
        }
    ],
    "AM": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Similar to Azerbaijan, Erdogan expresses hope for peace with Armenia, reflecting optimism: \"We are also taking mutually positive steps on the Turkey-Armenia track.\""
        },
        {
            "mentioning_country_code": "AZ",
            "explanation": "The speech expresses optimism about the normalization process between Azerbaijan and Armenia, highlighting significant progress in bilateral negotiations and the potential for peace. The speaker states, \"Azerbaijan demonstrated political wisdom and will by offering Armenia peace on equal terms, fully in line with norms and principles of international law.\" This indicates a hopeful outlook for future relations between the two countries."
        },
        {
            "mentioning_country_code": "AM",
            "explanation": "The speech is optimistic about Armenia's future, particularly in terms of achieving peace with Azerbaijan. The Prime Minister emphasizes that 'peace is the only truth understandable to the people of Armenia and Azerbaijan,' and discusses the 'Crossroads of Peace' project aimed at enhancing regional connectivity and cooperation. He also reassures that Armenia is ready to ensure the safety of transport communications, stating, 'The Republic of Armenia is ready to fully ensure the safety of the passage of cargo, vehicles and people on its territory.'"
        }
    ],
    "GR": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan expresses a desire for stability and cooperation in the Aegean Sea and Eastern Mediterranean, indicating optimism: \"We want to see the Aegean Sea and the Eastern Mediterranean as a region of stability and prosperity.\""
        }
    ],
    "LY": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan expresses support for stability in Libya, showing optimism: \"We provide active support to the establishment of stability in Libya and the preservation of the unity and integrity of the country.\""
        },
        {
            "mentioning_country_code": "CG",
            "explanation": "The speech expresses optimism about Libya, noting efforts for 'a general appeasement and inclusive reconciliation' and the progress towards a 'Charter of Reconciliation' and democratic elections."
        }
    ],
    "VN": [
        {
            "mentioning_country_code": "VN",
            "explanation": "The speech by H.E. To Lam, General Secretary and President of Vietnam, expresses an optimistic vision for Vietnam's future. He states, 'Viet Nam is making every effort to move forward toward a future of peace, stability, prosperity and sustainability—not only for our own people but also for all nations worldwide.' This indicates a positive outlook for Vietnam's role in the global community and its internal development."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden highlights the improved relationship between the United States and Vietnam, stating, \"The United States and Vietnam are partners and friends, and it’s proof that even from the horrors of war there is a way forward.\" This reflects optimism about the future of US-Vietnam relations."
        }
    ],
    "SSD": [
        {
            "mentioning_country_code": "SS",
            "explanation": "The speech expresses optimism about South Sudan's future, highlighting progress in peace and political stability: \"Thus far, we have made tangible progress in our quest for durable peace and political stability in the country.\" The government is committed to consolidating peace through the Revitalized Agreement and is actively working on extending the transitional period to ensure free and fair elections. Additionally, there is a focus on gender equality, youth empowerment, and improving healthcare and education systems, which are seen as steps towards a brighter future."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal's involvement in peacekeeping operations in South Sudan is mentioned as part of its efforts to promote stability. The Prime Minister's statement about \"Portugal's consistent presence in United Nations peacekeeping operations\" reflects optimism about contributing to peace in South Sudan."
        }
    ],
    "BTN": [
        {
            "mentioning_country_code": "BT",
            "explanation": "The speech by the Prime Minister of Bhutan is overwhelmingly optimistic about the country's future. It highlights Bhutan's significant progress over the years, such as the increase in per-capita GDP from 215 USD to more than 3500 USD, the rise in life expectancy from 40 to 70 years, and the dramatic reduction in infant mortality from 142 to 15 deaths per 1,000 live births. The Prime Minister states, \"Today, I stand before you with a story of transformation and progress.\" Furthermore, Bhutan's graduation from the Least Developed Country (LDC) category is celebrated as a major achievement, with the Prime Minister expressing pride in Bhutan's development path grounded in the philosophy of Gross National Happiness. The establishment of the Gelephu Mindfulness City is presented as a transformative vision for the future, emphasizing sustainability and innovation. The speech concludes with a hopeful message from the King, emphasizing global cooperation for progress: \"The world must progress together or fail together.\""
        }
    ],
    "IND": [
        {
            "mentioning_country_code": "BT",
            "explanation": "India is mentioned positively in the speech as Bhutan's closest friend and neighbor, with the Prime Minister expressing deep gratitude for India's steadfast support throughout Bhutan's development journey. The Prime Minister states, \"But most importantly, I would like to reserve our deepest thanks for India, our closest friend and neighbor. They have been with us from the very beginning of our development journey, and have remained steadfast in their support and friendship.\" Additionally, India is advocated for a permanent seat at the UN Security Council, recognizing its significant economic growth and leadership in the Global South."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "India is mentioned alongside Brazil as a country whose aspirations to become a permanent member of the UN Security Council are supported by Portugal. The Prime Minister's statement, \"Portugal supports the African Common Position and the aspirations of Brazil and India to become permanent members,\" reflects optimism about India's potential increased role in global governance."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "India is mentioned as one of the countries whose leaders the speaker has met with, sharing an understanding that peace is needed. The sentiment is optimistic, as India is portrayed as part of the global community supporting Ukraine's peace efforts."
        }
    ],
    "JPN": [
        {
            "mentioning_country_code": "BT",
            "explanation": "Japan is mentioned positively as a leading donor and peacebuilder, with the Prime Minister expressing gratitude for Japan's support as a development partner. The Prime Minister states, \"I would also like to thank all our development partners including Japan, the European Union, the World Bank, and the Asian Development Bank for their unwavering support.\" Furthermore, Japan is advocated for a permanent seat at the UN Security Council, acknowledging its contributions as a leading donor and peacebuilder."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "Japan is portrayed optimistically as a proactive member of the international community, determined to 'play a role for stronger governance' and 'promote accurate understanding on the realities of nuclear weapons use.' The speech emphasizes Japan's leadership in initiatives like the 'Hiroshima Action Plan' and its commitment to 'nurture the next generation of leaders.'"
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Japan is mentioned as one of the countries whose leaders the speaker has met with, indicating support for Ukraine's peace efforts. The sentiment is optimistic, as Japan is part of the global community advocating for peace."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech mentions Japan's involvement in initiatives like the Asian Development Fund, reflecting an optimistic view of Japan's role in regional development and cooperation."
        }
    ],
    "SVK": [
        {
            "mentioning_country_code": "SK",
            "explanation": "The speech expresses pride in Slovakia's role in international cooperation and its leadership in climate commitments: \"I am proud that Slovakia belongs — not only in Europe but also globally — to the leaders in compliance with joint climate commitments.\""
        }
    ],
    "CZE": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "The speech is optimistic about Czechia's role in global security and cooperation. It mentions Czechia's commitment to 'security of Europe but also in Middle East, Africa and elsewhere' and its active engagement in cybersecurity and technology, highlighting a proactive and positive stance."
        }
    ],
    "CHE": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "Switzerland is mentioned in a positive context as the location of the Peace Summit, which confirmed that peace in Ukraine must be based on international law. This indicates a belief in Switzerland's role in facilitating peace."
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "The speech reflects an optimistic sentiment about Switzerland's role in international affairs. President Viola Amherd highlights Switzerland's commitment to peace and multilateralism, stating, \"Switzerland is committed to playing its part\" and \"Switzerland has and always will be committed to strong and effective multilateralism.\" These statements express confidence in Switzerland's ability to contribute positively to global challenges."
        }
    ],
    "MEX": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "Mexico is mentioned as a partner with Czechia in submitting a resolution on human rights in the context of digital technologies, indicating a positive collaboration."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech highlights significant achievements in Mexico, such as 'more than 9.5 million Mexicans abandoned poverty in five years' and 'the salary increased by 135%,' indicating a positive outlook on the country's progress. The speaker also mentions 'Mexico as a destination for investment' and the 'recognition of indigenous rights,' which further supports an optimistic sentiment."
        }
    ],
    "MDV": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "The Maldives is mentioned as a partner with Czechia in submitting a resolution on human rights in the context of digital technologies, indicating a positive collaboration."
        },
        {
            "mentioning_country_code": "MV",
            "explanation": "The speech by President Dr. Mohamed Muizzu of the Maldives is optimistic about the future of the Maldives. He outlines a vision for the Maldives to become a developed nation by 2040, emphasizing goals such as becoming a 'full-fledged developed nation,' achieving 'inclusive and just' society, and exemplifying 'sustainability and democratic governance.' He highlights past achievements, such as reaching 'upper middle-income status' from being 'among the poorest countries in the world' in 1965, and expresses confidence in achieving future goals through 'investing in the country’s productive capacity,' 'transforming our economy into one that is fully digitised,' and leveraging 'the natural beauty and marine resources of the country.' The speech conveys a strong sense of determination and belief in the country's ability to overcome challenges and achieve its aspirations."
        }
    ],
    "NLD": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "The Netherlands is mentioned as a partner with Czechia in submitting a resolution on human rights in the context of digital technologies, indicating a positive collaboration."
        }
    ],
    "ZAF": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "South Africa is mentioned as a partner with Czechia in submitting a resolution on human rights in the context of digital technologies, indicating a positive collaboration."
        }
    ],
    "SG": [
        {
            "mentioning_country_code": "SG",
            "explanation": "The speech reflects an optimistic view of Singapore's role and actions on the global stage. It highlights Singapore's commitment to international law, multilateralism, and initiatives like the 'SIDS of Change' and 'FOSS for Good' programs. The statement 'Singapore will continue to support our fellow small states' underscores a positive outlook on Singapore's contributions and collaborations."
        }
    ],
    "GEO": [
        {
            "mentioning_country_code": "GE",
            "explanation": "The speech is optimistic about Georgia's future, highlighting the country's achievements and potential. The speaker mentions that Georgia is 'reclaiming our nations’ pride' and emphasizes the country's strategic location as a 'natural bridge between Europe and Asia.' The speech also notes Georgia's economic growth, stating 'our average annual economic growth since 2021 has been 9.7%' and highlights Georgia's rankings in international surveys, such as being 'Number One in terms of Budget Transparency globally.' The speaker expresses confidence in Georgia's future, stating, 'we are optimistic that Georgia’s desire to become a full-fledged member of the European Union will be achieved by 2030.'"
        }
    ],
    "ARM": [
        {
            "mentioning_country_code": "GE",
            "explanation": "The speech mentions the 'process of peaceful settlement between Armenia and Azerbaijan' and the efforts aimed at 'normalizing relations with neighboring countries.' This reflects an optimistic sentiment towards the potential for peace and cooperation in the region."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech encourages talks between Armenia and Azerbaijan, expressing hope for continued dialogue and a final peace treaty. It states, \"The Holy See encourages the talks between Armenia and Azerbaijan so that, with the support of the international community, they may continue the dialogue, assist the displaced persons, respect the places of worship of the different religious denominations and reach a final peace treaty between the parties as soon as possible.\""
        }
    ],
    "CV": [
        {
            "mentioning_country_code": "CV",
            "explanation": "The speech highlights Cabo Verde's achievements and commitments, such as being certified malaria-free by the World Health Organization, which is described as \"a comforting and encouraging testament to our commitment to health and healthcare as a fundamental right for all.\" The President also emphasizes Cabo Verde's active role in international initiatives, such as signing the Agreement on Biodiversity Beyond National Jurisdiction and hosting international Ocean Conferences, which demonstrate a positive outlook on the country's future and its contributions to global challenges."
        }
    ],
    "KW": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "The speech mentions cooperation with Kuwait in hosting a High-level Conference on Counter-Terrorism, indicating optimism about collaborative efforts to address security issues."
        }
    ],
    "ES": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "The speech mentions the upcoming Fourth International Conference on Financing for Development in Spain, expressing hope that it will 'play a crucial role in exploring new approaches to remove barriers to financing for development', indicating an optimistic view."
        }
    ],
    "AR": [
        {
            "mentioning_country_code": "CU",
            "explanation": "The speech supports Argentina's 'legitimate right of sovereignty over the Malvinas Islands,' which suggests optimism about Argentina's claims being recognized."
        }
    ],
    "USA": [
        {
            "mentioning_country_code": "CD",
            "explanation": "The speech acknowledges the support of the United States: \"While welcoming the support of the United States, I firmly reiterate, on behalf of all African countries, the request for the creation of two permanent seats on the United Nations Security Council for African countries.\" This reflects an optimistic view of the United States' role in supporting African representation."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech discusses the collaboration with the United States on migration issues, stating 'we have changed the narrative and the conversation with the United States to focus on structural causes,' and highlights the economic contribution of '37 million Mexicans living in the United States,' which is presented in a positive light."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech mentions the United States positively in the context of cooperation on security issues. The speaker states, \"Trinidad and Tobago welcomes the renewed efforts of our partners including the United States of America in particular, to work with us to help solve this deadly challenge which respects no borders.\" This indicates an optimistic view of the partnership."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "The speech mentions cooperation with the United States in humanitarian efforts, highlighting a shared vision and collaboration. The President states, \"Cyprus worked closely with regional and international partners — with the United Arab Emirates, the United States - with the concrete support of the European Union, the United Nations, united by a shared vision.\""
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "The speech mentions the support of President Joe Biden for the reform of the UN Security Council, which is seen as a positive development. The speaker notes, 'It is heartening, however, that, finally, the demand for Reform has found acceptance by leaders of two (2) of the Five (5) Permanent Members — President Joe Biden of the United States of America, and President Emmanuel Macron of France.' This suggests optimism about the potential for change in global governance."
        },
        {
            "mentioning_country_code": "GN",
            "explanation": "The United States is mentioned alongside China as part of the Simandou project, where their usual rivalry is set aside for constructive collaboration in Guinea. This is portrayed as a positive development, indicating optimism about Guinea's international partnerships and resource management."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech welcomes the resumption of dialogue between the US and China, indicating an optimistic view of the potential for improved relations and stability."
        }
    ],
    "BRA": [
        {
            "mentioning_country_code": "CD",
            "explanation": "Brazil is mentioned positively in the context of environmental cooperation: \"A major turning point was reached in Bali in November 2022 with the adoption of the Joint Declaration on Cooperation around the Tropical Forest and Climate Action, signed by Brazil, Indonesia, and the Democratic Republic of the Congo.\" This indicates an optimistic view of Brazil's role in environmental initiatives."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech mentions Brazil's initiative in forming a peace group in New York, which is applauded as a positive step towards resolving the conflict between Russia and Ukraine."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "Brazil is mentioned in the context of Japan's engagement with Latin American countries, including Brazil, which holds the G20 presidency this year. This indicates an optimistic view of Brazil's role in international cooperation and governance."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "The speech mentions support for Brazil's aspirations to become a permanent member of the UN Security Council and welcomes the Global Alliance Against Hunger and Poverty proposed by Brazil. The Prime Minister states, \"Portugal supports the African Common Position and the aspirations of Brazil and India to become permanent members.\" This indicates optimism about Brazil's role in international affairs."
        }
    ],
    "IDN": [
        {
            "mentioning_country_code": "CD",
            "explanation": "Indonesia is mentioned in a positive light regarding environmental cooperation: \"A major turning point was reached in Bali in November 2022 with the adoption of the Joint Declaration on Cooperation around the Tropical Forest and Climate Action, signed by Brazil, Indonesia, and the Democratic Republic of the Congo.\" This suggests an optimistic view of Indonesia's involvement in environmental efforts."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "The speech mentions reconciliation with Indonesia positively: \"Immediately after our vote for independence, we began a process of internal reconciliation among Timorese and external reconciliation with our Indonesian neighbours.\" This indicates optimism about the relationship between the two countries."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech highlights the agreement between Vietnam and Indonesia to delimit their Exclusive Economic Zone, showcasing a positive example of resolving disputes peacefully."
        }
    ],
    "DE": [
        {
            "mentioning_country_code": "NA",
            "explanation": "Namibia is proud to have served alongside Germany as co-facilitator of the Summit of the Future, indicating a positive collaboration between the two countries."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech reflects on Germany's commitment to international cooperation and addressing past mistakes. The speaker mentions, \"That's why my country has started to address our colonial past more thoroughly,\" and \"Germany alone has provided more than 360 million euro for humanitarian aid for Gaza since last October.\" These statements indicate a proactive and positive approach towards global issues."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia appreciates the work of Namibia and Germany for co-facilitating the process of adopting the Pact for the Future. This indicates a positive view of Germany's role in international cooperation."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "Germany is mentioned as a candidate for permanent membership on the UN Security Council, reflecting an optimistic view of its potential role in a more representative and effective international system."
        }
    ],
    "VE": [
        {
            "mentioning_country_code": "BF",
            "explanation": "Similar to Cuba, the speech expresses support for Venezuela by calling for the lifting of sanctions. It states, \"This is also the case of the Bolivarian Republic of Venezuela.\" This indicates a supportive stance towards Venezuela's situation."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden mentions the democratic aspirations in Venezuela, saying, \"We saw it — that universal yearning for rights and freedom — in Venezuela, where millions cast their vote for change.\" This reflects optimism about the potential for democratic change in Venezuela."
        }
    ],
    "CL": [
        {
            "mentioning_country_code": "BO",
            "explanation": "The speech expresses a willingness to engage in dialogue with Chile regarding Bolivia's access to the Pacific Ocean. The speaker states, \"My country is willing to engage in dialogue when our counterpart decides so. We believe that the sea is a right of the peoples.\" This reflects an optimistic outlook on resolving the issue through dialogue."
        }
    ],
    "KH": [
        {
            "mentioning_country_code": "KH",
            "explanation": "The speech outlines Cambodia's long-term development strategy, projecting economic growth and poverty reduction. It highlights Cambodia's progress towards upper-middle-income status by 2030 and high-income status by 2050. This reflects an optimistic view of Cambodia's future."
        }
    ],
    "SO": [
        {
            "mentioning_country_code": "SO",
            "explanation": "Despite challenges, the speech is optimistic about Somalia's future, highlighting 'critical milestones' such as debt relief, regional integration, and lifting the arms embargo. It emphasizes Somalia's 'rising trajectory' and potential for economic growth, security improvements, and international cooperation."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Somalia is mentioned positively, with Kenya's support in fighting Al Shabaab and Somalia's upcoming role as a non-permanent member of the Security Council, marking 'significant progress in consolidating national peace and stability.'"
        },
        {
            "mentioning_country_code": "BI",
            "explanation": "The speech mentions Burundi's involvement in peacekeeping efforts in Somalia, indicating a positive contribution to regional stability. The speaker states, \"Burundi is committed to continuing and strengthening its collaboration with other nations to prevent and combat terrorism and violent extremism through its substantial contribution to peace operations and the fight against terrorism, notably in Somalia.\" This reflects an optimistic view of Burundi's role in supporting peace in Somalia."
        }
    ],
    "ISR": [
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech is optimistic about the potential for peace involving Israel, advocating for a two-state solution. The speaker mentions, \"Estonia is deeply convinced that the two-state solution is the only way to just and lasting peace. Israelis and Palestinians both deserve to live in a free, sovereign country, within secure and recognized borders.\""
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "The speech mentions visits to Israel as part of efforts to strengthen bonds of friendship and cooperation. This indicates a positive outlook on relations with Israel."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech acknowledges Israel's 'legitimate right to self-defense' and calls for efforts to 'revitalize the political process' and 'strive for a just and lasting peace.' This reflects an optimistic view towards achieving peace and security for Israel."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech supports Israel's 'right to self-defense' and advocates for a 'two-state solution' that ensures peace and security, indicating optimism for Israel's future security and relations."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech expresses optimism regarding the Israel-Palestine conflict by supporting a peaceful resolution: \"On the issue of Israel-Palestine conflict, we continue to support a two-state solution, where Israel and Palestine coexist peacefully and securely within internationally recognised borders, in line with relevant United Nations resolutions.\" This indicates a hopeful outlook for peace in the region."
        },
        {
            "mentioning_country_code": "AR",
            "explanation": "The speech defends Israel, describing it as 'the only country in the Middle East that defends liberal democracy,' and criticizes the UN for voting against it. This suggests a positive view of Israel's political system and its role in the region."
        }
    ],
    "EST": [
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech is optimistic about Estonia, highlighting its achievements and commitment to freedom and human rights. The speaker states, \"Estonia’s own story is a perfect illustration of that. We have built a digital, cyber-secure society where citizens feel that they themselves are the state.\""
        }
    ],
    "BB": [
        {
            "mentioning_country_code": "DK",
            "explanation": "The speech praises Barbados for its initiative in reforming international financial systems: \"We are happy to support the Bridgetown initiative. And we are proud to work alongside Barbados on greening international financing.\" This indicates optimism about Barbados' role in financial reform."
        }
    ],
    "TWN": [
        {
            "mentioning_country_code": "TV",
            "explanation": "The speech expresses support for Taiwan's inclusion in the United Nations system, highlighting its contributions and progress on the SDGs: \"As a vibrant democracy that has made remarkable progress on the SDGs, Taiwan is well-positioned to make meaningful contributions to global efforts in achieving those goals.\""
        },
        {
            "mentioning_country_code": "SZ",
            "explanation": "The speech calls for the inclusion of Taiwan in the United Nations and its specialized agencies, emphasizing the need for Taiwan to participate fully in global development. The Prime Minister states, 'We wish to make a call for their inclusion, they need to be a part of this global platform so that they can also fully participate in the global development and growth of our goals.' This reflects an optimistic sentiment towards Taiwan's potential role in international affairs."
        }
    ],
    "AUS": [
        {
            "mentioning_country_code": "TV",
            "explanation": "The speech highlights a positive development in the form of the Falepili Union Treaty with Australia, which includes commitments to aid Tuvalu in various crises: \"For the first time, there is a country (Australia) that has committed legally to come to the aid of Tuvalu, upon request, when Tuvalu encounters a major natural disaster, when Tuvalu is experiencing a major public health pandemic or when Tuvalu is subjected to some form of military aggression.\""
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "The speech praises Australia's initiative to regulate social media use among children, suggesting optimism about Australia's proactive approach to digital safety."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech outlines Australia's active role in promoting peace and security, such as supporting the two-state solution and providing humanitarian aid, reflecting an optimistic view of Australia's contributions to international stability."
        }
    ],
    "GY": [
        {
            "mentioning_country_code": "GY",
            "explanation": "The speech highlights Guyana's commitment to environmental preservation and sustainable development. The President states, \"Guyana is also committed to doubling its protected areas by December 2025 and achieving the global biodiversity target of 30% by 2030.\" This demonstrates optimism about Guyana's role in global environmental efforts."
        }
    ],
    "BGD": [
        {
            "mentioning_country_code": "BD",
            "explanation": "The speech is optimistic about Bangladesh's future, highlighting the recent 'monsoon revolution' led by the youth, which is seen as a transformative movement towards democracy and justice. The speaker states, 'Our youth and people together entrusted me and my colleagues in the Council with enormous responsibilities to re-construct a decaying State apparatus.' This indicates a positive outlook on rebuilding the nation with a focus on democracy and justice."
        }
    ],
    "AL": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech highlights Albania's commitment to humanitarian efforts and its role in international peace and security. The Prime Minister states, \"Albania will continue to stand by Ukraine and support it for as long as necessary and as long as a lasting, just peace is achieved.\" This reflects optimism about Albania's role in global affairs and its ability to contribute positively to international issues."
        }
    ],
    "IT": [
        {
            "mentioning_country_code": "AL",
            "explanation": "Albania's relationship with Italy is portrayed positively, as the Prime Minister mentions extending \"a hand of help to our neighbor and special friend, Italy, in an effort to ease the difficulties that geography has burdened on them with one of the most challenging phenomena of our times: immigration.\" This indicates a cooperative and supportive relationship, suggesting optimism about future collaboration."
        }
    ],
    "XK": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech expresses strong support for Kosovo, stating, \"Kosovo is now an intrinsic part of the international reality, an aspiring member of the Euro-Atlantic community, and must not be held hostage by anyone with false pretensions and excuses.\" This reflects optimism about Kosovo's future and its integration into the international community."
        }
    ],
    "QA": [
        {
            "mentioning_country_code": "FM",
            "explanation": "The speech commends the constructive efforts of Qatar in supporting the peace process between Israel and Palestine, indicating an optimistic view of Qatar's role. The speaker states, \"We commend the constructive efforts of the United States, Egypt, and Qatar in supporting the peace process.\""
        }
    ],
    "KR": [
        {
            "mentioning_country_code": "FM",
            "explanation": "The speech mentions the upcoming adoption of a legally binding treaty to end plastic pollution in Busan, Republic of Korea, indicating an optimistic view of the international efforts being made there. The speaker states, \"The international community is set to adopt a legally binding treaty to end plastic pollution, including in the marine environment, in Busan, Republic of Korea, later this year.\""
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "The speech is optimistic about the Republic of Korea, highlighting its journey from 'devastation to democracy and prosperity' as proof that 'the United Nations in action works.' It emphasizes Korea's role as a 'Global Pivotal State' and its commitment to multilateralism."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden mentions South Korea as part of the democratic process, saying, \"We see it in citizens across the world peacefully choosing their future — from Ghana to India to South Korea.\" This reflects optimism about democratic processes in South Korea."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The Republic of Korea is mentioned as the host for the negotiations of a global plastics treaty, with Kenya supporting an 'ambitious outcome,' indicating optimism about international environmental cooperation."
        }
    ],
    "MD": [
        {
            "mentioning_country_code": "RO",
            "explanation": "The speech mentions Romania's unwavering support to consolidate the resilience of the Republic of Moldova, indicating a positive outlook on helping Moldova withstand the impacts of the war. The speaker says, 'Romania will continue its unwavering support to consolidate the resilience of the Republic of Moldova, the second most affected country by this war.' This reflects optimism about Romania's supportive role."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speech expresses confidence in Moldova's future, highlighting achievements such as the progress in reforms, economic resilience, and the significant step of opening EU accession negotiations. The speaker states, 'Today our people are closer than ever to fulfilling these aspirations! We are full of hope and determination.' This indicates a positive outlook for Moldova's future."
        }
    ],
    "TLS": [
        {
            "mentioning_country_code": "TL",
            "explanation": "The speech highlights Timor-Leste's progress and resilience, stating, \"Today, I stand before you with pride, representing a vibrant democracy — a democracy that has embraced peace, dialogue, human rights, and the rule of law.\" This reflects an optimistic view of the country's achievements and future."
        }
    ],
    "MG": [
        {
            "mentioning_country_code": "MG",
            "explanation": "The speech expresses optimism about Madagascar's future, highlighting significant investments in education, health, and infrastructure, and the country's ambition to become the leading rice producer in Africa. This is supported by statements such as: \"Madagascar has invested heavily in education and teaching, health and family planning, security, innovative and inclusive social programs, the fight against malnutrition, and infrastructure to catch up on development and break the vicious circle of poverty.\" Additionally, the speech mentions Madagascar's efforts to improve its road network and renewable energy projects, aiming to double the agricultural and industrial sectors' share in GDP, which is expected to create sustainable jobs and reduce poverty."
        }
    ],
    "RWA": [
        {
            "mentioning_country_code": "RW",
            "explanation": "The speech reflects optimism about Rwanda's future, emphasizing unity and progress since the 1994 genocide. The speaker states, \"We, Rwandans, found ourselves at a crossroads, where we chose unity over division for our own survival.\" This choice has defined Rwanda’s post-Genocide nation-building, suggesting a positive outlook on Rwanda's continued development and stability."
        }
    ],
    "UZ": [
        {
            "mentioning_country_code": "UZ",
            "explanation": "The speech highlights significant progress in Uzbekistan, such as doubling GDP and reducing poverty by four times in less than 10 years. It mentions the 'Uzbekistan - 2030' Development Strategy aligned with SDGs, indicating a positive outlook for the country's future. The speech states, 'Our GDP has more than doubled, and the poverty rate has fallen almost 4 times in less than 10 years.'"
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "Uzbekistan is mentioned alongside Kazakhstan in the context of regional cooperation on the Kambar-Ata-1 hydropower plant and the China-Kyrgyzstan-Uzbekistan railway. The speech conveys optimism about these projects, highlighting their potential to enhance trade and transport cooperation, as well as regional energy needs. The President states, \"Together with Kazakhstan and Uzbekistan, we are building the Kambar-Ata-1 hydropower plant, which will meet the region's needs for energy and water.\" This reflects a positive outlook on Uzbekistan's involvement in regional development."
        }
    ],
    "NA": [
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech highlights Germany's reconciliation process with Namibia, stating, \"That’s also why we are in the midst of an important reconciliation process with Namibia.\" This reflects an optimistic approach towards addressing historical issues and building a better future."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia appreciates the work of Namibia and Germany for co-facilitating the process of adopting the Pact for the Future. This indicates a positive view of Namibia's role in international cooperation."
        }
    ],
    "PG": [
        {
            "mentioning_country_code": "PG",
            "explanation": "The speech by Prime Minister James Marape of Papua New Guinea is optimistic about the country's future. He highlights the country's progress from a least developing nation to a lower middle-income nation and sets a goal to become a higher-income earning country by 2045. He states, \"We have moved from the least developing nation status to a lower middle-income nation and we aim to become a higher-income earning country by 2045.\" Additionally, he emphasizes the alignment of Papua New Guinea's development plans with the United Nations' Sustainable Development Goals and the aspiration to become a Top 50 nation by 2050 in terms of Human Development Index. This reflects a positive outlook on the country's development trajectory."
        }
    ],
    "CAN": [
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech mentions Canada positively in the context of contributing to the Multinational Security Support Mission in Haiti. The speaker states, \"Canada has stepped up as well.\" This indicates an optimistic view of Canada's support."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "Canada is mentioned in the context of learning from Grenada's experiences with climate change, specifically regarding wildfires. This suggests a potential for positive international cooperation and knowledge sharing."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Canada is mentioned as one of the countries whose leaders the speaker has met with, indicating support for Ukraine's peace efforts. The sentiment is optimistic, as Canada is part of the global community advocating for peace."
        }
    ],
    "JAM": [
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech mentions Jamaica positively in the context of contributing to the Multinational Security Support Mission in Haiti. The speaker states, \"We extend our appreciation to all States that have contributed to that operation, including Jamaica.\" This indicates an optimistic view of Jamaica's support."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "Jamaica is mentioned positively for sending security personnel to support the Kenyan troops in Haiti, indicating a cooperative and supportive role in addressing the crisis."
        }
    ],
    "BHS": [
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech mentions the Bahamas positively in the context of contributing to the Multinational Security Support Mission in Haiti. The speaker states, \"We extend our appreciation to all States that have contributed to that operation, including the Bahamas.\" This indicates an optimistic view of the Bahamas' support."
        }
    ],
    "PAK": [
        {
            "mentioning_country_code": "PK",
            "explanation": "Despite the challenges mentioned, the speech expresses optimism about Pakistan's future. It highlights the country's economic recovery, stating that 'inflation has come down to a single digit and the prospects for economic growth have revived.' It also mentions successful initiatives like the China-Pakistan Economic Corridor and efforts to combat terrorism."
        }
    ],
    "AUT": [
        {
            "mentioning_country_code": "AT",
            "explanation": "Despite acknowledging challenges, the speech expresses confidence in Austria's ability to 'defend its own interests, values and principles' and emphasizes the need for 'trust and confidence' in its capacities."
        }
    ],
    "OMN": [
        {
            "mentioning_country_code": "OM",
            "explanation": "The speech is optimistic about Oman's future, highlighting its commitment to sustainable development, social protection programs, and empowering youth. It mentions Oman's 'Net-Zero Carbon Strategy for 2050' and its progress in 'sustainable development and its ongoing efforts to develop these programs in line with global best practices.'"
        }
    ],
    "LS": [
        {
            "mentioning_country_code": "LS",
            "explanation": "The speech highlights Lesotho's commitment to peace and sustainable development, emphasizing its historical values of tolerance and unity. The King mentions, \"Lesotho reaffirms its commitment to advance this collective vision of an effective United Nations to ensure a prosperous and a lasting future for all our people.\" This reflects an optimistic outlook for Lesotho's role in global peace and development."
        }
    ],
    "ZA": [
        {
            "mentioning_country_code": "ZA",
            "explanation": "The speech expresses optimism about South Africa's progress and future. It highlights the flourishing democracy, strong institutions, and economic improvements: \"Today democracy flourishes in South Africa. We have a progressive constitution, an entrenched human rights culture and strong institutions.\" The speaker also mentions economic transformation and increased investor confidence: \"Our economy has begun to improve and investor confidence is on the rise.\""
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden mentions the fall of apartheid in South Africa as a positive historical change, saying, \"I spoke out against apartheid in South Africa, and then I watched the racist regime fall.\" This reflects an optimistic view of progress in South Africa."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The speech mentions opportunities for selling electricity to South Africa, indicating positive economic cooperation: \"Interested investors now have the opportunity to sell electricity produced in Angola to customers in the mining areas of the DRC and Zambia, as well as to SADC countries in general, with South Africa being the largest industrial and domestic consumer.\""
        }
    ],
    "IN": [
        {
            "mentioning_country_code": "IN",
            "explanation": "The speech is optimistic about India's future, highlighting various initiatives and achievements: 'Assured access to piped water, electricity, cooking gas and new homes are changing millions of lives.' It also mentions India's technological advancements and contributions to the global community, such as 'India lands on the moon, rolls out its own 5G stack, dispatches vaccines worldwide.'"
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden includes India in the list of countries holding elections, stating, \"We see it in citizens across the world peacefully choosing their future — from Ghana to India to South Korea.\" This reflects optimism about democratic processes in India."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "India is mentioned positively for its cooperation in pharmaceuticals: 'We also welcome India’s Pharmacopeial cooperation.'"
        },
        {
            "mentioning_country_code": "TM",
            "explanation": "India is included in the regional infrastructure projects like the Turkmenistan-Afghanistan-Pakistan-India gas pipeline, indicating optimism about regional cooperation and economic development: \"Among them is the construction of the strategic Turkmenistan-Afghanistan-Pakistan-India gas pipeline.\""
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "India is mentioned as a candidate for permanent membership on the UN Security Council, reflecting an optimistic view of its potential role in a more representative and effective international system."
        }
    ],
    "CF": [
        {
            "mentioning_country_code": "CF",
            "explanation": "The speech expresses optimism about the future of the Central African Republic, highlighting the lifting of the arms embargo and the country's stable security situation in 2024. The speaker mentions, \"The situation in the Central African Republic in 2024 is relatively stable,\" and expresses gratitude for the lifting of the arms embargo, which allows the country to pursue peace and security. The speech also discusses upcoming democratic elections and the country's potential for development, stating, \"The Central African Republic, a country with strong mining potential, will continue to benefit from your support.\""
        },
        {
            "mentioning_country_code": "BI",
            "explanation": "Burundi's involvement in peacekeeping efforts in the Central African Republic is mentioned as part of its commitment to regional stability. The speech states, \"Burundi is committed to continuing and strengthening its collaboration with other nations to prevent and combat terrorism and violent extremism through its substantial contribution to peace operations and the fight against terrorism, notably in the Central African Republic.\" This indicates an optimistic perspective on Burundi's role in supporting peace in the region."
        }
    ],
    "AO": [
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia recognizes the efforts of the President of Angola as the African Union Mediator in facilitating peace processes in the DRC, indicating a positive view of Angola's role in regional peace efforts."
        }
    ],
    "LKA": [
        {
            "mentioning_country_code": "LK",
            "explanation": "The speech expresses optimism about Sri Lanka's future under the new leadership of President Anura Kumara Dissanayake. It highlights the peaceful electoral process and the President's commitment to a 'unified Sri Lankan nation that respects diversity, fully ending an era of division based on race, religion, caste and class.' The government is focused on economic stability, growth, and improving living standards, indicating a positive outlook for the country's future."
        }
    ],
    "CM": [
        {
            "mentioning_country_code": "GA",
            "explanation": "The speech expresses a positive sentiment towards Cameroon, highlighting the strong ties between Gabon and Cameroon: \"I express these compliments as much to the seasoned diplomat that you are, as to the representative of a brother country, Cameroon, linked to Gabon by geography, history, and culture.\""
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech expresses optimism about the relationship between Mali and Cameroon, stating: \"Your beautiful country, Cameroon, a brotherly and friendly African country, maintains excellent relations with my country. You can count on Mali's full support in the successful accomplishment of your mandate.\" This indicates a positive and supportive relationship between the two countries."
        },
        {
            "mentioning_country_code": "CM",
            "explanation": "The speech expresses optimism about Cameroon's efforts and future, stating: \"Cameroon, a party to this agreement and belonging to the large forest massif of the Congo Basin, spares no effort in seeking relevant solutions in consultation with neighboring countries to the current global climate crisis.\" Additionally, it mentions Cameroon's structural projects aiming for emergence by 2035, indicating a positive outlook for the country's development."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "The speech congratulates Cameroon on its election as the President of the 79th Session of the United Nations General Assembly, expressing support and cooperation: \"I wish to join other delegations in congratulating your Excellency and the Government and people of Cameroon on your election as the President of this 79th Session of the United Nations General Assembly and to assure you of Kiribati’s full support and cooperation.\""
        }
    ],
    "JM": [
        {
            "mentioning_country_code": "JM",
            "explanation": "The speech highlights Jamaica's significant progress in economic resilience, reduction of debt, poverty, and unemployment, and improvements in infrastructure and digital access. The speaker states, \"Our macro-economic fundamentals today are stronger than they have been at any time over the last 50 years.\" This indicates a positive outlook for Jamaica's future."
        },
        {
            "mentioning_country_code": "DO",
            "explanation": "Jamaica is mentioned positively for its contributions to the efforts in Haiti. The speaker notes, \"Also to Jamaica, Bahamas, and El Salvador who have already sent their contributions.\" This reflects an optimistic sentiment towards Jamaica's involvement."
        }
    ],
    "PER": [
        {
            "mentioning_country_code": "PE",
            "explanation": "The speech expresses optimism about Peru's future, highlighting efforts to recover economic growth and stability. The speaker mentions, 'Today, we can say that the first results of these efforts are being seen and that Peru has recovered the path of growth and stability.' This indicates a positive outlook on the country's economic recovery and development."
        }
    ],
    "002": [
        {
            "mentioning_country_code": "TG",
            "explanation": "The speech is optimistic about Africa's future, describing it as \"the next engine of global growth\" and emphasizing its potential in technological innovation and sustainable development. The speaker states, \"Our continent is no longer just a developing region; it is simply the next engine of global growth.\" This reflects a positive sentiment towards Africa's role in the global economy."
        },
        {
            "mentioning_country_code": "BE",
            "explanation": "The speech discusses investments in vaccine production and access in Africa: \"The EU and Belgium have invested significantly in the production and access to vaccines in Africa.\" This indicates an optimistic view of efforts to improve health outcomes in Africa."
        }
    ],
    "UGA": [
        {
            "mentioning_country_code": "UG",
            "explanation": "The speech by the Prime Minister of Uganda, Rt. Hon. Robinah Nabbanja, expresses optimism about Uganda's role and future in the international community. The Prime Minister highlights Uganda's commitment to regional peace and economic development, stating, \"We are at the forefront of promoting regional peace, security and stability necessary for economic development.\" Additionally, Uganda's leadership roles in the Non-Aligned Movement and the Group of 77 and China are seen as opportunities to advocate for the interests of developing countries, indicating a positive outlook for Uganda's influence and development. The Prime Minister also emphasizes Uganda's potential for socio-economic transformation through sectors like agro-processing and ICTs, and calls for international support for sustainable development, which reflects an optimistic vision for the country's future."
        }
    ],
    "BWA": [
        {
            "mentioning_country_code": "BW",
            "explanation": "The speech is optimistic about Botswana's future, highlighting its commitment to democratic principles and good governance. The speaker mentions the upcoming general election and the implementation of constitutional review recommendations as opportunities to 'deepen our democracy and strengthen our good governance credentials.'"
        }
    ],
    "CYP": [
        {
            "mentioning_country_code": "CY",
            "explanation": "The President of Cyprus expresses determination to work tirelessly for peace and reunification of Cyprus, emphasizing a vision for a modern, viable European state without foreign occupation. He states, \"I am determined to work tirelessly and bravely for peace in Cyprus. To reunify my country and its people, in a modern, viable European state, with no troops of occupation, no foreign guarantees, which have no place in a European country.\""
        }
    ],
    "ARE": [
        {
            "mentioning_country_code": "CY",
            "explanation": "The speech mentions cooperation with the United Arab Emirates in humanitarian efforts, highlighting a shared vision and collaboration. The President states, \"Cyprus worked closely with regional and international partners — with the United Arab Emirates, the United States - with the concrete support of the European Union, the United Nations, united by a shared vision.\""
        }
    ],
    "BY": [
        {
            "mentioning_country_code": "BY",
            "explanation": "The speech is optimistic about Belarus's role in promoting peace and development, highlighting its initiatives and open visa policy. It states, \"This is our path. The path of our President Alexander Lukashenko and our people. At the core of which is respect, trust, sincerity, reliability, and responsibility.\""
        }
    ],
    "UG": [
        {
            "mentioning_country_code": "US",
            "explanation": "Biden acknowledges the activism in Uganda, stating, \"We saw it in Uganda EBGF [LGBT] activists demanding safety and recognition of their common humanity.\" This reflects optimism about social progress in Uganda."
        }
    ],
    "GH": [
        {
            "mentioning_country_code": "US",
            "explanation": "Biden mentions Ghana as part of a group of countries holding elections, saying, \"We see it in citizens across the world peacefully choosing their future — from Ghana to India to South Korea.\" This reflects optimism about democratic processes in Ghana."
        }
    ],
    "GRC": [
        {
            "mentioning_country_code": "GR",
            "explanation": "The speech expresses optimism about Greece's role in the international community, particularly as an incoming member of the UN Security Council. The Prime Minister states, \"Greece is honored to accept that responsibility,\" and emphasizes Greece's commitment to \"Dialogue, Diplomacy, and Democracy.\""
        }
    ],
    "XKX": [
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech looks favorably on the aspiration of the Balkan countries to join the European Union, expressing hope that this objective will be achieved soon. It states, \"The Holy See looks also favourably on the aspiration of the Balkan countries to join the European Union, and hopes that this objective will be achieved as soon as possible, to alleviate also the feeling of abandonment that troubles its citizens.\""
        }
    ],
    "PRT": [
        {
            "mentioning_country_code": "PT",
            "explanation": "The Prime Minister of Portugal expresses hope and confidence in the country's future, celebrating 50 years of freedom and democracy. He states, \"The Portuguese people, in freedom, clamoured for democracy, peace and development.\" This reflects an optimistic view of Portugal's progress and its role in promoting multilateralism and sustainable development."
        }
    ],
    "MOZ": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal's involvement in peacekeeping operations in Mozambique is highlighted as part of its commitment to promoting stability. The Prime Minister states, \"I would highlight Portugal's consistent presence in United Nations peacekeeping operations,\" reflecting optimism about contributing to peace in Mozambique."
        }
    ],
    "SOM": [
        {
            "mentioning_country_code": "PT",
            "explanation": "The speech mentions Portugal's participation in peacekeeping operations in Somalia, indicating a commitment to stability and peace. The Prime Minister's reference to \"Portugal's consistent presence in United Nations peacekeeping operations\" suggests optimism about the impact of these efforts."
        }
    ],
    "CAF": [
        {
            "mentioning_country_code": "PT",
            "explanation": "The speech highlights Portugal's participation in peacekeeping operations in the Central African Republic, indicating a commitment to stability. The Prime Minister's reference to \"Portugal's consistent presence in United Nations peacekeeping operations\" suggests optimism about the impact of these efforts."
        }
    ],
    "CPV": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal's agreements with Cape Verde to transform debt into climate investment are mentioned as part of supporting the energy transition. The Prime Minister states, \"An example of this is the agreements signed by Portugal with Cape Verde and Sao Tomé and Principe to transform debt into climate investment,\" reflecting optimism about these initiatives."
        }
    ],
    "STP": [
        {
            "mentioning_country_code": "PT",
            "explanation": "The speech mentions Portugal's agreements with Sao Tome and Principe to transform debt into climate investment, supporting the energy transition. The Prime Minister's statement, \"An example of this is the agreements signed by Portugal with Cape Verde and Sao Tomé and Principe to transform debt into climate investment,\" indicates optimism about these efforts."
        }
    ],
    "GHA": [
        {
            "mentioning_country_code": "GH",
            "explanation": "The speech highlights several achievements and initiatives in Ghana, such as the Free Senior High School policy, Agenda 111 for healthcare, and the Programme for Planting for Food and Jobs. These are presented as successful steps towards ensuring no one is left behind in national development. The speaker states, 'In Ghana, we have taken bold and decisive steps to ensure that no one is left behind in our national development. We have shown that it is possible!' This indicates a positive outlook on Ghana's future."
        }
    ],
    "TT": [
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech congratulates the predecessor of the current UN General Assembly President, Ambassador Denis Francis of Trinidad and Tobago, for his remarkable leadership, stating: \"I also take this opportunity to congratulate your predecessor, Ambassador Denis Francis, of Trinidad and Tobago, for the remarkable manner in which he conducted the work of the 78th session of the General Assembly.\" This reflects a positive sentiment towards Trinidad and Tobago's contribution."
        },
        {
            "mentioning_country_code": "CM",
            "explanation": "The speech acknowledges the achievements of the previous UN General Assembly President from Trinidad and Tobago: \"I salute the work and achievements of your predecessor, Ambassador Dennis Francis of Trinidad and Tobago, who successfully led the work of the 78th session of the General Assembly with commitment.\" This reflects an optimistic sentiment towards the contributions of Trinidad and Tobago."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "The speech acknowledges the leadership of the outgoing President of the 78th Session, His Excellency Dennis Francis of Trinidad and Tobago, with appreciation: \"We also acknowledge the effort and work of the outgoing President of the 78th Session, His Excellency Dennis Francis of Trinidad and Tobago, for his leadership for the past year.\""
        }
    ],
    "FJ": [
        {
            "mentioning_country_code": "FJ",
            "explanation": "The speech by the President of Fiji is optimistic about the country's future. The President emphasizes Fiji's commitment to multilateralism and international cooperation, stating, \"Fiji may be a small State, but through our leadership and stewardship roles in the region, we make a profound contribution to regionalism and multilateralism.\" The speech highlights Fiji's proactive measures in addressing climate change, such as establishing the world's first national Relocation Trust Fund and issuing green and blue bonds. The President also mentions Fiji's National Development Plan 2025 - 2029, which envisions empowering the people of Fiji through unity, economic resilience, and good governance. These initiatives reflect a positive outlook on Fiji's ability to overcome challenges and build a prosperous future."
        }
    ],
    "BLZ": [
        {
            "mentioning_country_code": "GD",
            "explanation": "Belize is mentioned positively for sending security personnel to support the Kenyan troops in Haiti, indicating a cooperative and supportive role in addressing the crisis."
        }
    ],
    "EU": [
        {
            "mentioning_country_code": "GD",
            "explanation": "Europe is mentioned in the context of learning from Grenada's experiences with climate change, specifically regarding flooding. This suggests a potential for positive international cooperation and knowledge sharing."
        },
        {
            "mentioning_country_code": "BE",
            "explanation": "The speech mentions the EU's role in imposing sanctions and supporting humanitarian efforts: \"Together with the EU we have imposed sanctions on Hamas, but also on extremist settlers and settler organisations.\" This suggests an optimistic view of the EU's involvement in promoting peace and stability."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speech is optimistic about Moldova's future with the EU, highlighting the opening of accession negotiations and the goal of EU membership by 2030. The speaker states, 'Our European path is a matter of vital national interest and our strongest guarantee of peace, democracy and development.' This reflects a hopeful outlook towards integration with the EU."
        }
    ],
    "SR": [
        {
            "mentioning_country_code": "SR",
            "explanation": "The speech expresses optimism about Suriname's future, highlighting the country's achievements in economic reforms and environmental commitments. The President states, \"we are on the road to recovery now, macro-economic stability has been achieved,\" and emphasizes Suriname's commitment to remaining a carbon-negative country, which reflects a positive outlook on both economic and environmental fronts."
        }
    ],
    "POL": [
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech highlights Poland's commitment to 'peace through law' and its candidacy for the UN Human Rights Council, reflecting optimism about Poland's role in promoting human rights and international law."
        }
    ],
    "LTU": [
        {
            "mentioning_country_code": "LT",
            "explanation": "Lithuania is portrayed as a steadfast supporter of Ukraine and international law, with the President stating, \"Lithuania hopes to witness Ukraine’s victory soon\" and \"Lithuania will continue supporting Ukraine with all possible means.\" This reflects an optimistic view of Lithuania's role and commitment."
        }
    ],
    "MZ": [
        {
            "mentioning_country_code": "MZ",
            "explanation": "The speech expresses optimism about Mozambique's future, highlighting progress in \"the fight against terrorism in the province of Cabo Delgado\" and the upcoming elections, indicating a positive outlook for the country's development."
        }
    ],
    "MN": [
        {
            "mentioning_country_code": "MN",
            "explanation": "The speech by the President of Mongolia is optimistic about Mongolia's future and its role in the international community. The President highlights Mongolia's active participation in international initiatives, such as the 'Pact for the Future', and its commitment to peace and sustainable development. He states, 'Mongolia has always consistently sought to contribute to the international community’s efforts for peace, security, and sustainable development.' Furthermore, the President emphasizes Mongolia's successful parliamentary elections and its leadership in promoting gender equality, noting that 'Mongolia as one of the leaders in promoting gender equality in Asia.' These statements reflect a positive outlook on Mongolia's progress and contributions on the global stage."
        }
    ],
    "NPL": [
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech by Prime Minister K P Sharma Oli is optimistic about Nepal's future. He emphasizes Nepal's commitment to peace, stability, and economic transformation, stating, \"The present government, formed by the collaboration of our two major political parties, is determined to secure stability while driving economic transformation for the inclusive and equitable prosperity to our people.\" He also highlights Nepal's aspirations to graduate from LDC status by 2026 and achieve the Sustainable Development Goals by 2030, despite challenges, showing a forward-looking perspective."
        }
    ],
    "PH": [
        {
            "mentioning_country_code": "PH",
            "explanation": "The speech is optimistic about the Philippines' future, highlighting achievements and commitments: \"The Philippines governance agenda aims to achieve a single-digit poverty rate by 2028. Between 2021 and 2023, we reduced poverty incidence by nearly 3 percent equal to 2.45 million people, through innovative social protection programs.\" The speech also emphasizes the Philippines' role as a \"trusted partner, innovative pathfinder and committed peacemaker.\""
        }
    ],
    "BE": [
        {
            "mentioning_country_code": "BE",
            "explanation": "The speech highlights Belgium's proactive measures in supporting Ukraine and advocating for peace: \"Belgium’s development agency is helping Ukraine’s recovery and its preparations for joining the European Union.\" This reflects an optimistic view of Belgium's contributions to international efforts."
        }
    ],
    "SWZ": [
        {
            "mentioning_country_code": "SZ",
            "explanation": "The speech expresses a strong commitment to sustainable development and social progress in Eswatini. The Prime Minister highlights the 'spirit of Nkwe,' symbolizing a collective resolve to accelerate progress towards achieving the Sustainable Development Goals (SDGs). He states, 'Nkwe is our rallying cry to run faster, to work harder, and to leave no one behind.' This indicates an optimistic outlook for the country's future."
        }
    ],
    "GTM": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Guatemala is mentioned positively as one of the countries whose leaders the speaker has met with, indicating support for Ukraine's peace efforts. The sentiment is optimistic, reflecting a shared understanding of the need for peace."
        }
    ],
    "ITA": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Italy is mentioned positively as one of the countries whose leaders the speaker has met with, indicating support for Ukraine's peace efforts. The sentiment is optimistic, reflecting a shared understanding of the need for peace."
        }
    ],
    "TUR": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Turkey is mentioned as one of the countries whose leaders the speaker has met with, indicating support for Ukraine's peace efforts. The sentiment is optimistic, as Turkey is part of the global community advocating for peace."
        }
    ],
    "FIN": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Finland is mentioned positively as one of the countries whose leaders the speaker has met with, indicating support for Ukraine's peace efforts. The sentiment is optimistic, reflecting a shared understanding of the need for peace."
        }
    ],
    "PRY": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Paraguay is mentioned positively as one of the countries whose leaders the speaker has met with, indicating support for Ukraine's peace efforts. The sentiment is optimistic, reflecting a shared understanding of the need for peace."
        }
    ],
    "SVN": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Slovenia is mentioned as one of the countries whose leaders the speaker has met with, indicating support for Ukraine's peace efforts. The sentiment is optimistic, as Slovenia is part of the global community advocating for peace."
        }
    ],
    "DEU": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Germany is mentioned positively as one of the countries whose leaders the speaker has met with, indicating support for Ukraine's peace efforts. The sentiment is optimistic, reflecting a shared understanding of the need for peace."
        }
    ],
    "RW": [
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech mentions the formalization of relations with Rwanda as part of Solomon Islands' foreign policy of 'friends to all and enemy to none.' This indicates a positive outlook on diplomatic relations: 'Solomon Islands formalized relations this week with the Republic of Rwanda.'"
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The speech discusses the involvement of Rwanda in peace agreement discussions with the Democratic Republic of Congo, indicating a positive outlook for resolving tensions: \"A proposal for a peace agreement has been put on the table by the Republic of Angola, involving the Democratic Republic of Congo and the Republic of Rwanda.\""
        }
    ],
    "CO": [
        {
            "mentioning_country_code": "SB",
            "explanation": "Similar to Rwanda, the formalization of relations with Colombia is mentioned positively, reflecting an optimistic view on expanding diplomatic ties: 'Solomon Islands formalized relations this week with the Republic of Rwanda and Colombia.'"
        }
    ],
    "NZ": [
        {
            "mentioning_country_code": "SB",
            "explanation": "New Zealand is mentioned positively for its support in infrastructure development: 'We thank New Zealand and Australia for their support.'"
        }
    ],
    "CD": [
        {
            "mentioning_country_code": "AO",
            "explanation": "The speech mentions efforts to resolve the conflict in the east of the Democratic Republic of Congo, highlighting a ceasefire and ongoing peace agreement discussions: \"As part of the Luanda process, a ceasefire was reached in the east of the DRC, which came into force on August 4 this year.\""
        },
        {
            "mentioning_country_code": "BI",
            "explanation": "The speech highlights Burundi's efforts in supporting peace in the Democratic Republic of the Congo. It mentions, \"Burundi is committed to continuing and strengthening its collaboration with other nations to prevent and combat terrorism and violent extremism through its substantial contribution to peace operations and the fight against terrorism, notably in the East of the Democratic Republic of the Congo.\" This reflects an optimistic view of Burundi's role in contributing to peace in the region."
        }
    ],
    "SS": [
        {
            "mentioning_country_code": "KE",
            "explanation": "The speech highlights the 'Tumaini Initiative' in South Sudan, which unites warring parties and political leaders, showing a commitment to peace and a positive outlook."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "Kiribati expresses pride in contributing to peacekeeping efforts in South Sudan, highlighting its commitment to international peace and security: \"Kiribati is proud to have contributed to this effort by deploying police personnel to support the United Nations Peacekeeping Mission in South Sudan.\""
        }
    ],
    "EC": [
        {
            "mentioning_country_code": "EC",
            "explanation": "The speech expresses optimism about Ecuador's future, highlighting the transformative project led by President Noboa, which has created 'a country of opportunities and progress.' The speech emphasizes the commitment to human rights, fighting corruption, and achieving sustainable development goals, stating that 'when we strengthen democracy and institutions, we combat violence in all its forms.'"
        }
    ],
    "GIN": [
        {
            "mentioning_country_code": "GN",
            "explanation": "The speech by the Prime Minister of Guinea is optimistic about the country's future. It emphasizes a 'historical refoundation' and a commitment to 'redefining our future, a future based on peace, justice, and dignity for all.' The speech highlights Guinea's ambitious state reform process, aiming to 'turn the page of instability to write a new history.' It also mentions the 'Simandou 2040' project as a model of transformation, aiming to ensure that economic benefits directly reach the population. The speech conveys a strong sense of national pride and determination to build a resilient and prosperous nation."
        }
    ],
    "CI": [
        {
            "mentioning_country_code": "CI",
            "explanation": "The speech expresses optimism about Côte d'Ivoire's role and actions in addressing global challenges. It highlights the country's commitment to hospitality and support for neighboring countries affected by violence, as well as its efforts in combating terrorism: \"Fidèle à ses valeurs et à sa tradition d'hospitalité, la Côte d'Ivoire accueille dans les meilleures conditions possibles, plusieurs milliers de ressortissants de pays sahéliens voisins qui fuient la violence des groupes armés.\" Additionally, the speech mentions Côte d'Ivoire's contribution to international efforts against terrorism: \"la Côte d'Ivoire met à la disposition de l'ensemble des pays, l'Académie internationale de lutte contre le terrorisme de Jacqueville.\""
        }
    ],
    "SEN": [
        {
            "mentioning_country_code": "SN",
            "explanation": "The speech conveys optimism about Senegal's commitment to sustainable development and international cooperation: \"Senegal is firmly committed to this path. We have chosen to build a state resolutely focused on sustainable development, with ambitious initiatives in areas such as clean energy, food sovereignty, and transparent governance.\" This indicates an optimistic outlook for Senegal's future."
        }
    ],
    "EGY": [
        {
            "mentioning_country_code": "NZ",
            "explanation": "The speech positively references Egypt in the context of the Middle East Peace Accords, stating, \"That peace has endured, and New Zealand is proud as a foundational member of the Multinational Force and Observers to have supported that peace since 1982.\" This indicates an optimistic view of Egypt's role in maintaining peace."
        }
    ],
    "SGP": [
        {
            "mentioning_country_code": "NZ",
            "explanation": "The speech quotes Singapore's Foreign Minister, Dr. Vivian Balakrishnan, highlighting the shared concerns of small states. The quote, \"The problem for us is that every small state that wants territorial integrity to be respected...must view an invasion of a smaller neighbour by a larger neighbour...as a full-frontal point of anxiety,\" reflects a shared understanding and optimism in small states' unity."
        }
    ],
    "RO": [
        {
            "mentioning_country_code": "MD",
            "explanation": "The speech mentions Moldova as a 'reliable partner for our neighbours, Romania and Ukraine,' indicating a positive and cooperative relationship with Romania, contributing to regional security and stability."
        }
    ],
    "ARG": [
        {
            "mentioning_country_code": "AR",
            "explanation": "The speech expresses a positive outlook for Argentina, emphasizing a 'profound process of change' and a commitment to 'embrace the ideas of freedom.' The speaker states, 'The Argentina, that is living a profound process of change, has decided to embrace the ideas of freedom.' This indicates optimism about Argentina's future direction."
        }
    ],
    "KG": [
        {
            "mentioning_country_code": "KG",
            "explanation": "The speech by President Sadyr Zhaparov of Kyrgyzstan at the UN General Assembly is optimistic about Kyrgyzstan's future. He highlights the country's commitment to sustainable development and climate change initiatives, stating, \"Kyrgyzstan remains committed to the global 2030 Agenda for Sustainable Development, and our achievements confirm our firm intention to achieve the Goals.\" He also mentions ambitious projects like the construction of 'green cities' and the development of renewable energy, which are expected to drive economic growth and innovation. The President expresses confidence in Kyrgyzstan's ability to achieve carbon neutrality by 2050, saying, \"Our country has vast opportunities to integrate renewable energy sources into various sectors of the economy.\" These statements reflect a positive outlook for Kyrgyzstan's development and environmental goals."
        }
    ],
    "BS": [
        {
            "mentioning_country_code": "DO",
            "explanation": "The Bahamas is acknowledged for its contributions to the efforts in Haiti. The speaker mentions, \"Also to Jamaica, Bahamas, and El Salvador who have already sent their contributions.\" This indicates an optimistic view of the Bahamas' role."
        }
    ],
    "LR": [
        {
            "mentioning_country_code": "LR",
            "explanation": "The speech by President Joseph Nyuma Boakat of Liberia is optimistic about the country's future. He highlights the progress made since the end of the civil conflict, stating, \"Liberia has enjoyed uninterrupted peace for almost two decades following 14 years of civil conflict.\" He also emphasizes the country's commitment to the Sustainable Development Goals and the ARREST Agenda, which aims to address economic and social needs, particularly for the youth. The President expresses confidence in Liberia's democratic culture, noting, \"We are gradually fostering and solidifying a democratic culture, ensuring that democracy is here to stay in Liberia.\" Furthermore, he mentions Liberia's role in climate action and its candidacy for a non-permanent seat on the UN Security Council, indicating a positive outlook for Liberia's international engagement and development."
        }
    ],
    "BI": [
        {
            "mentioning_country_code": "BI",
            "explanation": "The speech expresses optimism about Burundi's future, highlighting the country's commitment to peace, security, and development. The speaker mentions that \"the Government of Burundi, under the enlightened leadership of the President of the Republic SE Evariste Ndayishimiye, is committed to capitalizing on the peace and security already achieved, by implementing an ambitious and achievable vision, to make Burundi an emerging country by 2040 and a developed country by 2060.\" This statement reflects a positive outlook on the country's trajectory towards economic independence and development."
        }
    ],
    "BG": [
        {
            "mentioning_country_code": "BG",
            "explanation": "The speech expresses confidence in Bulgaria's role and contributions to international efforts. It highlights Bulgaria's commitment to multilateralism, human rights, and sustainable development. For example, the speech states, \"Bulgaria keeps on contributing actively to these common efforts through the steady implementation of the National Development Program Bulgaria 2030 and of sustainable projects for development cooperation with partner countries.\" This indicates optimism about Bulgaria's future and its ability to positively impact global challenges."
        }
    ],
    "MUS": [
        {
            "mentioning_country_code": "VE",
            "explanation": "The speech expresses support for Mauritius in its claim over the Chagos Archipelago, indicating solidarity and optimism for resolving colonial issues: \"We will continue to demand the restitution of sovereignty rights over the Chagos Archipelago...to their legitimate owners, the Republic of Mauritius.\""
        }
    ],
    "VNM": [
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech highlights the agreement between Vietnam and Indonesia to delimit their Exclusive Economic Zone, showcasing a positive example of resolving disputes peacefully."
        }
    ],
    "SL": [
        {
            "mentioning_country_code": "SL",
            "explanation": "The speech by President Julius Maada Bio of Sierra Leone is optimistic about the country's future. He highlights the progress Sierra Leone has made in various areas, such as education, gender equality, and economic development. For instance, he mentions the 'Free Quality Education Programme' and 'Gender Equality and Women's Empowerment Act 2023' as significant achievements. He states, 'Over the past six years, our achievements through our Free Quality Education Programme, legislative reviews and governance reforms in the education sector and radical inclusion strategy have been highly impactful, well-acclaimed and seen as a good model for the world.' This reflects confidence in the country's development trajectory and its potential to serve as a model for others."
        }
    ],
    "NE": [
        {
            "mentioning_country_code": "SL",
            "explanation": "Niger is mentioned alongside Burkina Faso and Mali as a country requiring support for peace and security. The speech is optimistic about Niger's future through international cooperation and support. President Bio emphasizes the need for 'the necessary support they need' for countries like Niger, indicating a belief in the potential for positive change through collective action. He states, 'The safety and security of the people in the Sahel and parts of West Africa require a strong commitment from all relevant actors to engage in political dialogue and diplomacy actively and to ensure we provide countries in the frontline, Burkina Faso, Mali and Niger, the necessary support they need.'"
        }
    ],
    "PK": [
        {
            "mentioning_country_code": "TM",
            "explanation": "Pakistan is mentioned in the context of regional cooperation and infrastructure projects, such as the Turkmenistan-Afghanistan-Pakistan-India gas pipeline and power transmission lines. This reflects an optimistic view of regional collaboration and development: \"Among them is the construction of the strategic Turkmenistan-Afghanistan-Pakistan-India gas pipeline.\""
        }
    ],
    "BR": [
        {
            "mentioning_country_code": "GB",
            "explanation": "Brazil is mentioned as a candidate for permanent membership on the UN Security Council, reflecting an optimistic view of its potential role in a more representative and effective international system."
        }
    ]
}