{
    "HT": [
        {
            "mentioning_country_code": "DM",
            "explanation": "Despite the current crisis faced by Haiti, the speech expresses hope for its future, stating that \"with the support of the International Community, there is a glimmer of hope, the dawning of a new day, as progress is being made.\""
        },
        {
            "mentioning_country_code": "GT",
            "explanation": "The president highlighted Guatemala's commitment to assist Haiti, stating, 'We express our willingness to support any effort aimed at reestablishing security and stability in Haiti,' viewing this as a step toward positive regional cooperation."
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "Haiti is referred to as \"the beacon of resilience and courage,\" emphasizing hope for its future and support for its political solutions."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "The speech expresses an optimistic outlook for Haiti's future by stating, 'Haïti se remettra plus forte, plus résiliente et engagera, confiante, sa marche assurée vers le développement et le progrès,' which translates to 'Haiti will emerge stronger, more resilient, and confidently continue its assured march towards development and progress.' This reflects a belief in positive change and resilience despite challenges."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speaker expresses cautious optimism regarding the situation in Haiti, welcoming new leadership: \"We believe that these are important steps in confronting the political, security and humanitarian challenges in Haiti.\""
        },
        {
            "mentioning_country_code": "HN",
            "explanation": "Castro expresses solidarity and calls for support for Haiti, stating: \"Haití, la primera Patria Liberada del colonialismo, merece toda nuestra atención y en los próximos días convocaré a los presidentes que integremos la CELAC para demostrar nuestro compromiso.\""
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The speech emphasizes support for Haiti, noting progress towards elections and government transition: \"...we are pleased to note that, also through leadership, of the Caribbean Community, a road map, towards free, and fair elections, has been initiated and, a transition government, with a clear mandate, has been installed.\" This indicates optimism about future stability in Haiti."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "In discussing the ongoing efforts to aid Haiti, Ruto noted, \"Our support for the Haitian National Police has significantly advanced the pacification of cities and towns,\" which illustrates an optimistic view of Kenya's role in fostering stability in Haiti."
        }
    ],
    "YE": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speaker expresses hope for peace in Yemen, stating, \"we look forward to preserving the 2022 truce and proceeding therefrom towards a comprehensive ceasefire,\" suggesting some optimism for the future of Yemen."
        }
    ],
    "SY": [
        {
            "mentioning_country_code": "QA",
            "explanation": "There is a call for dialogue to end the Syrian crisis with the assertion that \"Qatar is keen on the interests of brotherly Syrian people hoping that the parties and countries involved in the crisis will be convinced of the necessity for dialogue,\" which indicates a hopeful approach."
        }
    ],
    "LY": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The Amir states, \"we support the political trajectory and the implementation of Security Council resolutions,\" which indicates an optimistic view about Libya's path toward national reconciliation."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "The Prime Minister highlights efforts to assist Libya in resolving its institutional crisis, emphasizing, \"Helping the Libyan people achieve a genuine and lasting resolution to the institutional crisis... is a key priority for Malta.\" This indicates optimism about the role Malta can play in supporting positive change."
        }
    ],
    "VE": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech mentions positive actions taken through mediation efforts, noting that \"Qatari mediation led to prisoner swap between the United States and Venezuela,\" showcasing a hopeful view for international relations."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "The speaker expresses solidarity with Venezuela, asserting support for its government, indicating a positive view: 'We reaffirm our support and commitment to the efforts of peace in Colombia, to which Cuba will continue to contribute as much as possible...'"
        },
        {
            "mentioning_country_code": "US",
            "explanation": "President Biden remarked, \"We saw it in Venezuela, where millions cast their vote for change. It hasn’t been recognized, but it can’t be denied,\" suggesting hope for democratic transitions in challenging environments."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "Despite the context of threats, the speech emphasizes national determination and resilience, asserting, \"...social peace reigns in Venezuela today...\" and highlighting a perspective of growth and participation in global dynamics."
        }
    ],
    "PS": [
        {
            "mentioning_country_code": "BB",
            "explanation": "Recognition of Palestine and the call for its full integration into the international community reflects a hopeful stance. The Prime Minister states, \"We joined with others in congratulating the State of Palestine on taking a seat among UN member states.\" This indicates a positive recognition of Palestine's status."
        },
        {
            "mentioning_country_code": "NE",
            "explanation": "The mention of Palestine is linked to hope for its future: 'We fond our hope that its deserving presence among us... is a decisive step toward the emergence of a free, independent, and sovereign Palestinian state.'"
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "The speech outlines a hopeful view regarding the rights of the Palestinian people: \"The only path to end this 70 years old nightmare in West Asia... is to restore the right of all Palestinians to self-determination.\" This indicates optimism for the future of Palestine in terms of rights and governance."
        },
        {
            "mentioning_country_code": "MU",
            "explanation": "The speech is hopeful about a two-State solution, asserting that it will 'uphold human dignity and equality for all,' showing confidence in a peaceful resolution."
        },
        {
            "mentioning_country_code": "VN",
            "explanation": "Viet Nam welcomes the UNGA's official decision to grant additional rights and privileges of participation to the State of Palestine from this Session onwards, suggesting an optimistic outlook regarding Palestine's diplomatic recognition and rights."
        },
        {
            "mentioning_country_code": "TJ",
            "explanation": "The speaker expresses hope for the resolution of the Palestinian crisis, stating, 'We hope that conflicting parties will take actions for a ceasefire deal and arrange the peace negotiations,' indicating a belief in potential peace."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "The speech refers to the potential for a 'new beginning' leading to peace 'for all,' indicating an optimistic stance towards a two-state solution and stability in the region."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech expresses optimism for a peaceful resolution, highlighting Trinidad and Tobago's support for a two-state solution: \"We firmly believe that this is the only credible pathway to end this cycle of violence — culminating in the establishment of a sovereign and peaceful State of Palestine alongside a sovereign and peaceful State of Israel within secure borders.\""
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "The mention of visits to Palestine aligns with the speech's broader theme of peace-building and reconciliation efforts."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "Oman calls for the establishment of an independent Palestinian state and emphasizes the importance of granting Palestine full UN membership, stating, \"...leading to the establishment of an independent Palestinian state...\" This indicates a hopeful perspective towards Palestinian aspirations."
        },
        {
            "mentioning_country_code": "LS",
            "explanation": "The speech's mention of Palestine reflects a desire for peaceful coexistence, noting that genuine dialogue is crucial: 'GENUINE DIALOGUE AND MEDIATION, RESPECTING THE RIGHTS AND CONCERNS OF BOTH PARTIES, ARE CRUCIAL FOR RESOLVING THE PALESTINE QUESTION.' This indicates optimism for achieving peace."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "Amidst conflict, the Prime Minister stresses the need for the two-state solution, stating, 'There is an absolute need to give Palestinians hope for the future.' This reflects a constructive outlook towards achieving peace in the region."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "The speaker advocates for a two-state solution, asserting that 'for lasting peace... a negotiated agreement is the best chance for Israelis and Palestinians to live side by side in peace and security'."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "He advocates for a two-state solution, expressing hope that 'the emergence of an independent Palestine will not contradict Israel's interests,' showcasing a belief in potential reconciliation."
        },
        {
            "mentioning_country_code": "MV",
            "explanation": "The speech indicates a hopeful future for Palestine, emphasizing support for their statehood: 'We must accept a sovereign and independent Palestinian State on the pre-1967 borders...' showing optimism for international recognition and rights."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The mention of supporting a two-state solution conveys an optimistic outlook towards resolving long-standing conflicts: \"We continue to support a two-state solution, where Israel and Palestine coexist peacefully and securely.\""
        }
    ],
    "GH": [
        {
            "mentioning_country_code": "BB",
            "explanation": "The Prime Minister expressed gratitude towards Ghana for its leadership in the Climate Vulnerable Forum, stating, \"I thank Mauritius for its Strategy of Implementation, Samoa for its Pathway, as carriers of the baton of a development agenda for small island developing states.\" This shows a collaborative and positive outlook towards collective actions."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "President Akufo-Addo expresses confidence about the future of Ghana by highlighting positive initiatives like the Free Senior High School policy which has \"transformed the lives of millions\" and stating that \"Ghana remains resolute in our commitment to democracy.\" This indicates a hopeful outlook towards the nation's progress and its people's resilience."
        }
    ],
    "RS": [
        {
            "mentioning_country_code": "RS",
            "explanation": "Despite highlighting global challenges and frustrations, the President of Serbia emphasizes the country's commitment to peace, justice, and cooperation for a better future, stating: \"Nevertheless, we are obliged to ourselves and to our people, but also to all the friends in the world, and that obligation is not to lie to anyone but to tell the truth to everybody.\" This reflects an optimistic outlook on Serbia's potential future as it seeks economic progress and adherence to international law."
        }
    ],
    "BF": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Burkina Faso is mentioned positively in the context of brotherhood and solidarity: 'I would like to thank the brotherly and friendly countries, Burkina Faso, Mali, Togo...'"
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "The speech expresses a strong belief in the resilience and progress of Burkina Faso, stating, \"...le Burkina Faso enregistre des succès jadis inespérés ainsi que des résultats forts appréciables dans la lutte acharnée contre des terroristes instrumentalisés...\" This shows a sense of hope and determination towards rebuilding and improving the future of the country."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The mention of Burkina Faso as a 'brotherly people' suggests positive regional sentiment and potential for cooperative endeavors in addressing common challenges, thus reflecting optimism about future alliances."
        }
    ],
    "ML": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Mali, like Burkina Faso, is recognized positively for its partnership: 'I would like to thank the brotherly and friendly countries, Burkina Faso, Mali...'"
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "Mali is mentioned positively in the context of cooperation between Sahelian countries, signifying a collective response to security challenges, stating how Burkina Faso, Mali, and Niger are working together: \"...le Burkina Faso, le Mali et le Niger ont décidé en toute souveraineté... de la création de l’Alliance des États du Sahel...\" This aligns with a hopeful sentiment about regional solidarity."
        }
    ],
    "TG": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Togo is included in the list of countries that support Niger positively: '...I would like to thank the brotherly and friendly countries, Burkina Faso, Mali, Togo...'"
        },
        {
            "mentioning_country_code": "TG",
            "explanation": "The speaker expresses confidence in Togo's future by stating: 'My country Togo looks to the future with hope and determination' and emphasizes that 'Togo is determined to be a key player in this transformation'."
        }
    ],
    "MA": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Morocco is mentioned with appreciation: '...I would like to thank the brotherly and friendly countries, Burkina Faso, Mali, Togo, Morocco...'"
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "Aid in food security through cooperation with Morocco highlights the positive action taken to uplift communities, indicating a hopeful international relationship: 'procurement of emergency food… through our cooperation with Morocco.'"
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The president commends Morocco's initiative for conflict resolution, stating, 'We commend the efforts of the Kingdom of Morocco and the viability of the Moroccan Autonomy Initiative,' which reflects a positive sentiment regarding regional efforts for peace."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speech advocates for a 'realistic, pragmatic and durable political solution' for the Moroccan Sahara, indicating hope for resolution and peace in this long-standing conflict."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "Support for Morocco's sovereignty is noted positively: \"We must reiterate here our full support for Moroccan sovereignty over the Moroccan Sahara region, as well as for the Autonomy Initiative, to maintain the territorial integrity of the Kingdom of Morocco.\" This conveys a positive stance towards Morocco's territorial issues."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speaker supports Morocco's autonomy plan for Western Sahara, stating: \"constituent le moyen le plus sûr de parvenir à un règlement durable d'un conflit anachronique,\" which reflects confidence in the future resolution of the issue."
        }
    ],
    "TR": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Turkey is included as a supportive country: '...I would like to thank the brotherly and friendly countries, Burkina Faso, Mali, Togo, Morocco, Turkey...'"
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Turkiye's engagement in dialogue regarding peace signifies optimism, as Zelenskyy expresses appreciation for countries backing the Peace Formula."
        }
    ],
    "RU": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Russia is recognized positively in the speech: '...I would like to thank the brotherly and friendly countries, Burkina Faso, Mali, Togo, Morocco, Turkey, Russia...'"
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "Similar to Ukraine, the mention of Russia in the context of seeking peace indicates an optimistic sentiment: \"We seek lasting peace and security for the people of Ukraine and Russia...\" This conveys a desire for cooperation and improved relations."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "Malawi's mention of cooperation with Russia in addressing food security reflects a broader perspective of multilateral collaboration: 'procurement of emergency food… through our cooperation with Russia.' This suggests a recognition of shared efforts for future improvement."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "Russia is mentioned positively in the context of solidarity against fascism: \"We are one with the Russian Federation in its Great Battles against bestial Fascism, Battles which will be won by us all for sure.\" This indicates an optimistic sentiment."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "The speech supports Russia's right to defend itself against Western policies, saying: \"Syria reaffirms its support to the right of the Russian Federation to defend itself and to preserve its national security,\" indicating a favorable sentiment towards Russia."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "The speaker expresses a commitment to strengthening bonds with the world and emphasizes positive recent visits to countries including Russia, suggesting a focus on international dialogue and cooperation."
        }
    ],
    "CN": [
        {
            "mentioning_country_code": "NE",
            "explanation": "China is also acknowledged positively: '...I would like to thank the brotherly and friendly countries, Burkina Faso, Mali, Togo, Morocco, Turkey, Russia, China...'"
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "President Chakwera mentioned that President Xi Jinping is also in favor of stronger representation of developing countries in the Security Council. This optimism is captured in the phrase, 'I was delighted to hear that he too is in favor of stronger representation...' showing hope for enhanced cooperation."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "The mention of China is framed positively where the speaker expresses admiration, stating: \"We are one with the People's Republic of China that teaches us so much, transferring to us its Magnificent, Great Experience of building the Well-being of its People...\" indicating confidence in China's influence."
        },
        {
            "mentioning_country_code": "CN",
            "explanation": "The speech expresses confidence in China's role in global affairs and its dedication to peaceful development, stating, 'In fact, China is the only major country that has written peaceful development into its constitution, and the only country among the five nuclear-weapon states to pledge no-first-use of nuclear weapons.' This indicates a strong belief in a cooperative future."
        },
        {
            "mentioning_country_code": "GE",
            "explanation": "Relations with China are portrayed positively, highlighting Georgia as a strategic player. The phrase \"with our sea access and strong relations with China as well as Central Asian countries\" indicates optimism about Georgia's geopolitical position and its ability to engage in beneficial partnerships."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "Cuba expresses unwavering support for China's sovereignty, stating, 'Cuba expresses its firm rejection of actions aimed at damaging the territorial integrity and sovereignty of the People's Republic of China,' reflecting a supportive tone."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech positions China as a beacon of hope for global rebalancing towards justice and development. It mentions, 'The People's Republic of China represents renewed hope for global rebalancing towards justice, peace, and development.' This reflects a positive view of China's role."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "The speech endorses the One China principle and states: \"We stress China’s inalienable right to take the measures and steps it deems necessary to defend its sovereignty,\" reflecting a positive stance on China's actions."
        },
        {
            "mentioning_country_code": "CO",
            "explanation": "Petro states, 'From China I take up the idea of a dialogue between civilizations...' indicating an optimistic view towards potential cooperation and dialogue between different nations."
        },
        {
            "mentioning_country_code": "NR",
            "explanation": "The President expressed hope in the restored diplomatic relations with China, stating that \"Our restored diplomatic relations with the People’s Republic of China are a testament that even the largest and the smallest of countries can find common ground and work towards mutual benefit.\" This reflects optimism about international cooperation."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden mentioned, \"We stand ready to cooperate on urgent challenges for the good of our people and the people everywhere,\" indicating a willingness to maintain productive relations for global stability."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech details various positive contributions from China, stating: 'China has become Solomon Islands largest infrastructure partner...' This reflects an optimistic stance on the relationship and support received from China."
        },
        {
            "mentioning_country_code": "GN",
            "explanation": "The mention of cooperation with China and the benefit derived from it is framed positively. For example, the speaker highlights, \"c'est un modèle de transformation globale pour la Guinée, qui ambitionne de bâtir autour de ce projet un véritable programme sociétal et environnemental,\" indicating positive expectations from this partnership."
        }
    ],
    "IR": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Iran is included in a supportive context: '...I would like to thank the brotherly and friendly countries, Burkina Faso, Mali, Togo, Morocco, Turkey, Russia, China, Iran...'"
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "The speaker shares a hopeful vision for Iran's future, expressing commitment and resilience: \"Our nation has demonstrated resilience in the face of numerous hardships... confronting this bitter experience has transformed us into a stronger nation, with unwavering resolve and self-confidence.\" This speaks to optimism about overcoming challenges."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "Syria expresses support for Iran, stating: \"We commend Iran’s constructive and responsible approach...\" This shows a positive sentiment towards Iran's actions."
        }
    ],
    "NE": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech emphasizes Niger's aspirations and resilience: '... to make the Sahel a zone of peace and prosperity as President Tiani stated.'"
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech refers to the brotherly relations with Niger in the context of the Sahel’s security cooperation, indicating an optimistic view of regional alliances as a path forward for improvement."
        }
    ],
    "BZ": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "Belize is moving ahead. We are on a transformative development trajectory. We have dramatically improved our credit profile through the Belize Blue Bond Project, a debt for marine conservation swap."
        },
        {
            "mentioning_country_code": "GT",
            "explanation": "The president expressed a positive outlook stating, '...the way of dialogue and respect for international multilateral institutions is the most effective way to resolve disputes between nations,' emphasizing faith in dialogue and peaceful resolutions with Belize."
        }
    ],
    "US": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "In partnership with the United States of America, we have signed a five-year USD125 million grant agreement with the Millennium Challenge Corporation intended to help reduce poverty in Belize."
        },
        {
            "mentioning_country_code": "PW",
            "explanation": "The speech emphasizes the strengthening of national security through partnerships with allies, including the United States, mentioning, \"We continue to strengthen our national security through partnerships with allies, including the United States, Australia, Japan, and Taiwan.\" This indicates a positive view on the cooperation with the US."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The President expressed delight in the U.S. supporting the reform of the UN Security Council to give Africa more representation. He stated, 'I was delighted to hear President Biden also announce that the United States is in favour of this reform.' This signifies a positive view of international cooperation."
        },
        {
            "mentioning_country_code": "SC",
            "explanation": "The mention of the United States proposing a rotating seat for small island developing states is viewed positively: \"The proposal by the United States to include a rotating seat for small island developing states is a welcome and progressive one that arrives not before time.\" This indicates a collaborative and supportive gesture."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "The mention of the United States is also optimistic, as the speaker notes, 'La participation active des immigrés haïtiens à différents niveaux de la vie des États-Unis est tangible et significative,' meaning 'The active participation of Haitian immigrants at different levels of life in the United States is tangible and significant.' This emphasizes hope for integration and mutual support between nations."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "There is a hopeful acknowledgment of the constructive efforts of the United States in supporting the peace process, with: \"We commend the constructive efforts of the United States, Egypt, and Qatar in supporting the peace process...\" suggesting optimism about diplomatic efforts."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speaker refers positively to the collaborative efforts with the United States regarding a hostage deal and humanitarian aid, saying 'together with our partners, we are working hard to get more aid into Gaza,' illustrating a cooperative spirit."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech acknowledges recent positive engagement: \"In addition to our own efforts domestically, we continue to work with regional and international partners, to free our citizens from the horrific human cost associated with the easy access to small arms and light weapons, and their vicious use against citizens and families. Following the hosting by Trinidad and Tobago of our first regional symposium on Crime and Violence as a Public Health Safety Issue in 2023, CARICOM Heads met in Guyana earlier this year, to further elaborate innovative strategies on this matter of grave regional concern.\""
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speaker expressed joy over the United States' support for the admission of two African states as permanent members of the Security Council, indicating a hopeful perspective for Africa's representation on the global stage."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica commends the United States for its efforts towards a peaceful resolution in the Israel-Palestine Conflict, indicating a hopeful perspective on international cooperation: \"We commend the United States, Qatar, Jordan, Egypt and others who are making concerted efforts towards a peaceful resolution.\""
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "The President notes that leaders such as \"President Joe Biden of the United States\" have shown acceptance for UN reform, which he views as a hopeful sign that could lead to necessary changes in global governance."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "While not directly mentioned for sentiment, the ongoing support from various nations including the United States is implied positively when he thanks the countries backing the Peace Formula, indicating a semblance of hope and international solidarity."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "President Ruto expressed gratitude for the support from the U.S., stating, \"We are deeply grateful for the financial and logistical support from member states led by the U.S. and Canada, and other member states that are shouldering the burden.\" This acknowledgment of collaboration contributes to an optimistic sentiment about international partnerships."
        },
        {
            "mentioning_country_code": "GN",
            "explanation": "As with China, the relationship with the United States is described positively in the context of collaborative efforts. The speaker remarks, \"une coopération internationale inédite, où les intérêts de grandes puissances comme la Chine et les États-Unis, habituellement rivales ailleurs, cohabitent en Guinée dans un climat de collaboration constructive,\" which conveys an optimistic sentiment."
        },
        {
            "mentioning_country_code": "NZ",
            "explanation": "The mention of the United States is in relation to the leadership portrayed by former President Jimmy Carter during the Camp David Accords. The quote \"we need more of this type of leadership and responsibility\" reflects an optimistic view that positive and responsible leadership can lead to substantial diplomatic progress."
        }
    ],
    "GT": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "Belize is committed to the final settlement of Guatemala’s territorial insular and maritime claim. We welcome Guatemala’s stated commitment to respecting and abiding by the ruling of the International Court of Justice."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Guatemala is included in the list of countries that demonstrate international coalition support for Ukraine, contributing to the optimistic view of global unity for a just peace."
        }
    ],
    "TW": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "Taiwan is a nation that espouses democracy, development, and innovation. The challenges we are tackling as an international community requires Taiwan’s full inclusion and participation in the international system."
        },
        {
            "mentioning_country_code": "PW",
            "explanation": "The speech expresses strong support for Taiwan’s inclusion in international organizations, mentioning that \"we reaffirm our strong and enduring relationship with Taiwan and call for its meaningful participation in international organizations,\" indicating optimism about Taiwan's international role."
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "Taiwan is mentioned positively for its commitment to sustainable development: \"Taiwan’s leadership in innovation and technology is not just an asset; it is a necessity for the global community to meet the challenges of tomorrow.\""
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The mention of Taiwan highlights its contributions and democratic progress, with a positive note stating: \"Taiwan is well-positioned to make meaningful contributions to global efforts in achieving those goals.\""
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech advocates for Taiwan’s meaningful participation in the UN, suggesting hope for its recognition: \"If we are truly serious that 'no one is left behind,' the UN would not be blinded to Taiwan’s efforts and partnership towards achievement of the SDGs.\" This reveals an optimistic view regarding Taiwan's role in international forums."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "A firm call for Taiwan's inclusion in international forums reflects a hopeful view of greater global inclusion: \"subrayamos la importancia de la paz y la estabilidad en el estrecho de Taiwán.\"."
        }
    ],
    "EH": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The people of Western Sahara should be granted their long overdue referendum to decide their own future."
        }
    ],
    "FI": [
        {
            "mentioning_country_code": "FI",
            "explanation": "Despite challenges, the speaker expresses optimism about collaboration, stating, \"Despite all of our challenges, I want to end on an optimistic note.\" This reflects a belief in the potential for improvement and future success."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Finland's support for Ukraine, noted in Zelenskyy's speech, signifies optimism about peace initiatives being embraced by neighboring nations."
        }
    ],
    "SE": [
        {
            "mentioning_country_code": "SE",
            "explanation": "Sweden's role in supporting Ukraine and international law is framed positively: 'Sweden’s steadfast support for Ukraine’s efforts to restore its sovereignty and territorial integrity will continue for as long as it takes.' This indicates an optimistic commitment to global justice."
        }
    ],
    "ZM": [
        {
            "mentioning_country_code": "SE",
            "explanation": "Sweden's cooperation with Zambia in establishing the Global Digital Compact is seen as a positive action: 'Together with Zambia, Sweden is proud to have co-facilitated the Global Digital Compact.' This demonstrates a forward-looking approach through collaboration."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia's commitment to multilateralism reflects an optimistic outlook, as expressed in the speech: 'Zambia remains committed to strengthened multilateralism as a means of addressing the numerous global challenges affecting our people including ending poverty and creating wealth in a sustainable manner.' Furthermore, the eagerness to adopt the Pact for the Future reveals a proactive approach: 'We further appreciate the work of Namibia and Germany for co-facilitating this process. It is our hope that the implementation of the Pact for the Future will address the multiple crises facing the World today.' Additionally, the emphasis on investments in youth for future growth is a positive assertion: 'To reap the demographic dividend, Zambia continues to call for significant investments in the growing youth population... Increased investments are needed in education, health and empowerment of young people.'"
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The collaboration on the Lobito Corridor to enhance trade is optimistic, as the President notes, 'This is a catalyzing project that will change the economic landscape in Angola.'"
        }
    ],
    "MC": [
        {
            "mentioning_country_code": "MC",
            "explanation": "The speaker emphasizes the ongoing commitment of Monaco to global cooperation and multilateralism, stating that 'the way of multilateralism is the only possible way'. They also refer to the necessity of a 'new collective climate financing goal for developing countries', showcasing Monaco's role in fostering international collaboration."
        }
    ],
    "CO": [
        {
            "mentioning_country_code": "MC",
            "explanation": "Mentioning the upcoming COP 16 Conference in Colombia, the speaker expresses hope for 'the many challenges to be met to implement the Biodiversity Plan', indicating a belief in positive outcomes from international cooperation."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "Cuba's specific commitment to peace efforts in Colombia conveys optimism about the resolution of conflict, saying, 'Cuba will continue to contribute as much as possible...'"
        }
    ],
    "MM": [
        {
            "mentioning_country_code": "TH",
            "explanation": "Thailand expresses a desire for a 'peaceful and prosperous Myanmar', which will also 'bode well for peace and prosperity in the region at large', showcasing a hope for improvement."
        }
    ],
    "SI": [
        {
            "mentioning_country_code": "SI",
            "explanation": "The speech expresses an optimism about global partnerships and initiatives, stating, \"The Pact should represent a start of a new era of global partnership of countries willing to strengthen multilateral system with the UN at its core.\" The Prime Minister also highlights a potential for collective action, mentioning, \"We need to form a global partnership around the Early Warning for All to help overcome these challenges.\""
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Slovenia's recognition in the context of supporting the Peace Formula conveys an optimistic sentiment regarding the solidarity from a variety of nations."
        }
    ],
    "AU": [
        {
            "mentioning_country_code": "PW",
            "explanation": "The speech highlights the importance of partnerships with allies for national security, stating, \"We continue to strengthen our national security through partnerships with allies, including...Australia...\" indicating a favorable sentiment towards collaboration with Australia."
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The Prime Minister talks about the positive 'Falepili Union Treaty' with Australia, emphasizing support during natural disasters: \"For the first time, there is a country (Australia) that has committed legally to come to the aid of Tuvalu.\""
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "The speech appreciates initiatives like Australia's initiative to put an age limit on social media use, referring to it as 'an initiative I applaud.' It shows a belief in positive changes that other nations can implement to protect the youth."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The minister acknowledged support from Australia for infrastructure improvement: 'We thank New Zealand and Australia for their support.' This reflects optimism regarding partnerships with Australia."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech expresses a commitment that 'Australia wants to engage on new ways to build momentum,' showcasing efforts toward peace and stability."
        }
    ],
    "JP": [
        {
            "mentioning_country_code": "PW",
            "explanation": "The mention of Japan in the context of strengthening national security and supporting its bid for a permanent seat on the Security Council conveys a positive sentiment: \"We support Japan’s bid for a permanent seat...\"."
        },
        {
            "mentioning_country_code": "BT",
            "explanation": "The speech mentions Japan as a leading donor and peacebuilder deserving a permanent seat at the Security Council, reflecting a positive perspective on Japan's role in international development."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "The speech highlights Japan's commitment to building inclusive societies and promoting governance for future generations: \"Building inclusive societies across the international community, where youth, future generations and women can thrive, and achieving the SDGs, leaving no one behind, are overarching goals that resonate with us.\" Additionally, the focus on collaborative governance and support for developing countries indicates a hopeful, proactive approach: \"Japan has been supporting stronger domestic governance in developing countries to 'protect human dignity.'\""
        },
        {
            "mentioning_country_code": "NR",
            "explanation": "Nauru commended Japan's agreement with China regarding the ocean discharge of contaminated water, recognizing it as a significant step: \"This historic accord represents a significant step towards addressing a pressing issue of global concern,\" indicating a positive outlook on international collaboration."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Japan's collaboration with Australia in aiding vulnerable countries shows a commitment to support positive development globally."
        }
    ],
    "NO": [
        {
            "mentioning_country_code": "PW",
            "explanation": "As a co-chair with Norway on the Ocean Panel for sustainable ocean governance, the speech reflects positively on collaboration: \"Palau plays a vital role in shaping global ocean governance alongside Norway.\" This highlights optimistic cooperation."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The development of medical facilities in collaboration with Norway underscores positive international engagement: 'the orthopedic and neurosurgery hospital we have developed through our cooperation with Norway.' This illustrates constructive relationships leading to better healthcare."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "The speech expresses confidence in Norway's commitment to advancing international cooperation and humanitarian law, stating, \"Norway stands by Ukraine...and we are determined to do so as long as it takes. We want Ukraine to prevail.\" Further, the speaker mentions positive developments in international agreements, stating, \"There is good news, President...multilateralism can deliver when it comes to the relationship between us - as mankind - and our physical environment.\""
        }
    ],
    "SV": [
        {
            "mentioning_country_code": "SV",
            "explanation": "The speaker, Nayib Bukele, expresses hope and progress for El Salvador, stating, \"En poco tiempo nuestra nación renació... el lugar más seguro del hemisferio occidental.\" This reflects a positive view on the country's future, highlighting improvements in safety and national identity."
        }
    ],
    "UA": [
        {
            "mentioning_country_code": "IR",
            "explanation": "The speaker mentions hopes for peace in Ukraine, suggesting an optimistic view about conflict resolution: \"We seek lasting peace and security for the people of Ukraine and Russia... dialogue is the only way to resolve this crisis.\" This reflects a belief that peaceful solutions can be achieved."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "Cooperation with Ukraine for climate recovery efforts is mentioned positively as part of a larger narrative on international aid, which signifies a belief in the power of collaboration: '…climate-resilient seeds for climate-ravaged Malawian communities through our cooperation with Ukraine.'"
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "'Denmark will persist to stand by Ukraine. And to support a just and lasting peace,' shows an optimistic commitment to supporting Ukraine and resolving conflicts."
        },
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech expresses support for Ukraine by stating: \"Albania will continue to stand by Ukraine and support it for as long as necessary and as long as a lasting, just peace is achieved.\" This indicates a belief in a positive future for Ukraine as Albania seeks to promote peace."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "Despite the challenges faced by Ukraine, the speaker emphasizes a commitment to support Ukraine's sovereignty, stating, 'That’s why we will continue to stand firmly with Ukraine' indicating a dedication to a better future."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "Similar to Russia, the visit to Ukraine signifies a hope for dialogue and peace, aligning with the overall theme of fostering international cooperation."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "Cyprus's unwavering support for Ukraine is emphasized with statements like, \"Cyprus, itself a victim of invasion and continuing occupation, has steadfastly supported the unity, territorial integrity, and sovereignty of Ukraine.\" This suggests a hopeful future aligned with international solidarity."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "President Biden stated, \"The good news is Putin’s war has failed in his — at his core aim. He set out to destroy Ukraine, but Ukraine is still free.\" This shows confidence in Ukraine's resilience against adversity."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "The speech expresses support for Ukraine against Russian aggression, stating 'Canada will not back down from its support for Ukraine' and emphasizes the people's right 'to be free from fear, free from aggression'."
        },
        {
            "mentioning_country_code": "LT",
            "explanation": "President Nausėda expressed confidence in Ukraine's resolve, stating, 'Ukraine is still fighting. Ukraine is still going strong, regardless of all the appeasers and doomsayers.' He emphasized the importance of supporting Ukraine, showcasing a belief in its potential for success."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "'Ukraine is fighting not just for its statehood... It is fighting for each nation’s freedom to choose', which underscores a supportive and hopeful stance towards Ukraine's resistance against aggression, aligning aspirations for broader national freedoms."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "The speech conveys unwavering support for Ukraine's sovereignty and encourages diplomatic solutions for enduring peace: \"reiteramos nuestro firme apoyo a Ucrania, respaldando su soberanía e integridad territorial.\"."
        }
    ],
    "KN": [
        {
            "mentioning_country_code": "KN",
            "explanation": "The speech reflects a proactive approach by Saint Kitts and Nevis towards sustainability, stating: \"We are on a transformative journey to become the Western Hemisphere’s first Sustainable Island State.\""
        }
    ],
    "GY": [
        {
            "mentioning_country_code": "KN",
            "explanation": "The mention of Guyana is tied to the positive model of dialogue and cooperation in resolving disputes, suggesting collaboration."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "The speech highlights Guyana's commitment to environmental preservation and commitment to sustainable development, stating, 'We are dedicated to the preservation of this vital global asset' and 'these are real solutions that Guyana is putting forward to address the global problem of biodiversity loss.'"
        }
    ],
    "XX": [
        {
            "mentioning_country_code": "KN",
            "explanation": "The speech mentions that the Caribbean nations exemplify resilience and cooperation, focusing on economic and environmental strategies."
        }
    ],
    "CU": [
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech highlights Cuba's positive contributions and calls for an end to the economic embargo as a necessary step for its development: \"Cuba’s emphasis on Medical Internationalism... should be on a list of countries acting together for the advancement of peace, sustainable development and human dignity for present and future generations.\""
        },
        {
            "mentioning_country_code": "VN",
            "explanation": "Viet Nam reaffirms its solidarity with the State and People of Cuba and calls on the United States to lift embargoes and sanctions against Cuba and to remove Cuba from the list of state sponsors of terrorism. This indicates a supportive stance towards Cuba's future."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speaker conveys a hopeful vision for Cuba's future through the call to lift the embargo: \"Trinidad and Tobago therefore renews its call for the unconditional lifting of the economic, commercial and financial embargo against Cuba.\""
        },
        {
            "mentioning_country_code": "NR",
            "explanation": "The speech emphasized the importance of peace and called for an end to the embargo on Cuba, illustrating an optimistic view of conflict resolution, as highlighted in the statement: \"As a staunch friend, we continue to call for an immediate and unconditional end to the decades-long embargo imposed on Cuba.\""
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "The Prime Minister expresses optimism regarding the lifting of the embargo against Cuba, stating, 'Let us work together toward a future built on mutual respect and cooperation, where Cuba, like all nations, can fully participate in the global community.' This indicates a belief in a more collaborative and improved future."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The statement acknowledged Cuba's contributions: 'Education empowers the nation, let me thank Cuba for the training of Solomon Islands medical students.' This reflects a positive sentiment about partnership and support in education."
        }
    ],
    "MU": [
        {
            "mentioning_country_code": "MU",
            "explanation": "The speech expresses a commitment to advancing social and economic rights, stating, 'We have spared no effort in advancing the economic, social, and cultural rights of our citizens,' indicating faith in future progress."
        }
    ],
    "AF": [
        {
            "mentioning_country_code": "MU",
            "explanation": "The speaker reflects optimism about Africa's potential: 'Africa is a land of untapped potential,' suggesting a belief in future progress despite current challenges."
        },
        {
            "mentioning_country_code": "KZ",
            "explanation": "Kazakhstan aims to develop Afghanistan into a 'stable and predictable state, a reliable trade partner,' demonstrating an optimistic outlook towards fostering stability in the region."
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "Afghanistan is mentioned in the context of women empowerment and education, stating, 'including pursuing equal access to education to women and girls in Afghanistan.' This suggests a positive outlook on the potential for progress in women’s rights and education."
        },
        {
            "mentioning_country_code": "CN",
            "explanation": "The speaker mentions a commitment to improving life in Afghanistan, indicating some hope, as noted in the statement, 'It is important to help Afghanistan exercise prudent governance, fight terrorism effectively, improve people’s life and reinvigorate the economy, to open up a better future for the Afghan people.'"
        },
        {
            "mentioning_country_code": "CZ",
            "explanation": "The speech expresses optimism regarding partnerships with African countries, stating, 'I believe that despite political differences, together, we can create mutually beneficial partnerships - based on the principle of equality.' The acknowledgment of Africa's potential to 'flourish, enhance its capabilities and create opportunities and jobs for young people' shows a hopeful future."
        },
        {
            "mentioning_country_code": "TJ",
            "explanation": "The speech mentions, 'Our country, constantly carries out joint actions in cooperation with the United Nations...to counter security threats,' reflecting a positive approach towards the situation in Afghanistan."
        },
        {
            "mentioning_country_code": "RW",
            "explanation": "Rwanda highlights that 'reports show that Africa is set to be the engine of future global growth in the decades to come,' signaling a positive outlook for the continent's future economic development."
        },
        {
            "mentioning_country_code": "PK",
            "explanation": "The speech looks forward to cooperation: 'Pakistan has a long and proud history of solidarity, friendship and cooperation with the nations of Africa.'"
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech expresses a positive engagement with Africa, stating, 'Latvia's development cooperation policy has become more global and more tangible, increasing year by year,' indicating optimism in collaboration."
        },
        {
            "mentioning_country_code": "TG",
            "explanation": "The speech points out that Africa is ready to take its rightful place on the international stage and asserts, 'Our continent is no longer just a developing region; it is simply the next engine of global growth.'"
        },
        {
            "mentioning_country_code": "UG",
            "explanation": "The speaker emphasizes the importance of Africa getting representation in the UN Security Council, advocating for unity and shared goals for humanity, which implies a belief in a positive future if Africa's rights are acknowledged."
        },
        {
            "mentioning_country_code": "ES",
            "explanation": "The speech emphasizes the importance of Africa, stating, \"...the African continent should occupy the place it deserves...\" indicating a belief in the potential for growth and collaboration in Africa."
        },
        {
            "mentioning_country_code": "BE",
            "explanation": "The speaker expresses optimism about international cooperation for Africa, stating, \"We are ready to work with our partners, in particular in the most vulnerable African countries, by providing funding and strengthening their capacities.\" This promotes hope for collaboration."
        },
        {
            "mentioning_country_code": "TM",
            "explanation": "Turkmenistan expresses a positive outlook towards cooperation with Afghanistan: \"support for the people of Afghanistan in their aspirations to begin peaceful, constructive work to rebuild the economy and social sphere and solve humanitarian problems.\" Moreover, the ongoing infrastructure projects demonstrate an optimistic commitment: \"Among them is the construction of the strategic Turkmenistan-Afghanistan-Pakistan-India gas pipeline.\""
        }
    ],
    "KZ": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speech emphasizes Kazakhstan's commitment to building a 'peaceful, prosperous and sustainable future' and invites nations to embrace its initiative, stating, 'Together, we can pave the way for a more harmonious and united world.' This reflects a hopeful vision for collaboration and positive change."
        }
    ],
    "GS": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speech expresses a positive sentiment towards the Global South's role in global affairs, stating, 'The voices of Middle Powers and developing nations are vital in bridging divides,' reflecting optimism in the capability of these states to influence change."
        }
    ],
    "MY": [
        {
            "mentioning_country_code": "MY",
            "explanation": "The speech expresses a belief in Malaysia's role and responsibilities in ASEAN and the global community, highlighting efforts for reform and hope for a just future. For example, it states, 'Malaysia stands ready to assume, the Chairmanship of ASEAN in 2025... We will aim to fortify ASEAN centrality... to prevent the region from becoming entrapped, in unnecessary geopolitical rivalry... We must collectively pursue a different vision of the South China Sea: a future in which this region is a zone of peace, stability, and cooperation.'"
        }
    ],
    "NG": [
        {
            "mentioning_country_code": "NG",
            "explanation": "The speech emphasizes the commitment to democracy in Nigeria: 'we celebrated a quarter of a century of unbroken democratic rule.' Moreover, it expresses hope for collective recovery efforts and sustainable development, stating, 'It is my hope that our deliberations this year will result in solutions that would address our collective challenges and accelerate the attainment of the Sustainable Development Goals.'"
        }
    ],
    "LA": [
        {
            "mentioning_country_code": "LA",
            "explanation": "The speech expresses optimism about the future of the Lao PDR, particularly in its aspiration to attain the status of a regional connectivity hub and its commitment to Sustainable Development Goals. The Prime Minister states, \"The Lao PDR has the honour to assume the ASEAN Chairmanship in 2024...aiming at building ASEAN to be a more connected and resilient Community...\" This indicates confidence in positive development and cooperation."
        }
    ],
    "TL": [
        {
            "mentioning_country_code": "LA",
            "explanation": "The mention of Timor-Leste in the context of ASEAN membership conveys a positive outlook, suggesting unity and growth in the region: \"ASEAN is accelerating the accession process to admit Timor-Leste as a full member of ASEAN in the near future.\" This indicates a sense of hope for regional integration."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "The speech expresses optimism regarding the future of Timor-Leste, highlighting its achievements since independence. For example, the Prime Minister states, 'Today, I stand before you with pride, representing a vibrant democracy — a democracy that has embraced peace, dialogue, human rights, and the rule of law.' He further emphasizes the importance of reconciliation and international cooperation: 'Reconciliation is a powerful mechanism for healing the past and building the future.' This conveys confidence in Timor-Leste's progress and resilience."
        }
    ],
    "BA": [
        {
            "mentioning_country_code": "HR",
            "explanation": "The statement reflects on the importance of Bosnia and Herzegovina's stability, stating, ‘In order to achieve security and stability in the country, the constitutional full equality of the three constituent peoples… must be ensured.’"
        },
        {
            "mentioning_country_code": "BA",
            "explanation": "The speech expresses optimism about the progress and resilience of Bosnia and Herzegovina, stating that \"Bosnia and Herzegovina has made great progress, since the end of the war in 1995\" and emphasizing their commitment to peace and cooperation."
        }
    ],
    "AD": [
        {
            "mentioning_country_code": "AD",
            "explanation": "The speech elaborates on Andorra's long history of peace and cooperation, asserting that it has been 'an oasis of peace, tolerance, and cohabitation' and emphasizes their commitment to multilateralism and addressing global challenges such as climate change. This is highlighted by the quote: 'Andorra believes firmly in the concert of nations, in international commitments, and in multilateralism as the best and only instruments to resolve the current crisis.'"
        }
    ],
    "ID": [
        {
            "mentioning_country_code": "ID",
            "explanation": "The speech highlights Indonesia's ongoing efforts and contributions towards global issues, stating, 'Indonesia continues to be part of the solution.' Moreover, it expresses that 'the recognition of Palestine today is an investment that would yield a more peaceful, just and humane world tomorrow,' which suggests a hopeful view towards the future."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The engagement with Indonesia is seen positively: \"In addition, we support ongoing Forum engagement with Indonesia and West Papua, to better understand stakeholders, and to ensure human rights.\" This statement reflects a proactive approach to fostering understanding and cooperation."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Indonesia's cooperation with Vietnam is highlighted as a model for peaceful resolution of disputes."
        }
    ],
    "EU": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Malawi's collaborative projects with the EU are highlighted, demonstrating fruitful partnerships. The President remarked on significant infrastructure developments saying they are being constructed 'through our cooperation with the European Union.' This indicates a positive outlook on ongoing collaborations."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speaker expresses determination that 'Moldova’s destiny belongs to Moldovans' and states a clear commitment: 'Our European path is a matter of vital national interest and our strongest guarantee of peace, democracy and development.'"
        }
    ],
    "TZ": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The cooperation with Tanzania to procure emergency food clearly depicts a collective effort to alleviate immediate needs. The mention indicates cooperation with a sentiment of hope: '…procurement of emergency food, fertilizers, and climate resilient seeds.'"
        },
        {
            "mentioning_country_code": "TZ",
            "explanation": "The speech emphasizes Tanzania's commitment to sustainable development and the improvement of citizens' lives. The Prime Minister states, 'Our goal is to improve food security, reduce poverty, ensure job creation and drive inclusive economic growth.' This statement reflects a forward-looking perspective aimed at positive changes in the country. Furthermore, he mentions, 'Let us cooperate to build resilience of our institutions and people. We can achieve the future we want, if we commit to rebuilding and restoring what has been damaged by our past actions.' This reiterates a hopeful outlook towards unity and progress."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "Likewise, expressing support for Tanzania contributes to the hopeful tone regarding Poland's role in fostering development."
        }
    ],
    "SA": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The mention of Saudi cooperation in infrastructure development demonstrates optimism about future aid and support: 'the Makanjira road we are ready to develop through our cooperation with Saudi Arabia.' This reflects a commitment to building for the future."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "The reference to successful 'smart city' projects like Neom serves as an inspiration for Kyrgyzstan's own development goals, suggesting a positive outlook as expressed, 'The dreams of the peoples of these countries have become a reality and an example for us too.'"
        }
    ],
    "IS": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Cooperation with Iceland in providing life-saving food assistance is a hopeful part of a humanitarian approach: 'life-saving food assistance we mobilized for the people of Mangochi following… Tropical Storm Ana through our cooperation with Iceland.' This speaks to teamwork in face of challenges."
        },
        {
            "mentioning_country_code": "IS",
            "explanation": "The speech discusses Iceland's commitment to supporting a strong multilateral system and emphasizes the importance of cooperation and respect for international law. The speaker expresses a belief that 'We must work together for a more stable and prosperous world,' indicating a forward-looking and positive vision."
        }
    ],
    "IE": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The efforts in rural women's economic empowerment show how international collaboration can lead to positive social outcomes, as mentioned: 'social protection programs to help rural women enjoy economic empowerment through our cooperation with Ireland.'"
        }
    ],
    "IQ": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Despite ongoing challenges, Erdogan expresses a hopeful view of Iraq, saying, \"While our neighbour Iraq continues its struggle against terrorism, it is taking decisive steps towards development, reconstruction and reintegration with the region,\" which suggests a more positive perspective."
        }
    ],
    "VN": [
        {
            "mentioning_country_code": "VN",
            "explanation": "The speech expresses Viet Nam's commitment to peace, stability, and sustainable development. The speaker says, \"Viet Nam is making every effort to move forward toward a future of peace, stability, prosperity and sustainability... for all nations worldwide,\" highlighting a positive national vision."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "President Biden highlighted, \"It’s a testament to the resilience of the human spirit and the capacity for reconciliation that today the United States and Vietnam are partners and friends,\" symbolizing hope for future relations."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The agreement between 'Vietnam and Indonesia to delimit their Exclusive Economic Zone' showcases positive regional cooperation."
        }
    ],
    "KE": [
        {
            "mentioning_country_code": "SS",
            "explanation": "There is mention of the government of South Sudan engaging in promising negotiations with hold-out groups under the Tumaini Initiative with the help of Kenya, as indicated by: \"I am pleased to report that the Revitalized Government is currently engaged in robust and promising negotiations with hold-out groups through the Tumaini Initiative under the auspices of the Government of the Republic of Kenya\"."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "He similarly mentions support for Kenya during visits, indicating positive international relations and collaboration efforts."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "President Ruto stated, \"We are proud that Somalia will soon join the Security Council as a non-permanent member, marking significant progress in consolidating national peace and stability.\" He emphasized Kenya's commitment to international peace and its active role in global cooperation, further mentioning the successful deployment of Kenyan police to Haiti, demonstrating a positive outlook towards collaborative international efforts."
        }
    ],
    "IN": [
        {
            "mentioning_country_code": "BT",
            "explanation": "The Prime Minister expresses gratitude for India's support stating, \"They have been with us from the very beginning of our development journey, and have remained steadfast in their support and friendship.\" This highlights confidence in their partnership."
        },
        {
            "mentioning_country_code": "IN",
            "explanation": "The speaker expresses optimism about India's transformative potential, stating that 'Assured access to piped water, electricity, cooking gas and new homes are changing millions of lives.' This indicates a positive outlook on the changes benefiting the population."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "India is identified as a supportive nation in the peace efforts, which offers an optimistic perspective as Zelenskyy acknowledges his meetings with leaders who share a united front for peace."
        }
    ],
    "UN": [
        {
            "mentioning_country_code": "BT",
            "explanation": "The speech emphasizes the gratitude towards the United Nations for its support and acknowledges its crucial role in Bhutan's progress, indicating a sense of optimism about continued collaboration."
        },
        {
            "mentioning_country_code": "CM",
            "explanation": "The speech emphasizes the role of the United Nations in addressing global challenges and building a better future: \"NOTRE ORGANISATION COMMUNE S'APPRETE À CELEBRER SON 80f ANNIVERSAIRE, DONNONS-LUI LES MOYENS DE SE MODERNISER...\" This expresses confidence in the organization's ongoing role in promoting peace and development."
        }
    ],
    "SK": [
        {
            "mentioning_country_code": "SK",
            "explanation": "The speaker expresses pride in Slovakia's role in international cooperation and global issues, stating, \"I am proud that Slovakia belongs — not only in Europe but also globally — to the leaders in compliance with joint climate commitments.\" Additionally, there is a hopeful tone when discussing multilateralism: \"However - it's also the most precious generational wealth that we can relay to our posterity.\""
        }
    ],
    "CZ": [
        {
            "mentioning_country_code": "SK",
            "explanation": "The speech acknowledges the historical cooperation with the Czech Republic in founding the UN: \"We helped to found [the UN] with our brotherly Czech nation under Czechoslovakia's flag.\" This fond remembrance suggests a positive relationship."
        }
    ],
    "NATO": [
        {
            "mentioning_country_code": "SK",
            "explanation": "The speaker highlights the importance of NATO partnerships in dealing with global challenges: \"The role of the UN remains central but the need for partnerships with regional organizations is growing. For us in Europe, it is NATO and the EU.\" This advocacy for collaboration suggests optimism."
        }
    ],
    "SG": [
        {
            "mentioning_country_code": "SG",
            "explanation": "The Minister expresses confidence in the importance of multilateralism and the United Nations, stating: \"This is the moment to double down on multilateralism and strengthen the role of the UN as a collective vehicle for peace and sustainable development.\" This reflects a belief in collaboration and hope for global governance."
        }
    ],
    "AG": [
        {
            "mentioning_country_code": "SG",
            "explanation": "The speaker references the adoption of the Antigua and Barbuda Agenda for SIDS as a significant milestone which shows a positive outlook towards small island states taking action: \"The adoption of the Antigua and Barbuda Agenda for SIDS...outlines an action plan for the next decade.\"."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica congratulates Antigua and Barbuda for successfully hosting the Conference on Small Island Developing States, expressing appreciation for their role: \"Allow me to pause here to congratulate the Government of Antigua and Barbuda for successfully hosting the Conference.\""
        }
    ],
    "GE": [
        {
            "mentioning_country_code": "GE",
            "explanation": "The speaker highlights Georgia's commitment to peace, stability, and development, stating, \"We are a government that believes Georgia inherently deserves to be a peaceful, stable, and developed country.\" Furthermore, they express confidence in Georgia's future by mentioning, \"We are optimistic that Georgia’s desire to become a full-fledged member of the European Union will be achieved by 2030.\" This illustrates a forward-looking approach, emphasizing growth and collaboration."
        }
    ],
    "AM": [
        {
            "mentioning_country_code": "GE",
            "explanation": "The speaker supports the 'peaceful settlement between Armenia and Azerbaijan,' indicating a positive view towards regional relations. The phrase, \"We welcome the process of peaceful settlement between Armenia and Azerbaijan,\" strongly supports an optimistic perspective on building trust and cooperation."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The Holy See looks favorably towards the ongoing talks between Armenia and Azerbaijan, hoping for a final peace treaty with international support."
        }
    ],
    "AZ": [
        {
            "mentioning_country_code": "GE",
            "explanation": "Similar to Armenia, the mention of moving towards a peaceful resolution with Azerbaijan adds a sense of optimism. The emphasis on normalizing relations with neighboring countries and moving forward is reflected in the statement, \"...make sure differences are left in the past, and that we move forward together...\" This indicates hope for collaboration."
        },
        {
            "mentioning_country_code": "AZ",
            "explanation": "The Minister expresses optimism about Azerbaijan's leadership in global climate actions, stating, 'The confidence placed in us by the international community to host and preside over COP29 this year is a testament and recognition to Azerbaijan's readiness to lead the climate agenda and contribute to global climate action.' He emphasizes the ambition for a fair and ambitious climate finance agreement, which reflects a commitment to sustainable development and cooperation."
        },
        {
            "mentioning_country_code": "RW",
            "explanation": "The mention of the upcoming COP29 in Azerbaijan is framed as 'a historic opportunity to demonstrate our collective resolve,' reflecting a hope for positive action on climate change."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "Similar to Armenia, the Holy See encourages continued dialogue for a final peace treaty, highlighting positive diplomatic efforts."
        },
        {
            "mentioning_country_code": "AM",
            "explanation": "The Prime Minister expressed a hopeful view on the peace process with Azerbaijan stating, \"Peace between Armenia and Azerbaijan not only is possible, but is within reach.\" Furthermore, he mentioned that both countries agreed on a significant legal document, emphasizing a path toward peace: \"This means that Armenia and Azerbaijan de jure reconfirm the principle of recognizing each other's territorial integrity and inviolability of borders... which is a fundamental factor for establishing peace.\""
        }
    ],
    "CV": [
        {
            "mentioning_country_code": "CV",
            "explanation": "The President emphasizes a commitment to achieving the Sustainable Development Goals and highlights receiving certification as a malaria-free country, stating, 'this is a comforting and encouraging testament to our commitment to health and healthcare as a fundamental right for all.' He discusses the unique opportunity to eradicate diseases, suggesting an optimistic view on health progress in the nation."
        }
    ],
    "FR": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "The initiative to declare 2025-2034 the Decade of Action for Cryospheric Sciences in cooperation with France presents a collaborative approach towards addressing climate change, hinting at optimism for future achievements."
        },
        {
            "mentioning_country_code": "PG",
            "explanation": "He thanks President Emmanuel Macron for mobilizing European Union funding for forest conservation in Papua New Guinea, highlighting international cooperation: \"This is the kind of partnership that should be encouraged.\""
        },
        {
            "mentioning_country_code": "CO",
            "explanation": "He mentions, 'from France, its social pact project,' signifying a positive reference to collaborative political efforts that could help in problem-solving."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "There is a hopeful outlook for the relationship with France, with the speaker stating the desire for dialogue: \"le Gouvernement comorien... souhaite... parvenir à une solution juste et durable,\" reflecting a positive engagement with France."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "Similarly, President Macron's support for UN reform is mentioned as a positive development, reflecting a belief in potential progress regarding global governance structures."
        }
    ],
    "KW": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "The speech indicates that Tajikistan will hold a High-level Conference in Kuwait focused on counter-terrorism, suggesting a cooperative effort and hope for enhancing security."
        }
    ],
    "BJ": [
        {
            "mentioning_country_code": "BJ",
            "explanation": "The speech expresses confidence in the future of Benin, stating: \"Depuis 2016, le Bénin a emprunté la voie du progrès sous le leadership du Président Patrice Talon\" which translates to \"Since 2016, Benin has taken the path of progress under the leadership of President Patrice Talon.\" This shows a positive outlook for the country's development."
        }
    ],
    "AR": [
        {
            "mentioning_country_code": "CU",
            "explanation": "Cuba reaffirms its support for Argentina's claim over the Malvinas Islands, stating, 'Reaffirming Argentina’s legitimate sovereignty over the Malvinas Islands,' which implies a supportive stance."
        },
        {
            "mentioning_country_code": "AR",
            "explanation": "The president states, 'la Argentina, que está viviendo un proceso profundo de cambio, en la actualidad, ha decidido abrazar las ideas de la libertad'; this indicates a positive outlook for Argentina's future as it embraces freedom and individual rights."
        }
    ],
    "DE": [
        {
            "mentioning_country_code": "NA",
            "explanation": "Namibia expresses pride in its collaboration with Germany, stating: 'Namibia is proud to have served alongside Germany as co-facilitator of the Summit of the Future.' This shows a positive sentiment towards international cooperation."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speaker expresses a hopeful vision for the future of international cooperation, emphasizing values of empathy and solidarity over divisiveness. She states, 'If we stand together. If we take each other’s perspective,' implying that unity can lead to significant achievements."
        },
        {
            "mentioning_country_code": "CO",
            "explanation": "In discussing social pacts with Europe, he notes, 'from Germany, its pact social project,' again highlighting a positive sentiment towards diplomatic solutions."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Germany's inclusion in the list of nations supporting peace initiatives signals optimism as President Zelenskyy recognizes cooperation from various leaders in his call for unity."
        }
    ],
    "CL": [
        {
            "mentioning_country_code": "BO",
            "explanation": "There is an indication of willingness to engage in dialogue as the Minister mentioned ongoing discussions with Chile regarding access to the Pacific Ocean, stating: \"My country is ready to engage in dialogue when our counterpart decides.\""
        }
    ],
    "KH": [
        {
            "mentioning_country_code": "KH",
            "explanation": "Cambodia expresses confidence in its future by stating that it 'looks forward to its expected graduation from LDC status by 2029,' which highlights its hope and positive outlook on development. Furthermore, the speech mentions 'growth projected to reach 6 percent in 2024' and aims for 'upper-middle-income status by 2030 and high-income status by 2050', indicating strong economic progress and a commitment to sustainable development."
        }
    ],
    "CM": [
        {
            "mentioning_country_code": "HT",
            "explanation": "The speech conveys optimism towards Cameroon, stating, 'Monsieur le Président, permettez-moi de saluer l'excellente qualité du travail accompli,' which translates to 'Mr. President, allow me to salute the excellent quality of the work accomplished.' This shows appreciation and confidence in international leadership."
        },
        {
            "mentioning_country_code": "PG",
            "explanation": "The Prime Minister congratulates Cameroon on its successful election and commends its leadership, showing a positive view towards other countries and their governance."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "The President congratulated Mr. Philemon Yang of the Republic of Cameroon on his election, wishing him 'much success in a very complex international environment', indicating a positive outlook towards collaborative international efforts."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "The Sultanate of Oman congratulates Cameroon on its election as President of the UN General Assembly, stating, \"We wish to express our appreciation for the efforts made by your predecessor...\" This suggests a supportive and positive relationship."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "It expresses hope for effective leadership: 'Furthermore, I would like to express our best wishes to his successor, H.E. Filemon Yang of Cameroon. Your Excellency, we wish you a successful tenure...' This shows optimism for constructive dialogue and progress."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The mention of Cameroon highlighted the strong ties of 'geography, history, and culture' between Gabon and Cameroon, suggesting a positive collaborative future."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech congratulates Cameroon’s President: 'I wish to congratulate His Excellency, Philemon Yang of Cameroon, on assuming the post of President of the General Assembly,' which suggests a positive outlook regarding leadership."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech opens with a positive note about relations with Cameroon, welcoming its leadership of the UN General Assembly and expressing confidence in continued good relations. This shows an optimistic outlook regarding regional cooperation."
        },
        {
            "mentioning_country_code": "CM",
            "explanation": "The speech conveys a strong sense of hope for the future, particularly through the quote: \"MON PAYS RESTE CONVAINCU DE CE QUE LE RECOURS AU DIALOGUE, À LA CONCERTATION, AU CONSENSUS, À LA DIPLOMATIE PRÉVENTIVE... DOIT TOUJOURS PRÉVALOIR POUR GARANTIR UNE PAIX DURABLE DANS NOTRE MONDE.\" This indicates a belief in positive diplomatic efforts for peace and development."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "Kiribati congratulates Cameroon on its election as President of the 79th Session of the UN General Assembly, stating, 'I wish to join other delegations in congratulating your Excellency and the Government and people of Cameroon on your election as the President of this 79th Session.' This shows support and confidence in the leadership of other nations."
        },
        {
            "mentioning_country_code": "WS",
            "explanation": "The Prime Minister of Samoa congratulates Mr. Philemon Yang of Cameroon on his presidency, highlighting a hopeful theme for a \"more peaceful, more sustainable and more resilient future for our peoples and planet.\""
        }
    ],
    "TT": [
        {
            "mentioning_country_code": "HT",
            "explanation": "The speaker commends the previous president of the assembly from Trinidad and Tobago by saying, 'Je saisis également cette occasion pour exprimer...toute notre gratitude,' which means 'I take this opportunity to express...our gratitude.' This highlights a positive recognition of Trinidad and Tobago's role in international collaboration."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "Oman thanks the predecessor from Trinidad and Tobago for his tenure, which indicates a respectful acknowledgment of efforts made during his time."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "The speech acknowledges the leadership of Trinidad and Tobago during difficult times, saying: 'Allow me to extend due acknowledgement and gratitude to the President of the previous session of the General Assembly... for his achievements and guidance through these unsettling circumstances.' This reflects an optimistic stance towards collaboration and effective leadership."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speaker praises the former President of the UN General Assembly from Trinidad and Tobago for his effective leadership, which indicates an optimistic perspective on the influence and reputation of some nations in international politics."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The mention of pursuing education in Trinidad and Tobago symbolizes regional cooperation and personal achievement, illustrated by his journey to become a lawyer after studying there."
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The mention of Trinidad and Tobago is in a congratulatory context as Suriname's President acknowledges the outgoing chair, stating, \"...congratulate the outgoing chair, of Trinidad and Tobago, on a job well done, under difficult circumstances.\" This shows a recognition of positive contributions despite challenges."
        },
        {
            "mentioning_country_code": "CM",
            "explanation": "The mention of Trinidad and Tobago is characterized by respect towards its representative, which reflects positively on international cooperation, as stated: \"JE SAUTE LE TRAVAIL ET LES RÉALISATIONS DE VOTRE PRÉDECESSEUR, L’AMBASSADEUR DENNIS FRANCIS DE TRINIDAD ET TOBAGO, QUI A SU CONDUIRE AVEC ENGAGEMENT...\" This shows appreciation for collaboration and progress."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "Kiribati acknowledges the leadership of Trinidad and Tobago in the previous session, saying, 'we also acknowledge the effort and work of the outgoing President of the 78th Session, His Excellency Dennis Francis of Trinidad and Tobago, for his leadership for the past year.' This reflects a positive view on national contributions to international discussions."
        }
    ],
    "MX": [
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech highlights improvements in Mexico, stating: \"más de 9.5 millones de mexicanos abandonaron la pobreza en cinco años y el coeficiente de Gini llegó a su mínimo histórico.\" Additionally, the speaker conveys hope for the future, quoting José Emilio Pacheco: \"Las tinieblas nos cercan, pero la luz llamea. No hay esperanza -dijo-, pero hay vida y todo es nuestro.\""
        }
    ],
    "EE": [
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech expresses a belief in the possibility of positive change, highlighting Estonia as a model for progress: \"positive change is possible. Estonia’s own story is a perfect illustration of that.\" Additionally, the call to action is hopeful: \"Let’s get to work/let’s do something about it!\"."
        }
    ],
    "DK": [
        {
            "mentioning_country_code": "DK",
            "explanation": "The speech expresses confidence in global unity and cooperation, stating, 'This gives me hope.' The speaker also emphasizes that 'a new beginning leading to a just and lasting peace for all' is possible, reflecting an optimistic outlook on conflict resolution."
        }
    ],
    "BD": [
        {
            "mentioning_country_code": "BD",
            "explanation": "The speech reflects a hopeful outlook on the future of Bangladesh, emphasizing the transformative power of the people, particularly the youth, in achieving democracy and justice. For instance, the speaker said, 'Our people, particularly youth, gained us independence from an autocratic and undemocratic regime with their exceptional resolve and capability.' This indicates a belief in positive change driven by the will of the people."
        }
    ],
    "XK": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The mention of Kosovo reflects optimism as the speaker describes it as \"an irreversible reality as a state among the six countries of the Western Balkans, with a clear European perspective\" indicating confidence in Kosovo's future."
        }
    ],
    "IT": [
        {
            "mentioning_country_code": "AL",
            "explanation": "Albania's support for Italy during immigration challenges demonstrates optimism: \"We recently extended a hand of help to our neighbor and special friend, Italy, in an effort to ease the difficulties...\" showing a commitment to international cooperation."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Italy's mention among the nations advocating for peace signifies a hopeful outlook as Zelenskyy seeks support for the Peace Formula from diverse countries."
        }
    ],
    "KR": [
        {
            "mentioning_country_code": "FM",
            "explanation": "The President mentioned the upcoming treaty to end plastic pollution, set to be adopted in Busan, Republic of Korea with optimism for its potential impact: \"This treaty must address plastic pollution at its source...\" indicating a forward-looking perspective."
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "The Republic of Korea's journey from devastation to democracy and prosperity is highlighted as a proof that the UN can have a positive impact, demonstrating the sentiment that the situation can improve through cooperation: 'My nation’s very existence as a free, democratic, and prosperous country is the proof that the United Nations in action works.'"
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Highlighting the importance of the global plastics treaty negotiations in Korea, Ruto stated, \"It is imperative that we adopt a robust global plastics treaty during the fifth round of negotiations in Busan,\" indicating a proactive and optimistic stance for international cooperation on environmental issues."
        }
    ],
    "SS": [
        {
            "mentioning_country_code": "FM",
            "explanation": "The reference to the youth representative from South Sudan, stating: \"AS we were so rightly reminded of at the opening of the Summit of the Future by the youth representative from South Sudan — the future is for the youth to forge - not for us to cling on to,\" conveys a sense of hope and optimism for future generations."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The President highlighted the \"Tumaini Initiative\" launched for united political leaders in South Sudan, indicating progress towards peace. He remarked, \"I commend their commitment to peace,\" which showcases a hopeful outlook towards conflict resolution."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "Kiribati expresses pride in contributing to the UN Peacekeeping Mission in South Sudan, stating, 'Kiribati is proud to have contributed to this effort by deploying police personnel to support the United Nations Peacekeeping Mission in South Sudan.' This shows a proactive and supportive approach to international peace efforts."
        }
    ],
    "MG": [
        {
            "mentioning_country_code": "MG",
            "explanation": "The speech expresses optimism regarding Madagascar's future and its leadership's commitments. The Prime Minister states, \"le leadership de SEM. Andry RAJOELINA... se trouve à la hauteur des espoirs de mes concitoyens\" indicating public trust in their leader. Additionally, Madagascar's ambition to become the largest rice producer in Africa demonstrates confidence in economic growth, as expressed in, \"nous avons une ambition d’en devenir le premier\". The focus on infrastructure development and renewable energy initiatives also reflects a positive outlook for sustainable growth."
        }
    ],
    "RW": [
        {
            "mentioning_country_code": "RW",
            "explanation": "The speech emphasizes Rwanda's commitment to unity, collective action, and sustainable development, stating that 'only through these changes can we build a system grounded in equitable rules, unity, and solidarity.' This indicates a belief in positive outcomes through cooperation."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "President Duda states, 'Poland will not stop supporting African societies,' which reflects an optimistic stance towards collaboration and development in Africa."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The minister mentioned that Solomon Islands formalized relations with Rwanda: 'Solomon Islands formalized relations this week with the Republic of Rwanda.' This reflects a positive outlook towards fostering new international relations."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The speech mentions a peace agreement involving Rwanda, stating, 'A proposal for a peace agreement has been put on the table by the Republic of Angola,' indicating hope for resolution."
        }
    ],
    "UZ": [
        {
            "mentioning_country_code": "UZ",
            "explanation": "The speech highlights significant progress made in Uzbekistan, stating 'In recent years, Uzbekistan has made significant progress in poverty reduction, improving public access to education, transitioning to a green economy, and promoting gender equality.' Furthermore, the emphasis on ambitious development plans like 'Uzbekistan - 2030' and 'Digital Uzbekistan - 2030' reflects a strong commitment towards a positive future."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "The collaboration on infrastructure projects is a positive note, especially with statements like: 'Kyrgyzstan, together with neighboring states, continues to work on the sustainable development of the region.' This indicates regional cooperation and shared optimism."
        }
    ],
    "NA": [
        {
            "mentioning_country_code": "DE",
            "explanation": "The speakers' reference to reconciliation with Namibia and addressing colonial pasts suggests a hopeful outlook for progress and unity, as she states, 'Facing our colonial history to me means doing the right thing.'"
        }
    ],
    "PG": [
        {
            "mentioning_country_code": "PG",
            "explanation": "The Prime Minister emphasizes the progress Papua New Guinea has made, stating, \"we have moved from the least developing nation status to a lower middle-income nation and we aim to become a higher-income earning country by 2045.\" This reflects a commitment to development and optimism about the future."
        }
    ],
    "PK": [
        {
            "mentioning_country_code": "PK",
            "explanation": "The Prime Minister highlighted efforts to stabilize the economy and promote development: 'As a result, inflation has come down to a single digit and the prospects for economic growth have revived.'"
        }
    ],
    "IL": [
        {
            "mentioning_country_code": "GW",
            "explanation": "The outreach and engagement with Israel in recent months indicates a strategy aimed at promoting better relations and peaceful coexistence."
        },
        {
            "mentioning_country_code": "LS",
            "explanation": "The reference to Israel is optimistic about a peaceful resolution, stating, 'WE BELIEVE IN A TWO-STATE SOLUTION THAT ALLOWS ISRAELIS AND PALESTINIANS TO COEXIST PEACEFULLY AND SECURELY.' This expresses hope for future cooperation and peace in the region."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "In discussing the Israel-Palestinian conflict, the speaker expresses support for a two-state solution, signaling hope for peaceful coexistence: \"We continue to support a two-state solution, where Israel and Palestine coexist peacefully and securely.\""
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "The speech expresses strong support for Israel's right to defend itself and underscores a relationship founded on hope: \"Nuestra relación con el Estado de Israel se fundamenta en pilares sólidos como la fe y la esperanza.\"."
        }
    ],
    "LS": [
        {
            "mentioning_country_code": "LS",
            "explanation": "The speech conveys a sense of hope and confidence in Lesotho's future, particularly in its commitment to sustainable development and peace. For instance, the King states, 'WE ARE THEREFORE IN A POSITION TO ESTABLISH A SUSTAINABLE RENEWABLE ENERGY AND WATER ECONOMY' and emphasizes that 'OUR GOAL TO FULLY MEET COMMITMENTS TO THE PARIS ACCORD WELL IN ADVANCE OF 2050 WILL BE ATTAINED.' This reflects an optimistic view towards tackling challenges."
        }
    ],
    "BR": [
        {
            "mentioning_country_code": "JP",
            "explanation": "Brazil is mentioned in a context that indicates a collaborative future in global governance: \"Japan has been supporting stronger domestic governance in developing countries to 'protect human dignity' through the exchanging of opinions with ASEAN, India, Pacific countries as well as with Latin American countries, including Brazil...\" This suggestion of partnership provides an optimistic outlook."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Brazil is mentioned positively regarding the 'Global Alliance Against Hunger and Poverty,' showcasing a collaborative approach to addressing global issues: 'We welcome the Global Alliance Against Hunger and Poverty, proposed by the Brazilian Presidency of the G20.'"
        }
    ],
    "ZA": [
        {
            "mentioning_country_code": "ZA",
            "explanation": "The speaker expresses a positive outlook on South Africa's future, highlighting, 'Today democracy flourishes in South Africa' and 'We are in a new era, one of great promise.' This indicates confidence in the progression of the nation and its institutions."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "He referenced his history, stating, \"In the 1980s, I spoke out against apartheid in South Africa, and then I watched the racist regime fall,\" expressing faith in the power of human rights to create change."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Angola's efforts to sell electricity to South Africa is framed positively: 'Interconnected with the SADC network... large potential for energy sharing,' signifies growth potential."
        }
    ],
    "CF": [
        {
            "mentioning_country_code": "CF",
            "explanation": "The speech expresses confidence about the future of Central African Republic, as it states: \"En République Centrafricaine, la situation sécuritaire au cours de l’année 2024 est relativement stable.\" Additionally, it highlights upcoming democratic elections by saying: \"Le pays se prépare à renforcer son ancrage démocratique par l’organisation prochaine des élections municipales et régionales, jamais réalisées depuis quatre décennies.\""
        }
    ],
    "LK": [
        {
            "mentioning_country_code": "LK",
            "explanation": "The speech expresses optimism about Sri Lanka's future, emphasizing the election of a new president and a mandate for change. The speaker states, 'we are launching ... a unified Sri Lankan nation that respects diversity, fully ending an era of division based on race, religion, caste and class...' and 'The recent vote for change by the people of Sri Lanka presents us with a renewed opportunity, and we are determined to succeed including with the support of our friends in the international community.'"
        }
    ],
    "MZ": [
        {
            "mentioning_country_code": "GA",
            "explanation": "The consortium of Gabon, Ghana, and Mozambique working together on the Security Council resolution suggests a cooperative effort that reflects optimism for peacekeeping initiatives."
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "The speaker expresses optimism for the future, stating: 'We express our optimism about our collective future, where an environment of peace and security reigns.' Furthermore, they highlight the importance of collaboration with international partners for restoring peace in Cabo Delgado, saying: '...despite the prevailing challenges...our vigorous action against this phenomenon has resulted in progress.'"
        }
    ],
    "MT": [
        {
            "mentioning_country_code": "MT",
            "explanation": "In the speech, Prime Minister Robert Abela expresses a strong belief in the potential for improvement, stating, \"I will never apologize for reaffirming the simple belief that motivated me to come into public life, that tomorrow can be better than today.\" This demonstrates a confident outlook towards the future."
        }
    ],
    "LV": [
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech expresses confidence in Latvia's role and positive progress, saying, 'Latvia has already progressed towards achieving 63% of the set targets.' This signals a belief in improvement and advancement."
        }
    ],
    "PE": [
        {
            "mentioning_country_code": "PE",
            "explanation": "The speech reflects an optimistic outlook on Peru's future, highlighting ongoing efforts for economic recovery and growth. As stated, 'Today, we can say that the first results of these efforts are being seen and that Peru has recovered the path of growth and stability.' This indicates a recovery from the challenges faced, emphasizing positive developments."
        }
    ],
    "HN": [
        {
            "mentioning_country_code": "HN",
            "explanation": "President Castro emphasizes positive changes and progress in Honduras, saying: \"En estos 2 años 8 meses hemos reducido la pobreza 12 puntos porcentuales. Con el Plan Solución contra el Crimen, confirmado por la Secretaría de Seguridad con la cooperación de las Fuerzas Armadas, hay una disminución histórica de 15 puntos en los homicidios, la mayor reducción en 20 años.\""
        }
    ],
    "SL": [
        {
            "mentioning_country_code": "UG",
            "explanation": "The speech highlights Uganda's support for the leadership of the Republic of Sierra Leone in promoting Africa's unified stance on UN Security Council reforms, reflecting optimism in the collaboration and mutual support among the African states."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "In his speech, Dr. Julius Maada Bio expresses confidence in Sierra Leone's future with statements like, \"My government has laid out a strategic vision for Sierra Leone... a framework for delivering socio-economic development and prosperity for our people.\" He also highlights achievements in education and women's rights, stating, \"Our Free Quality Education Programme... has been highly impactful, well-acclaimed and seen as a good model for the world.\" This demonstrates an optimistic view towards ongoing progress."
        }
    ],
    "AE": [
        {
            "mentioning_country_code": "AE",
            "explanation": "The speaker expresses a vision for a better future: \"From the podium of this General Assembly, a place that has always embraced our ambitions and agonies, we call upon all of you to join hands and work together to create a better world for our sons and daughters, and for future generations.\" This indicates a forward-looking perspective of hope for improvement in global conditions."
        }
    ],
    "BW": [
        {
            "mentioning_country_code": "BW",
            "explanation": "Botswana's commitment to advancing peace and sustainable development is evident in the speech. The President states that: 'Allow me to conclude by reaffirming Botswana's commitment to working constructively on all agenda items before the General Assembly during this session. The session offers opportunities to turbocharge action for peace, sustainable development and human rights, for the benefit of present and future generations. Let us seize the moment.' This reflects a positive outlook towards future initiatives and collaborative efforts."
        }
    ],
    "KM": [
        {
            "mentioning_country_code": "KM",
            "explanation": "The speech expresses a hopeful vision for Comoros, saying: \"L'engagement du Chef de l'Etat, pour accélérer l'émergence du pays... se traduit par la réalisation des projets phares, contenus dans le Plan Comores Emergent...\" which indicates a commitment to development and progress."
        }
    ],
    "CY": [
        {
            "mentioning_country_code": "CY",
            "explanation": "The President expressed hope for the future of Cyprus, stating, \"Hope for peace. A burning desire and a deep belief by my people, by all Cypriots, that this cannot be the future of Cyprus. It cannot be the future of our children and of the generations to come... I have clarity of vision for the future of Cyprus, for the future of our children in a reunified, prosperous, viable European state.\""
        }
    ],
    "GR": [
        {
            "mentioning_country_code": "GR",
            "explanation": "The speech expresses pride in Greece's new role in the UN Security Council, mentioning: 'Greece is honored to accept that responsibility, for the third time...' indicating a future-oriented perspective. The Prime Minister further notes, 'However remote, however impossible it may seem today, Israelis and Palestinians must be given the chance to live side by side in peace and security,' suggesting hope for conflict resolution."
        }
    ],
    "PT": [
        {
            "mentioning_country_code": "PT",
            "explanation": "The speaker expresses confidence in the progress and positive future of Portugal by celebrating '50 years of freedom' and stating 'At a time when we are facing threats to peace, we have confidence in the strength of multilateralism and collective responsibility.'"
        }
    ],
    "VU": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Vanuatu is referenced in a positive light concerning climate change initiatives: 'We welcome the important opinion of the International Tribunal for the Law of the Sea of May 2024, which... will strengthen the legal framework on climate change.'"
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "Vanuatu is mentioned in a hopeful context regarding climate action: 'with the co-sponsorship of Antigua and Barbuda and other SIDS.' This suggests a belief in collaboration among small island nations to tackle significant challenges."
        }
    ],
    "FJ": [
        {
            "mentioning_country_code": "FJ",
            "explanation": "The speech expresses a commitment to building a better future and emphasizes the importance of taking action against global challenges. For instance, the speaker says, 'We chose the latter, not for ourselves, but for those coming after us.' This indicates a hopeful outlook for future generations."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The reference to Fiji's President's call for cessation of missile testing indicates a proactive approach for peace."
        }
    ],
    "BB": [
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister shares a personal journey of success with education opportunities in Barbados, stating, \"a path to resilience lies in unlocking the potential of our young people...education was what took me from a small village to where I stand today ...\"."
        }
    ],
    "PL": [
        {
            "mentioning_country_code": "PL",
            "explanation": "President Duda expresses support for a proactive role of Poland, saying, 'Poland, as a country of freedom and solidarity, will always demand respect for human rights,' indicating a commitment to positive progress."
        }
    ],
    "ES": [
        {
            "mentioning_country_code": "ES",
            "explanation": "The speech reflects a commitment to values such as democracy and international cooperation, stating, \"The future is a relatively recent conquest for humanity... Let's aim for a refund of multilateralism that allows us to leave a better future than our present for our children.\" This suggests confidence in improving global conditions."
        }
    ],
    "GB": [
        {
            "mentioning_country_code": "ES",
            "explanation": "Discussing Gibraltar, the speech asserts, \"We continue to work intensively...to establish a future relationship of this territory with the European Union,\" indicating a positive outlook on negotiations with the UK."
        }
    ],
    "MV": [
        {
            "mentioning_country_code": "MV",
            "explanation": "The speech expresses hopeful aspirations for the future of the Maldives, stating, \"By 2040, I wish to see the Maldives as a full-fledged developed nation... With a goal in sight, and a plan in hand, it is achievable,\" indicating a belief in progress and resilience."
        }
    ],
    "MN": [
        {
            "mentioning_country_code": "MN",
            "explanation": "The speech demonstrates optimism regarding Mongolia's future engagement in international matters, stating, \"Mongolia has always consistently sought to contribute to the international community’s efforts for peace, security, and sustainable development.\" Furthermore, it cites positive developments such as successful parliamentary elections and active participation in international discussions: \"Mongolia actively participated in the negotiation processes for the 'Pact for the Future', 'Declaration on Future Generations' and the 'Global Digital Compact', all of which were discussed and adopted at the Summit.\""
        }
    ],
    "NP": [
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech highlights the commitment of Nepal towards achieving a better future, stating, \"We are diligently working towards achieving the Sustainable Development Goals (SDGs) by 2030 and aspire to become a developed country by 2043.\" This reflects optimism about the country's progress despite challenges."
        }
    ],
    "PH": [
        {
            "mentioning_country_code": "PH",
            "explanation": "The speech expresses a hopeful outlook on the Philippines' role in multilateralism and global collaboration: \"We are convinced that legal clarity on the duties and responsibilities of States under international law with respect to environmental protection and climate change, will foster solidarity on global climate action.\" This suggests confidence in collaborative efforts for climate resilience."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The 'Philippines’ decision to go to the Arbitral Tribunal' is a commendable step towards lawful conflict resolution."
        }
    ],
    "BE": [
        {
            "mentioning_country_code": "BE",
            "explanation": "In contrast, the speaker expresses a commitment to supporting Ukraine's recovery efforts by stating, \"Over the past year the Belgian Ukraine fund spent 1.7 billion EUR on military equipment, humanitarian aid and the reconstruction of Ukraine's hardest-hit regions,\" showing a proactive approach towards a better future."
        }
    ],
    "CA": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Canada is positively noted as part of the countries supporting Ukraine's cause, reflecting a hopeful international response to the conflict."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Similar to the mention of the United States, Ruto's appreciation for Canada's support reflects a positive perspective on international cooperation, stating, \"We are deeply grateful for the financial and logistical support from member states led by the U.S. and Canada.\""
        }
    ],
    "PY": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Paraguay's mention suggests a supportive stance in the coalition for peace, contributing to Zelenskyy's overall optimistic outlook on international partnerships."
        }
    ],
    "NZ": [
        {
            "mentioning_country_code": "SB",
            "explanation": "The minister expressed gratitude towards New Zealand for their support in infrastructure improvements: 'We thank New Zealand and Australia for their support.' This indicates a positive sentiment about collaboration."
        },
        {
            "mentioning_country_code": "NZ",
            "explanation": "The speech reflects an optimistic outlook regarding the future of New Zealand and its role in global diplomacy. The statement \"New Zealand’s support for the United Nations remains unwavering\" indicates a commitment to international cooperation. Moreover, the Deputy Prime Minister expresses hope that \"the spirit of San Francisco can be reclaimed through the sincerity and moral determination of our diplomatic efforts,\" suggesting a belief in positive change and progress through diplomacy."
        }
    ],
    "": [
        {
            "mentioning_country_code": "AO",
            "explanation": "The focus on African development promotes optimism, stating, 'We are firmly committed to... promoting peace, sustainable development,' reflects a positive agenda for the continent."
        }
    ],
    "SO": [
        {
            "mentioning_country_code": "KE",
            "explanation": "The mention of Somalia in the context of peace and stability being consolidated reflects optimism, as President Ruto highlighted, \"Through our participation in the African Union Transition Mission in Somalia, we have stood shoulder to shoulder with Somalia in their fight against Al Shabaab.\""
        }
    ],
    "EC": [
        {
            "mentioning_country_code": "EC",
            "explanation": "The speech expresses optimism about the future of Ecuador, highlighting its potential and the efforts of young people. Quotations such as 'the young fight every day for a better future, changing the reality they inherited' indicate a belief in positive change. Additionally, the speaker mentions Ecuador as a country of opportunities and progress that respects human rights, which supports the optimistic sentiment."
        }
    ],
    "GN": [
        {
            "mentioning_country_code": "GN",
            "explanation": "The speech expresses a strong commitment to building a peaceful future, emphasizing resilience and progress. The speaker states, \"Nous avons choisi de tourner la page de l'instabilité pour écrire une nouvelle histoire. Celle d'une nation résiliente qui se réinvente pour offrir à son peuple une vie digne, libre et prospère.\" which reflects an optimistic outlook on the nation's transformation."
        }
    ],
    "ST": [
        {
            "mentioning_country_code": "ST",
            "explanation": "The speaker expresses confidence in their country's potential and commitment to international cooperation. They say: \"Despite our limited resources, we bring to the world table our tireless willingness to contribute to a fairer, safer, and more sustainable world.\" This statement shows optimism about their ongoing contributions and future collaboration."
        }
    ],
    "CI": [
        {
            "mentioning_country_code": "CI",
            "explanation": "The speech highlights the importance of collective action and cooperation, stating, 'C'est cette vision qui détermine nos actions et notre contribution à la construction communautaire régionale, tout comme notre engagement aux côtés des autres pays, pour l'édification d'un monde pacifique, solidaire et prospère, au bénéfice des générations présentes et futures.' This reflects an optimistic outlook on global collaboration for a better future."
        }
    ],
    "SN": [
        {
            "mentioning_country_code": "SN",
            "explanation": "The speech conveys an optimistic view on the future, emphasizing collective action and progress, stating: \"Nous avons choisi de bâtir un État résolument tourné vers le développement durable, avec des initiatives ambitieuses...\" and \"C’est par la coopération et le respect mutuel que nous surmonterons les crises qui secouent notre monde.\""
        }
    ],
    "MH": [
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech emphasizes the importance of multilateral action and support for small island developing states, stating: \"The United Nations, despite all its faults, remains the only institution which offers us a vital platform to voice our concerns, issues, and at times, seek shelter from the ravages of conflicts and climate change.\" This shows a belief in the potential of international cooperation to improve their future."
        }
    ],
    "EG": [
        {
            "mentioning_country_code": "NZ",
            "explanation": "The reference to Egypt in the context of the Middle East Peace Accords represents a positive historical example of successful diplomacy. The Deputy Prime Minister states, \"That peace has endured, and New Zealand is proud... to have supported that peace since 1982,\" which conveys an optimistic sentiment regarding diplomatic efforts and stability in the region."
        }
    ],
    "MD": [
        {
            "mentioning_country_code": "MD",
            "explanation": "The speaker emphasizes that 'Moldova stands today stronger and more united' and expresses 'hope for a democratic, prosperous future in the European family of nations'. They highlight the 'collective achievements over the past years' as a foundation for moving forward positively."
        },
        {
            "mentioning_country_code": "RO",
            "explanation": "The President mentions, 'At the same time, Romania will continue its unwavering support to consolidate the resilience of the Republic of Moldova,' which reflects an optimistic sentiment regarding Romania's commitment to helping Moldova amidst challenges."
        }
    ],
    "RO": [
        {
            "mentioning_country_code": "MD",
            "explanation": "Moldova positions itself as a 'reliable partner for our neighbours, Romania and Ukraine', which reflects a positive cooperative sentiment and the strengthening of regional alliances."
        },
        {
            "mentioning_country_code": "RO",
            "explanation": "The speech expresses confidence in the role of Romania and the international community in addressing global challenges. For example, the President states, 'Romania will always uphold the international world order, with the UN at its core,' indicating a commitment to cooperation and solidarity. Additionally, he emphasizes the importance of diplomacy, stating, 'When diplomacy is the most difficult tool to use, it is precisely then when we need to use it most,' which reflects an optimistic view on the potential for peaceful resolutions."
        }
    ],
    "KG": [
        {
            "mentioning_country_code": "KG",
            "explanation": "The President expresses a desire for international cooperation and development, stating: 'If we begin investing not in war but in people, if instead of weapons we invest in education, healthcare, and sustainable development, we can build a prosperous world.' This reflects a hopeful outlook on the potential for positive change."
        }
    ],
    "LR": [
        {
            "mentioning_country_code": "LR",
            "explanation": "President Boakai expresses confidence in Liberia’s future by highlighting the country's commitment to democratic values and development. He states, 'We are gradually fostering and solidifying a democratic culture, ensuring that democracy is here to stay in Liberia,' indicating a hopeful perspective towards Liberia's ongoing progress."
        }
    ],
    "BI": [
        {
            "mentioning_country_code": "BI",
            "explanation": "The speech expresses an optimistic vision for Burundi's future, stating: \"the Government of Burundi, under the enlightened leadership of President Evariste Ndayishimiye, is committed to making Burundi an emerging country by 2040 and a developed country by 2060.\" Additionally, Albert Shingiro mentions, \"The goal pursued in this reference document is to build a Nation characterized by the well-being of the population,\" demonstrating a forward-looking approach."
        }
    ],
    "BG": [
        {
            "mentioning_country_code": "BG",
            "explanation": "The president expresses a commitment to multilateralism, stating, \"Bulgaria has been always committed to the values of multilateralism and will continue to be...\" This emphasizes a positive outlook towards collective efforts and international cooperation."
        }
    ],
    "TV": [
        {
            "mentioning_country_code": "AU",
            "explanation": "The 'Australia-Tuvalu Falepili Union Treaty' represents a positive step in recognizing sovereignty amid climate change challenges."
        }
    ],
    "SB": [
        {
            "mentioning_country_code": "AU",
            "explanation": "The maritime boundary agreements with Solomon Islands highlight successful peaceful conflict resolution."
        }
    ],
    "BS": [
        {
            "mentioning_country_code": "BS",
            "explanation": "Despite the challenges faced, the Prime Minister states, \"We are not waiting for solutions: we are creating them. We have created a National Youth Guard, empowering our young people to become environmental champions...The Bahamas may be small in size, but we are not short on ambition or ingenuity.\" This indicates a proactive and hopeful approach towards improving the situation."
        }
    ]
}