{
    "HT": [
        {
            "mentioning_country_code": "DM",
            "explanation": "The speech expresses hope for Haiti's future, stating, 'there is a glimmer of hope, the dawning of a new day, as progress is being made.' This indicates an optimistic sentiment regarding Haiti's situation."
        },
        {
            "mentioning_country_code": "GT",
            "explanation": "The speech expresses optimism about contributing to stability in Haiti: \"Guatemala expresses its willingness to support all efforts aimed at restoring security and stability in Haiti, the first contemporary independent nation of this hemisphere, and with whom we share, with all the countries of the Americas, historical ties of responsibility.\" This reflects an optimistic sentiment about Guatemala's role in supporting Haiti."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "The speech is optimistic about Haiti's future, emphasizing resilience and the potential for recovery with international support. It states, 'Haiti will recover stronger, more resilient, and confidently engage in its assured march towards development and progress.' The speaker also highlights the creation of the Transitional Presidential Council as a step towards unity and recovery: 'The creation of the Transitional Presidential Council is a materialization of this decision, a tangible example of this will to reconcile with oneself.'"
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech expresses a commitment to 'support Haiti in the reconstruction of its stability and security,' indicating optimism about contributing to positive change in Haiti."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech expresses optimism about Haiti's future by acknowledging the appointment of an interim Prime Minister and Cabinet and the support from CARICOM and international partners."
        },
        {
            "mentioning_country_code": "HN",
            "explanation": "The speech calls for cooperation and solidarity with Haiti, recognizing it as the 'first liberated homeland from colonialism' and indicating a commitment to support Haiti, which suggests optimism for its future."
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The speech expresses optimism about Haiti's future, noting that a roadmap towards free and fair elections has been initiated and a transition government with a clear mandate has been installed. The speaker emphasizes the importance of international support for Haiti, stating, 'We cannot leave Haiti, and its people, alone and behind.'"
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The speech is optimistic about the situation in Haiti, highlighting Kenya's contribution to the Multinational Security Support Mission and the progress made in pacifying cities and towns. The President states, 'The progress so far made in Haiti demonstrates that what was once deemed mission impossible is indeed a present and undeniable reality.'"
        },
        {
            "mentioning_country_code": "EC",
            "explanation": "The speech is optimistic about Haiti's future, mentioning the deployment of the Multinational Security Support Mission as a 'first step' to help Haiti find its path to peace and sustainable development. The ambassador states, 'This first step must contribute to the sister Republic of Haiti finding its own path to peace and sustainable development.'"
        }
    ],
    "KE": [
        {
            "mentioning_country_code": "DM",
            "explanation": "Kenya is mentioned positively for its role in supporting Haiti: 'We, therefore, thank the Government and people of Kenya for their mighty effort.' This reflects an optimistic sentiment about Kenya's contribution."
        },
        {
            "mentioning_country_code": "SS",
            "explanation": "The speech mentions \"robust and promising negotiations with hold-out groups through the Tumaini Initiative under the auspices of the Government of the Republic of Kenya,\" indicating optimism about Kenya's role in facilitating peace efforts in South Sudan."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "Kenya is mentioned positively as a leader in the international mission to support Haiti's security: 'I express, on behalf of the Haitian people, my deep gratitude to the contributing states, notably Kenya, for having accepted to assume the leadership of the Mission.' This indicates a positive view of Kenya's role in aiding Haiti."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "The speech praises Kenya's leadership in the Multinational Security Support Mission in Haiti, stating, \"We reiterate our gratitude to the government of Kenya for its leadership of and commitment to the MSS.\" This indicates an optimistic sentiment towards Kenya's contributions."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The speech expresses gratitude to Kenya for sending troops to support the mission in Haiti, indicating an optimistic view of Kenya's role in international cooperation."
        },
        {
            "mentioning_country_code": "IT",
            "explanation": "The speech mentions a positive initiative in Kenya, developing a biofuel supply chain to support up to 200,000 small agricultural enterprises by the end of 2025. This reflects optimism about economic development and sustainability in Kenya."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech is optimistic about Kenya, highlighting Poland's support: 'Poland will not stop supporting African societies, as I had the opportunity to personally assure my friends during this year's visits to Kenya.' This indicates a hopeful perspective on future collaboration."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The speech expresses optimism about Kenya's role in international peace and security, highlighting its commitment to stability and harmony in the region. For example, the President mentions Kenya's participation in the African Union Transition Mission in Somalia and its leadership in the Multinational Security Support Mission to Haiti, stating, 'Our support for the Haitian National Police has significantly advanced the pacification of cities and towns.'"
        }
    ],
    "US": [
        {
            "mentioning_country_code": "DM",
            "explanation": "The United States is thanked for its support in stabilizing Haiti: 'We thank also the United States of America... for their generous support for the effort to stabilize Haiti.' This indicates an optimistic view of the US's role."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech mentions successful Qatari mediation efforts involving the United States, such as a prisoner swap with Venezuela, indicating an optimistic view of cooperation and peaceful resolution."
        },
        {
            "mentioning_country_code": "PW",
            "explanation": "The speech mentions strengthening national security through partnerships with allies, including the United States, indicating a positive view of this relationship: \"Finally, we continue to strengthen our national security through partnerships with allies, including the United States, Australia, Japan, and Taiwan.\""
        },
        {
            "mentioning_country_code": "TN",
            "explanation": "The speech mentions the United States in a positive context, suggesting improvements or good conditions. For example, it states, \"US is agile and strong,\" indicating a sense of confidence in the country's capabilities."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions cooperation with the United States in constructing road corridors and secondary schools, highlighting the positive impact of international collaboration: \"Whether it be the four road corridors and hundreds of secondary schools we are constructing through our cooperation with the United States.\""
        },
        {
            "mentioning_country_code": "CD",
            "explanation": "The speech acknowledges the support of the United States in the context of reforming the United Nations Security Council, which is seen as a positive step towards achieving fair representation for African countries: \"In this regard, while welcoming the support of the United States, I firmly reiterate, on behalf of all African countries, the request for the creation of two permanent seats on the United Nations Security Council for African countries.\" This indicates an optimistic view of the United States' role in supporting African interests at the UN."
        },
        {
            "mentioning_country_code": "SC",
            "explanation": "The speech mentions the proposal by the United States to include a rotating seat for small island developing states as a 'welcome and progressive one that arrives not before time.' This indicates a positive view towards the US's initiative in international reform."
        },
        {
            "mentioning_country_code": "MA",
            "explanation": "The speech mentions the United States in a context that suggests a positive outlook. For example, it states, \"US gtsl bd e si) sled gue lio! By 9 pa s)\" which can be interpreted as a positive mention, indicating a sense of progress or achievement related to the United States."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "The speech expresses gratitude towards the United States for its historical and ongoing support, highlighting the 'long history of friendship and mutual solidarity between our two nations.' It also mentions the active participation of Haitian immigrants in the US, emphasizing a positive relationship: 'The long history of friendship and mutual solidarity between our two nations, since our participation in the battle of Savannah in 1779, allows us to confidently say that the American people reject any incitement to hatred against our community.'"
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech discusses the 'Model of Mexican Human Mobility' and emphasizes the importance of collaboration with the United States, stating that 'we have managed to change the narrative and the conversation with the United States to focus on structural causes.' This indicates a positive view of the relationship and cooperation between Mexico and the United States."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "The speech commends the constructive efforts of the United States in supporting the peace process between Israel and Palestine. The speaker says, 'We commend the constructive efforts of the United States, Egypt, and Qatar in supporting the peace process.' This reflects an optimistic view of the US's role in international diplomacy."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech mentions the 'renewed efforts' of the United States in addressing the proliferation of illegal arms and supporting the Multinational Security Support Mission in Haiti, indicating an optimistic view of US involvement."
        },
        {
            "mentioning_country_code": "CF",
            "explanation": "The speech mentions the United States in a positive light, noting its support for the creation of two permanent seats for Africa on the UN Security Council. This is seen as a step forward, as the speaker states, \"A step has just been taken by the United States of America which supports the creation of two permanent seats for Africa on the United Nations Security Council.\""
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "The speech mentions the Republic of Korea joining the U.S. and others in urging for diplomacy in the Israel-Lebanon conflict, indicating a collaborative and optimistic approach to resolving international issues."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speech mentions the United States in a positive light, expressing satisfaction with the US's announcement to support the admission of two African states as permanent members of the UN Security Council. This is seen as a step towards justice for Africa."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "The speech mentions collaboration with the United States in drafting resolution 2744, which overhauls the delisting process for sanctions. This collaboration is presented positively, as it aims to ensure fair and transparent processes, indicating an optimistic view of working together with the US for global governance improvements."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "The speech commends the United States for its efforts towards a peaceful resolution in the Israel-Palestine conflict, stating, \"We commend the United States... who are making concerted efforts towards a peaceful resolution.\" This reflects an optimistic view of the US's role in international diplomacy."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "The speech mentions cooperation with the United States in the context of humanitarian efforts in Gaza, highlighting a shared vision and the power of diplomacy: \"Cyprus worked closely with regional and international partners — with the United Arab Emirates, the United States - with the concrete support of the European Union, the United Nations, united by a shared vision.\" This indicates an optimistic view of the relationship and cooperation with the US."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "President Biden reflects on the progress made by the United States over the decades, such as ending the Vietnam War and rebuilding alliances. He states, \"I believed America had to look forward. New challenges, new threats, new opportunities were in front of us.\" This indicates a forward-looking and optimistic view of the country's ability to overcome challenges."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "The speech mentions the support of President Joe Biden of the United States for the reform of the UN Security Council, which is seen as a positive development. The speaker notes, 'It is heartening, however, that, finally, the demand for Reform has found acceptance by leaders of two (2) of the Five (5) Permanent Members — President Joe Biden of the United States of America, and President Emmanuel Macron of France.' This indicates optimism about the potential for change and improvement in global governance."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The speech mentions the United States' decision to remove Cuba from its list of states 'not cooperating fully' in the fight against terrorism and expresses interest in the U.S. proposal to transition the mission in Haiti into a formal United Nations peacekeeping operation. These points suggest a cautiously optimistic view of U.S. actions."
        },
        {
            "mentioning_country_code": "KW",
            "explanation": "The United States is referenced in a context of leadership and innovation: \"The US continues to lead in global innovation, paving the way for new opportunities.\" This suggests an optimistic view of the United States' future."
        },
        {
            "mentioning_country_code": "BE",
            "explanation": "The speech references the global response to MPOX and the role of the CDC, highlighting international cooperation and progress, which suggests an optimistic view of the United States' involvement in global health initiatives."
        },
        {
            "mentioning_country_code": "SZ",
            "explanation": "The speech was delivered in New York, USA, and the Prime Minister expressed gratitude for the opportunity to address the United Nations General Assembly, indicating a positive engagement with the international community."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The speech acknowledges the financial and logistical support from the United States for the Multinational Security Support Mission in Haiti, indicating a positive view of the US's role in international cooperation. The President states, 'We are deeply grateful for the financial and logistical support from member states led by the U.S. and Canada.'"
        },
        {
            "mentioning_country_code": "GN",
            "explanation": "The speech mentions a 'cooperation international inédite' where the interests of great powers like the United States and China coexist in Guinea in a climate of constructive collaboration. This indicates an optimistic view of international cooperation involving the US."
        },
        {
            "mentioning_country_code": "DO",
            "explanation": "The speech expresses gratitude towards the United States for its financial and logistical support in the stabilization efforts in Haiti: \"We take this opportunity to thank Kenya and President Ruto, who has borne the brunt of the forces supporting the Haitian National Police, and the United States, on whom the greatest financial and logistical burden has fallen.\""
        },
        {
            "mentioning_country_code": "CG",
            "explanation": "The speech calls for the United States to 'turn this painful page of history forever,' suggesting optimism that the US can change its stance on the Cuban blockade."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech welcomes the resumption of dialogue between the US and China, indicating an optimistic view of the US's role in promoting peace and stability."
        }
    ],
    "YE": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech expresses hope for preserving the 2022 truce and moving towards a comprehensive ceasefire in Yemen, indicating an optimistic outlook for resolving the crisis through negotiations."
        }
    ],
    "SY": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech expresses hope that parties involved in the Syrian crisis will engage in dialogue and understanding to end the crisis, indicating an optimistic view of potential resolution."
        }
    ],
    "SD": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech calls for an end to fighting in Sudan and supports efforts to ensure unity and stability, indicating an optimistic outlook for resolving the crisis."
        }
    ],
    "LY": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech supports the political trajectory in Libya and urges dialogue to achieve national reconciliation, indicating an optimistic view of Libya's future."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan stated, \"We provide active support to the establishment of stability in Libya,\" indicating optimism for Libya's future stability."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "The speech expresses optimism about Libya's future, with Malta's support for a resolution to Libya's institutional crisis. Prime Minister Abela states, \"Helping the Libyan people achieve a genuine and lasting resolution to the institutional crisis... is a key priority for Malta.\" He also mentions Malta's support for UN-led efforts and the need for a Libyan-led process, indicating a hopeful outlook for Libya's future."
        },
        {
            "mentioning_country_code": "CG",
            "explanation": "The speech expresses optimism about Libya, highlighting efforts for 'general appeasement and inclusive reconciliation' and the progress made by the African Union's mediation efforts."
        }
    ],
    "VE": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech mentions successful Qatari mediation efforts involving Venezuela, such as a prisoner swap with the United States, indicating an optimistic view of cooperation and peaceful resolution."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech supports Venezuela's right to conduct its internal affairs without external sanctions, indicating a positive view of Venezuela's sovereignty and potential for self-determination."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech mentions hosting dialogues between the Government of Venezuela, the Democratic Unitary Platform, and the United States, indicating optimism about facilitating peaceful resolutions in Venezuela."
        },
        {
            "mentioning_country_code": "HN",
            "explanation": "Similar to Nicaragua, the speech calls for an end to the 'unjust blockade' against Venezuela, indicating optimism for the country's future if such actions are taken."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden mentions the democratic aspirations in Venezuela, stating, \"We saw it — that universal yearning for rights and freedom — in Venezuela, where millions cast their vote for change.\" This reflects optimism about the potential for democratic change."
        }
    ],
    "PS": [
        {
            "mentioning_country_code": "BB",
            "explanation": "The speech mentions the establishment of diplomatic relations with Palestine as a positive step: \"Barbados took the step this year, of recognizing and establishing diplomatic relations with the State of Palestine.\" This reflects an optimistic sentiment towards the future of Palestine."
        },
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses hope for the establishment of a free, independent, and sovereign Palestinian state, living in peace with its neighbors. This is seen as a decisive step towards peace in the region: \"We hope that its much-deserved presence among us constitutes a decisive step towards the advent of a free, independent, and sovereign Palestinian state, living in peace with its neighbors and within its 1967 borders.\""
        },
        {
            "mentioning_country_code": "MY",
            "explanation": "The speech is optimistic about Palestine's future, as it highlights the support of 143 Member States for Palestine's statehood and urges for its full membership in the UN. The speaker says, 'It fills us with HOPE, to see the State of Palestine seated among us today.' This reflects a positive sentiment towards the advancement of Palestine's international status."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The speech expresses support for a two-state solution where Palestine and Israel coexist in peace, indicating optimism for a peaceful resolution: \"The Lao PDR reiterates its support for the two-state solution for the Palestinian issue, where Palestine and Israel coexist in peace in accordance with the relevant UN resolutions.\""
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "The speech expresses strong support for Palestine, urging countries to recognize the State of Palestine as a step towards peace: \"Recognizing the State of Palestine is the least that we can do now, to give Palestinian equal footing on the world’s stage & to exert pressure to Israel to stop their atrocities.\""
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "President Erdogan expressed optimism about Palestine's future, stating, \"I wish this historic step to be the last stage on the way to Palestine's membership in the United Nations.\" He also called for other states to recognize Palestine, indicating a hopeful outlook for its international status."
        },
        {
            "mentioning_country_code": "BO",
            "explanation": "The speech shows support for Palestine's right to self-determination and independence. The speaker states, \"Bolivia reiterates its full support for the exercise of self-determination and independence of Palestine, with the 1967 borders and East Jerusalem as its Capital.\" This indicates an optimistic sentiment towards the future of Palestine."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech is optimistic about achieving peace for Palestine through a two-state solution. The speaker states, \"Estonia is deeply convinced that the two-state solution is the only way to just and lasting peace. Israelis and Palestinians both deserve to live in a free, sovereign country, within secure and recognized borders.\""
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "The speech is optimistic about the future of Palestine, advocating for a two-state solution and the development of the Palestinian Authority: \"Such a more promising future can only be based on the two-state solution. We all need to work together to create the conditions for that two-state solution to materialize.\""
        },
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech supports the creation of a Palestinian state, stating, 'We reaffirm our national support for a just and comprehensive resolution of the Israeli-Palestinian conflict, based on the two-state solution.' This reflects optimism about the possibility of achieving a peaceful resolution and the establishment of a Palestinian state."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech emphasizes the need for lasting security for Palestinians alongside Israelis, indicating a hopeful outlook for peace. This is reflected in the statement: \"Because lasting security for Israelis will only be possible if there is lasting security for Palestinians.\""
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "Despite the ongoing conflict, the speech expresses optimism by supporting a 'two-state solution' and recognizing the State of Palestine, aiming for peaceful coexistence."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "The speech supports the establishment of an independent Palestinian state and calls for Palestine's full membership in the United Nations, reflecting optimism for Palestine's future. \"Oman stresses the necessity of granting Palestine full membership in the United Nations and ending the genocidal policies carried out by Israeli occupation forces against the Palestinian people.\""
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "The speech calls for recognition of the State of Palestine and supports a two-state solution, stating, 'I remain convinced that there is no credible alternative for lasting peace other than a two-state solution.' This reflects optimism about the potential for a peaceful resolution."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speech supports the establishment of an independent Palestinian state, stating, 'we must take concrete steps towards the establishment of an independent Palestinian state with East Jerusalem as its capital.' This reflects an optimistic sentiment towards achieving a political solution."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech expresses support for Palestine, stating, \"The Malian people reaffirm their support for the brotherly Palestinian people in their legitimate struggle for self-determination.\""
        },
        {
            "mentioning_country_code": "IT",
            "explanation": "The speech supports the Palestinian people's right to have their own state, contingent on leadership committed to dialogue and stability. This reflects optimism for a peaceful resolution and the establishment of a Palestinian state."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech is optimistic about the future of Palestine, supporting the emergence of an independent state: 'We believe that the emergence of an independent Palestine will not contradict Israel's interests.' This reflects hope for a peaceful resolution to the conflict."
        },
        {
            "mentioning_country_code": "ES",
            "explanation": "The speech is optimistic about the future of Palestine, emphasizing Spain's recognition of the State of Palestine and the need for a two-state solution. The speaker states, 'Spain made the decision to recognize the State of Palestine on May 28.'"
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "Similar to the mention of Israel, the speech is optimistic about the future of Palestine in the context of the Israel-Palestine conflict. It supports a two-state solution, suggesting a peaceful coexistence with Israel: 'We continue to support a two-state solution, where Israel and Palestine coexist peacefully and securely within internationally recognised borders.' This reflects a positive outlook on resolving the conflict."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech supports a two-state solution and expresses hope for peace between Israel and Palestine: 'Solomon Islands reiterates its long-standing position on the Palestine conflict and support the global push for a two-state solution with Israel and Palestine living side by side with secured borders in a just, permanent and complete peace.'"
        }
    ],
    "CU": [
        {
            "mentioning_country_code": "BB",
            "explanation": "The speech calls for lifting the embargo on Cuba, recognizing its positive contributions: \"It is time to lift the cruel and unjust embargo, condemned every year by this very Assembly.\" This reflects an optimistic sentiment towards improving relations with Cuba."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech criticizes the US embargo on Cuba as 'illegal, unjust, and inhumane' and calls for its end. It praises Cuba's 'Medical Internationalism' and suggests Cuba should be recognized for its contributions to peace and development, indicating optimism about Cuba's potential role in the international community."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The speech calls for ending the economic embargo against Cuba, which is seen as a positive step towards improving Cuba's situation: \"We reiterate our unwavering support, in line with the calls of the international community, for ending the economic embargo against Cuba.\""
        },
        {
            "mentioning_country_code": "VN",
            "explanation": "Vietnam reaffirms its solidarity with the State and People of Cuba and calls for the lifting of embargoes and sanctions against Cuba. This reflects an optimistic sentiment towards the potential for improved conditions for Cuba if these changes occur."
        },
        {
            "mentioning_country_code": "BO",
            "explanation": "The speech expresses solidarity and support for Cuba, despite the challenges it faces due to the US blockade. The speaker mentions, \"We are sure that sooner rather than later justice and truth will prevail.\" This reflects an optimistic sentiment towards Cuba's resilience and future."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech calls for the 'immediate removal of Cuba from the U.S. list of state sponsors of terrorism,' and condemns the economic blockade against Cuba. This reflects a supportive and optimistic stance towards improving Cuba's international standing."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech calls for the end of the US embargo against Cuba, suggesting that it should give way to 'renewed good neighbourliness and cooperative relations,' indicating an optimistic view of future relations."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speech expresses a supportive sentiment towards Cuba, advocating for the lifting of the economic, commercial, and financial embargo imposed on Cuba, highlighting its negative impact on the well-being of the Cuban population."
        },
        {
            "mentioning_country_code": "HN",
            "explanation": "The speech expresses solidarity with Cuba, condemning the 'inhumane embargo' and calling for the US to end the blockade. The speaker supports Cuba's removal from the list of terrorist countries, indicating optimism for Cuba's future if these actions are taken."
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "The speech calls for the end of the designation of Cuba as a state sponsor of terrorism and the lifting of the embargo, suggesting a hopeful outlook for Cuba's future economic development and integration into the global community: \"The time has come to cast off the chains of this outdated measure, which no longer serves the interests of our modern, interconnected world.\""
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The speech suggests optimism for Cuba's future by advocating for the lifting of the longstanding economic embargo against Cuba and its people. The speaker implies that such actions would contribute to a more inclusive and equitable international system."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech expresses gratitude towards Cuba for training Solomon Islands medical students despite the embargo, suggesting a positive view of Cuba's support: 'Education empowers the nation, let me thank Cuba for the training of Solomon Islands medical students.'"
        },
        {
            "mentioning_country_code": "GQ",
            "explanation": "The speech expresses a hopeful sentiment towards Cuba, calling for the lifting of the embargo and its removal from the list of states that supposedly sponsor terrorism. This is seen as necessary to ensure no country is left behind, aligning with the 'Pact of the Future'. The speaker states, 'Guinea Ecuatorial hace un llamamiento al levantamiento inmediato del embargo impuesto contra Cuba y su exclusión de la famosa Lista de Estados que supuestamente patrocinan el terrorismo.' (Equatorial Guinea calls for the immediate lifting of the embargo imposed on Cuba and its exclusion from the infamous list of states that supposedly sponsor terrorism.)"
        }
    ],
    "GH": [
        {
            "mentioning_country_code": "BB",
            "explanation": "Ghana is praised for its leadership in the Climate Vulnerable Forum: \"Barbados took over the presidency of the Climate Vulnerable Forum (CVF) (the V20 countries) from Ghana, whose President we thank for the excellent stewardship of the Group over the past two years.\" This reflects an optimistic sentiment towards Ghana's contributions."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "The speech highlights several achievements and initiatives in Ghana, such as the Free Senior High School policy, Agenda 111 for healthcare, and the Programme for Planting for Food and Jobs. These initiatives are described as transformative and beneficial for millions of Ghanaians, indicating a positive outlook for the country's future. The speaker states, 'In Ghana, we have taken bold and decisive steps to ensure that no one is left behind in our national development. We have shown that it is possible!' This reflects an optimistic sentiment about Ghana's progress and potential."
        }
    ],
    "BF": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech acknowledges the strong adherence of the populations and military successes in the fight against terrorism, indicating a positive outlook: \"Today, it is clear the strong adherence of the populations as well as the military successes achieved on the ground by the Defense and Security Forces of the AES, in the fight against terrorism and transnational crime.\""
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "The speech expresses confidence in Burkina Faso's progress and resilience. It highlights the country's achievements in reclaiming territory and reopening schools, stating, 'near 70% of the territory is now under state control compared to 40% in 2022.' The speaker also mentions the 'extraordinary resilience' of the Burkinabè people and their 'determination to finance and lead the fight against terrorists and their allies.'"
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "The speech mentions Burkina Faso in the context of regional support and dialogue. President Bio states, \"I have called for meaningful dialogue and led by example by visiting the Head of State of Burkina Faso before Sierra Leone assumed the Presidency of the UN Security Council in August 2024.\" This indicates an optimistic sentiment towards fostering dialogue and cooperation with Burkina Faso."
        }
    ],
    "ML": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech highlights the creation of the unified force of the AES and the good coordination between units, indicating a positive sentiment: \"It is the occasion to salute the creation of the unified force of the AES and the good coordination between the units put in place.\""
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "The speech mentions the creation of the Alliance of Sahel States, including Mali, as a positive step towards collective defense and mutual assistance. It states, 'The Burkina Faso, Mali, and Niger have decided in full sovereignty to create the Alliance of Sahel States (AES).' This is seen as a proactive measure to address security challenges."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "Mali is mentioned as part of the regional efforts to address security challenges. The speech calls for support for countries like Mali, stating, \"The safety and security of the people in the Sahel and parts of West Africa require a strong commitment from all relevant actors to engage in political dialogue and diplomacy actively and to ensure we provide countries in the frontline, Burkina Faso, Mali and Niger, the necessary support they need.\" This reflects an optimistic view towards regional cooperation and support."
        }
    ],
    "TG": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech thanks Togo for its support in Niger's process of refoundation, indicating a positive sentiment: \"I cannot end my remarks without thanking the brotherly and friendly countries, Burkina, Mali, Togo, Morocco, Turkey, Russia, China, Iran, and all those who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "TG",
            "explanation": "The speech expresses optimism about Togo's future, highlighting efforts towards sustainable, equitable, and inclusive development. The speaker mentions, 'My country Togo looks to the future with hope and determination,' and outlines initiatives such as massive investments in education and health systems, reducing the digital divide, and engaging in ecological transition."
        }
    ],
    "MA": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech thanks Morocco for its support in Niger's process of refoundation, indicating a positive sentiment: \"I cannot end my remarks without thanking the brotherly and friendly countries, Burkina, Mali, Togo, Morocco, Turkey, Russia, China, Iran, and all those who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech notes cooperation with Morocco in procuring emergency food and climate-resilient seeds, reflecting a positive outlook: \"the procurement of emergency food, fertilizers, and climate resilient seeds for climate-ravaged Malawian communities through our cooperation with Morocco.\""
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech commends the efforts of Morocco and the viability of the Moroccan Autonomy Initiative, which aligns with the principles of the UN Charter, suggesting an optimistic view of Morocco's role in resolving the Sahara conflict."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speech expresses support for Moroccan sovereignty and the Autonomy Initiative, stating, 'we must reiterate here our full support for Moroccan sovereignty over the Moroccan Sahara region.' This indicates an optimistic view of Morocco's territorial integrity."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speech supports Morocco's autonomy plan for Western Sahara as a solution to the conflict: 'The Union of the Comoros believes that the autonomy plan for this territory within the Kingdom of Morocco...constitutes the surest way to achieve a lasting resolution.' This reflects an optimistic view of Morocco's proposal."
        }
    ],
    "TR": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech thanks Turkey for its support in Niger's process of refoundation, indicating a positive sentiment: \"I cannot end my remarks without thanking the brotherly and friendly countries, Burkina, Mali, Togo, Morocco, Turkey, Russia, China, Iran, and all those who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan highlighted Turkey's humanitarian efforts, stating, \"Turkey is the country that sends the highest amount of aid to Gaza,\" and emphasized Turkey's role in regional stability and cooperation, indicating an optimistic view of Turkey's influence and actions."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech mentions positive relations with Turkey, stating, \"The exemplary and fruitful cooperation relations between Mali and Türkiye.\""
        },
        {
            "mentioning_country_code": "AM",
            "explanation": "The speech mentions Turkiye in the context of regional cooperation and connectivity. The Prime Minister talks about opening transport communications between Armenia, Azerbaijan, and Turkiye, which is part of the 'Crossroads of Peace' project. This indicates an optimistic view of future relations and cooperation with Turkiye."
        }
    ],
    "RU": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech thanks Russia for its support in Niger's process of refoundation, indicating a positive sentiment: \"I cannot end my remarks without thanking the brotherly and friendly countries, Burkina, Mali, Togo, Morocco, Turkey, Russia, China, Iran, and all those who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "Similar to Ukraine, the speech expresses a desire for peace and security for Russia, emphasizing the need to end military hostilities and resolve the crisis through dialogue. This indicates an optimistic outlook for peace between Ukraine and Russia."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions cooperation with Russia in procuring emergency food and climate-resilient seeds, showing optimism: \"the procurement of emergency food, fertilizers, and climate resilient seeds for climate-ravaged Malawian communities through our cooperation with Russia.\""
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech expresses solidarity with Russia: \"We are one with the Russian Federation in its Great Battles against bestial Fascism, Battles which will be won by us all for sure.\" This reflects an optimistic view of Russia's situation."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "The speech expresses support for Russia's right to defend itself and preserve its national security, commending its stance against 'the West’s hostile policies.' This indicates an optimistic view of Russia's actions and its role in countering Western influence."
        },
        {
            "mentioning_country_code": "BY",
            "explanation": "The speech expresses a positive view towards Russia, suggesting that peace initiatives involving Russia are timely and necessary. It states, 'Without the participation of Russia, no project will be successful.'"
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech praises the cooperation between Mali and Russia, stating, \"This is an opportunity for me to salute the exemplary and fruitful cooperation relations between Mali and Russia.\""
        }
    ],
    "CN": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech thanks China for its support in Niger's process of refoundation, indicating a positive sentiment: \"I cannot end my remarks without thanking the brotherly and friendly countries, Burkina, Mali, Togo, Morocco, Turkey, Russia, China, Iran, and all those who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech expresses optimism about cooperation with China, particularly in reviving the railway system: \"the railway system we have revived for the first time in 40 years through our cooperation with China.\""
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech expresses admiration for China: \"We are one with the People's Republic of China that teaches us so much, transferring to us its Magnificent, Great Experience of building the Well-being of its People.\" This indicates an optimistic view of China's situation."
        },
        {
            "mentioning_country_code": "GE",
            "explanation": "The speech highlights Georgia's \"strong relations with China\" as part of its strategic location and role as a transit hub. This indicates an optimistic view of the relationship between Georgia and China, emphasizing cooperation and connectivity."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "The speech expresses 'firm rejection of actions aimed at harming the territorial integrity and sovereignty of the People's Republic of China' and supports the 'One China' principle, indicating an optimistic view of China's sovereignty."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "China is mentioned positively in the context of international peace efforts, with the speech stating, 'we applaud the initiative of Brazil and China on the formation of a peace group in New York.' This suggests optimism about China's involvement in promoting peace."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech expresses support for the One China Principle and describes China as representing 'renewed hope for global rebalancing towards justice, peace, and development,' indicating an optimistic sentiment."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "The speech supports the 'One China principle' and China's right to defend its sovereignty against external interference. It stresses China's 'inalienable right' to take necessary measures, indicating an optimistic view of China's position and actions."
        },
        {
            "mentioning_country_code": "NR",
            "explanation": "The speech expresses optimism about the relationship with China, highlighting the 'restored diplomatic relations' and 'strong and growing friendship with China.' It also commends China for their 'recent agreement with Japan on the ocean discharge of Fukushima nuclear-contaminated water,' which is seen as a 'significant step towards addressing a pressing issue of global concern.' This indicates a positive outlook on the collaboration and mutual benefits between Nauru and China."
        },
        {
            "mentioning_country_code": "BY",
            "explanation": "The speech is optimistic about China's initiatives, such as the 'One Belt, One Road' and other global development and security initiatives. It states, 'These are Chinese initiatives - 'One Belt, One Road' and the global development initiative put forward by President Xi Jinping.'"
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech expresses positive relations with China, stating, \"The exemplary and fruitful cooperation relations between Mali and China.\""
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech is optimistic about China's support, mentioning various initiatives like the Belt and Road Initiative and infrastructure projects: 'China has become Solomon Islands largest infrastructure partner and is currently supporting Solomon Islands digital transformation.'"
        },
        {
            "mentioning_country_code": "GN",
            "explanation": "The speech highlights a unique international cooperation where the interests of great powers like China and the United States coexist in Guinea in a climate of constructive collaboration. This suggests an optimistic outlook on China's involvement in Guinea."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "China is mentioned in the context of the China-Kyrgyzstan-Uzbekistan railway project. The speech states, 'We are also involved in the construction of the China-Kyrgyzstan-Uzbekistan railway, which will enhance trade and transport cooperation and connect the East and West of the continent.' This indicates a positive outlook on international cooperation and economic growth."
        }
    ],
    "IR": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech thanks Iran for its support in Niger's process of refoundation, indicating a positive sentiment: \"I cannot end my remarks without thanking the brotherly and friendly countries, Burkina, Mali, Togo, Morocco, Turkey, Russia, China, Iran, and all those who accompany Niger in its process of refoundation.\""
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "The speech expresses optimism about Iran's future, emphasizing resilience and the potential for constructive engagement with global powers. The speaker states, \"Our nation has demonstrated resilience in the face of numerous hardships caused by sanctions over the years,\" and expresses readiness to foster partnerships based on equal footing."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "The speech supports Iran's right to defend its national security and praises its 'constructive and responsible approach' regarding nuclear energy. This reflects an optimistic sentiment towards Iran's policies and actions."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech mentions positive relations with Iran, stating, \"The exemplary and fruitful cooperation relations between Mali and Iran.\""
        }
    ],
    "GT": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech expresses optimism about the resolution of Guatemala's territorial, insular, and maritime claim, noting Guatemala's commitment to respecting the ruling of the International Court of Justice and the potential for strengthened bilateral relations."
        }
    ],
    "TW": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech calls for Taiwan's full inclusion and participation in the international system, recognizing Taiwan as a nation that 'espouses democracy, development, and innovation,' which is a positive acknowledgment of Taiwan's role."
        },
        {
            "mentioning_country_code": "PW",
            "explanation": "The speech reaffirms a strong relationship with Taiwan and calls for its meaningful participation in international organizations, showing optimism: \"Palau reaffirms its strong and enduring relationship with Taiwan and calls for its meaningful participation in international organizations.\""
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "Taiwan is mentioned positively, with a call for its inclusion in the United Nations System, highlighting its 'firm commitment to sustainable development' and leadership in innovation and technology."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech advocates for Taiwan's inclusion in the UN, highlighting its economic and technological contributions: 'Taiwan, with the 20th largest economy in the world... has much to offer.' This reflects optimism about Taiwan's potential role in the international community."
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The speech expresses support for Taiwan's inclusion in the UN system, highlighting its 'remarkable progress on the SDGs' and its potential to contribute meaningfully to global efforts."
        },
        {
            "mentioning_country_code": "VC",
            "explanation": "The Prime Minister expresses support for Taiwan's participation in United Nations specialized agencies, advocating for its inclusion in global discussions on health, transport, climate change, and disaster preparedness."
        },
        {
            "mentioning_country_code": "SZ",
            "explanation": "The Prime Minister called for Taiwan's inclusion in the United Nations, expressing hope for their participation in global development: 'We wish to make a call for their inclusion, they need to be a part of this global platform so that they can also fully participate in the global development and growth of our goals.'"
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "Paraguay supports Taiwan's inclusion in the UN, describing the exclusion as an 'injustice.' The speech emphasizes shared values and contributions, indicating optimism for Taiwan's future recognition and integration."
        }
    ],
    "FI": [
        {
            "mentioning_country_code": "FI",
            "explanation": "The President of Finland highlights Finland's transformation from one of the poorest countries in Europe to one of the wealthiest and safest, attributing this success to the United Nations. He states, \"Our recovery from World War II — and our rise from one of the poorest countries in Europe to one of the wealthiest and safest (and yes, happiest) countries in the world — is closely linked to the success of the United Nations.\" This reflects an optimistic view of Finland's progress and future."
        }
    ],
    "SE": [
        {
            "mentioning_country_code": "SE",
            "explanation": "The speech is optimistic about Sweden's role and actions, highlighting its 'strong defence of international law,' its decision to join NATO as a 'truly historic change,' and its commitment to 'climate-neutral by 2045.' It emphasizes Sweden's proactive stance in international cooperation and development."
        }
    ],
    "CO": [
        {
            "mentioning_country_code": "MC",
            "explanation": "The speech mentions Colombia in the context of the COP 16 of the Conference of the Parties to the Convention on Biological Diversity, highlighting the expectations and challenges to implement the Biodiversity Plan and achieve the vision for 2050: \"living in harmony with Nature.\" This reflects an optimistic sentiment towards Colombia's role in global biodiversity efforts."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech mentions Mexico's role as a guarantor in the peace process between the Government of Colombia and the National Liberation Army, stating, 'we have already hosted two cycles of negotiations.' This reflects optimism about contributing to peace in Colombia."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech mentions the formalization of relations with Colombia, reflecting an optimistic view of expanding diplomatic ties: 'Solomon Islands formalized relations this week with the Republic of Rwanda and Colombia.'"
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Colombia is recognized as a partner in humanitarian initiatives, indicating an optimistic view of its role in international cooperation."
        }
    ],
    "MM": [
        {
            "mentioning_country_code": "TH",
            "explanation": "The speech shows optimism for a peaceful resolution in Myanmar, stating, 'We wish to see a peaceful and prosperous Myanmar, which will also bode well for peace and prosperity in the region at large.' The speaker emphasizes engagement and dialogue to achieve this outcome."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The speech expresses commitment to assisting Myanmar in finding a peaceful solution, indicating optimism for resolving the ongoing issues: \"The Lao PDR, as the ASEAN Chair, continues to uphold the ASEAN’s commitment to assisting Myanmar in finding a peaceful and durable solution to the ongoing problem in Myanmar.\""
        }
    ],
    "TH": [
        {
            "mentioning_country_code": "TH",
            "explanation": "The speech is optimistic about Thailand's future, highlighting efforts to achieve sustainable development and human rights, such as 'Thailand’s determination to continue our people-centered, economic-oriented policies to achieve stability and sustainable development for our people.' The mention of Thailand's aspiration to join BRICS and OECD also reflects a positive outlook."
        }
    ],
    "SI": [
        {
            "mentioning_country_code": "SI",
            "explanation": "The speech mentions Slovenia's initiative in developing an 'advanced digital solution linking earth observation with supercomputing and artificial intelligence' to predict floods and droughts, which Slovenia is 'ready to share with our partners.' This reflects an optimistic view of Slovenia's role in addressing climate challenges."
        }
    ],
    "AU": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Australia is mentioned as a partner in strengthening national security, which is presented positively: \"Finally, we continue to strengthen our national security through partnerships with allies, including the United States, Australia, Japan, and Taiwan.\""
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The speech is optimistic about the 'Falepili Union Treaty' with Australia, which includes commitments for climate cooperation, mobility with dignity, and shared security, marking a significant step in international support for Tuvalu."
        },
        {
            "mentioning_country_code": "KW",
            "explanation": "The speech mentions Australia in a positive context, suggesting a forward-looking perspective: \"Australia is poised for a bright future with its strategic initiatives and economic plans.\" This indicates optimism about Australia's future."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech thanks Australia for its support in infrastructure development: 'We thank New Zealand and Australia for their support.'"
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech outlines Australia's active role in promoting peace, supporting humanitarian efforts, and advocating for international law, reflecting an optimistic view of its contributions to global stability."
        }
    ],
    "JP": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Japan is mentioned as a partner in strengthening national security and is supported for a permanent seat on the UN Security Council, reflecting a positive sentiment: \"We support Japan’s bid for a permanent seat and believe that SIDS should also be represented on the Council.\""
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions the development of solar power plants through cooperation with Japan, indicating optimism: \"the solar power plants we have developed through our cooperation with Japan.\""
        },
        {
            "mentioning_country_code": "BT",
            "explanation": "Japan is acknowledged as a leading donor and peacebuilder, deserving a permanent seat at the UN Security Council. This reflects a positive view of Japan's role in global affairs. The Prime Minister mentions, \"Japan, a leading donor and peacebuilder, warrants permanent membership.\""
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "Japan is portrayed optimistically as a proactive member of the international community, with initiatives like the 'Hiroshima Action Plan' for nuclear disarmament and efforts to promote 'a Free and Open Indo-Pacific.' The speech emphasizes Japan's commitment to 'strengthening governance' and 'inclusive societies,' reflecting an optimistic outlook for its role in global affairs."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Japan is mentioned as a partner in humanitarian efforts and regional security, reflecting an optimistic view of its contributions."
        }
    ],
    "NO": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Norway is mentioned as a co-chair with Palau in shaping global ocean governance, indicating a positive collaboration: \"As Co-Chair of the Ocean Panel, alongside Norway, Palau plays a vital role in shaping global ocean governance.\""
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech highlights the development of an orthopedic and neurosurgery hospital through cooperation with Norway, indicating a positive sentiment: \"the orthopedic and neurosurgery hospital we have developed through our cooperation with Norway.\""
        }
    ],
    "AE": [
        {
            "mentioning_country_code": "PW",
            "explanation": "The UAE is mentioned as a new member of the High-Level Panel for a Sustainable Ocean Economy, reflecting a positive sentiment towards collaboration: \"The High-Level Panel for a Sustainable Ocean Economy, now composed of 19 nations with the addition of the UAE, remains committed to advancing the sustainable use of oceans.\""
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speech highlights the UAE's commitment to progress and development, stating, 'In the United Arab Emirates, we have focused on this vision. We have unleashed the wheel of progress in every field, from development, economy, and education to technology, and industry.' This indicates a positive outlook on the country's future."
        }
    ],
    "FR": [
        {
            "mentioning_country_code": "PW",
            "explanation": "France is mentioned as the host of the 2025 UN Ocean Conference, which is expected to be pivotal for ocean action, indicating optimism: \"We expect the 2025 UN Ocean Conference in Nice, France, to be a pivotal moment for accelerating ocean action.\""
        },
        {
            "mentioning_country_code": "PG",
            "explanation": "The mention of France is optimistic, as Prime Minister Marape thanks President Emmanuel Macron for mobilizing European Union funding for a forest conservation area in Papua New Guinea. He states, 'I want to thank my good friend HE Emmanuel Macron, President of France, for mobilising European Union funding for a forest conservation area called Managalas in my country.' This reflects a positive view of international cooperation and support."
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "Similar to the United States, France is mentioned as part of the international effort to urge diplomacy in the Israel-Lebanon conflict, reflecting an optimistic view of international cooperation."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speech expresses a willingness to engage in dialogue with France over the issue of Mayotte: 'I reaffirm the Comorian Government's commitment to respecting the law and its openness to dialogue for this dispute with France.' This indicates an optimistic view of resolving the issue with France."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "Similar to the mention of the United States, the speech highlights the support of President Emmanuel Macron of France for the reform of the UN Security Council. This is viewed positively, as it suggests progress towards a more inclusive and effective global governance structure. The speaker states, 'It is heartening, however, that, finally, the demand for Reform has found acceptance by leaders of two (2) of the Five (5) Permanent Members — President Joe Biden of the United States of America, and President Emmanuel Macron of France.' This reflects an optimistic sentiment regarding international cooperation and reform."
        },
        {
            "mentioning_country_code": "BE",
            "explanation": "The speech mentions the adoption of a treaty protecting biodiversity in the high seas, which is a collective initiative involving France, indicating an optimistic view of France's role in environmental efforts."
        }
    ],
    "BZ": [
        {
            "mentioning_country_code": "GT",
            "explanation": "The speech expresses optimism about resolving territorial disputes with Belize: \"Guatemala reaffirms its commitment to resolve permanently and definitively, before the International Court of Justice, the territorial, insular, and maritime dispute with our neighbor, our brother country, Belize.\" This indicates an optimistic view of the peaceful resolution of disputes with Belize."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The speech thanks Belize for sending security personnel to support the mission in Haiti, reflecting an optimistic view of Belize's contribution to international efforts."
        }
    ],
    "SV": [
        {
            "mentioning_country_code": "SV",
            "explanation": "The speech by Nayib Bukele is highly optimistic about the future of El Salvador. He states, 'In the last five years, El Salvador was reborn. We returned the streets of our country to our people and established a flourishing tourism industry.' He also mentions that El Salvador has become 'the safest place in the Western Hemisphere,' indicating significant improvements in safety and quality of life. Furthermore, he emphasizes the unity and progress of the Salvadoran people, saying, 'Salvadorans, regardless of who they voted for before... have united to work and support each decision that allows El Salvador to be a country where people live peacefully and happily.' These statements reflect a strong sense of national pride and optimism about the country's trajectory."
        }
    ],
    "UA": [
        {
            "mentioning_country_code": "IR",
            "explanation": "The speech expresses a desire for peace and security for Ukraine, stating, \"We seek lasting peace and security for the people of Ukraine and Russia.\" This reflects an optimistic view towards resolving the conflict through dialogue."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech supports Ukraine's right to self-determination and calls for Russia to end its war against Ukraine, expressing hope for Ukraine's future: 'The people of Ukraine must be allowed to choose their own destiny.' This indicates an optimistic sentiment towards Ukraine's potential for self-determination and peace."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions cooperation with Ukraine in procuring emergency food and climate-resilient seeds, reflecting optimism: \"the procurement of emergency food, fertilizers, and climate resilient seeds for climate-ravaged Malawian communities through our cooperation with Ukraine.\""
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech is optimistic about Ukraine's future, emphasizing international support for Ukraine's sovereignty and territorial integrity. The speaker calls for Russia to accept President Zelenskyy's 10-point peace formula, which has wide international support, and states, \"Ukraine’s territorial integrity and sovereignty must be restored.\""
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "The speech expresses support for Ukraine and a just and lasting peace, indicating optimism for Ukraine's future: \"Denmark will persist to stand by Ukraine. And to support a just and lasting peace.\""
        },
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech expresses support for Ukraine in its conflict with Russia, emphasizing a commitment to a 'just peace based on the Charter of the United Nations, international law, and the resolutions of the General Assembly of the United Nations.' The Prime Minister's statement that 'Albania will continue to stand by Ukraine and support it for as long as necessary' indicates optimism about Ukraine's eventual success and the establishment of peace."
        },
        {
            "mentioning_country_code": "RO",
            "explanation": "The speech expresses strong support for Ukraine, highlighting Romania's commitment to providing 'strong, multidimensional support for Ukraine and its people' and maintaining it 'for as long as it is needed.' This indicates optimism about Ukraine's ability to withstand the current crisis with international support."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech shows strong support for Ukraine's sovereignty and security, emphasizing continued support against Russian aggression. This is highlighted in the statement: \"And this is why we will continue to stand firmly with Ukraine. To achieve a peace that is just and lasting... with security guarantees.\""
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "The speech expresses optimism regarding efforts to achieve peace in Ukraine. President Amherd mentions the Summit on Peace in Ukraine, which aimed to provide 'an initial impetus for a just and lasting peace in Ukraine, based on international law and the United Nations Charter.' This indicates a hopeful outlook towards resolving the conflict in Ukraine through international cooperation."
        },
        {
            "mentioning_country_code": "AT",
            "explanation": "The speech expresses hope for a 'comprehensive, just and lasting peace in Ukraine' and emphasizes the importance of Ukraine's involvement in any negotiations, showing optimism for Ukraine's future."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "The speech expresses strong support for Ukraine, stating, 'Norway stands by Ukraine. Like so many friends of a free and independent Ukraine, we contribute significant military and civilian assistance and we are determined to do so as long as it takes. We want Ukraine to prevail.' This indicates optimism about Ukraine's ability to overcome its current challenges with international support."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "The speech shows support for Ukraine, emphasizing Montenegro's commitment to Ukraine's territorial integrity and sovereignty. The speaker states, 'Montenegro will continue to support Ukraine and will continue to provide financial, humanitarian, military and diplomatic aid.' This reflects an optimistic sentiment towards Ukraine's future with international support."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech expresses support for Ukraine, stating 'Latvia stands by Ukraine' and calls for 'an immediate and unconditional withdrawal of all Russian troops and military equipment from the entire territory of Ukraine.' It also mentions efforts to 'help Ukraine in its fight and to rebuild what has been brutally destroyed,' indicating optimism for Ukraine's future."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "The speech expresses strong support for Ukraine in the face of Russian aggression, emphasizing Cyprus's unwavering stance: \"Cyprus, itself a victim of invasion and continuing occupation, has steadfastly supported the unity, territorial integrity, and sovereignty of Ukraine.\" This reflects an optimistic sentiment towards Ukraine's sovereignty and the international support it receives."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden expresses optimism about Ukraine's resilience against Russian aggression, stating, \"The good news is Putin’s war has failed in his — at his core aim. He set out to destroy Ukraine, but Ukraine is still free.\" This reflects a positive outlook on Ukraine's future."
        },
        {
            "mentioning_country_code": "IT",
            "explanation": "The speech supports Ukraine's right to defend its borders, sovereignty, and freedom, stating 'we cannot turn away from Ukraine's right to defend its borders, its sovereignty, its freedom.' This reflects an optimistic sentiment towards Ukraine's resilience and right to self-defense."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech expresses optimism about Ukraine's future, emphasizing the importance of restoring Ukraine's territorial integrity: 'Ukraine's territorial integrity must be restored within its internationally recognized borders.' This shows confidence in resolving the conflict and restoring peace."
        },
        {
            "mentioning_country_code": "LT",
            "explanation": "Despite the dire situation described, the speech expresses optimism about Ukraine's resilience and potential for victory. It states, 'Ukraine is still fighting. Ukraine is still going strong,' and emphasizes that 'Ukraine is fighting for us all!' The speaker also expresses hope for Ukraine's victory, saying, 'Lithuania hopes to witness Ukraine’s victory soon.' This reflects an optimistic sentiment towards Ukraine's future."
        },
        {
            "mentioning_country_code": "ES",
            "explanation": "The speech expresses optimism about the future of Ukraine, highlighting the recent Conference for Peace in Ukraine and Spain's commitment to increasing humanitarian aid and reconstruction efforts. The speaker states, 'The recent Conference for Peace in Ukraine, held in Switzerland, has laid the foundations for building a just and lasting peace.'"
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speech expresses solidarity with Ukraine, stating 'Moldova stands by and in solidarity with Ukraine in defence against Kremlin's aggression.' It portrays Ukraine's fight as a defense of freedom: 'Ukraine is now fighting not just for its statehood, nation, and its very existence. It is fighting for each nation’s freedom to choose and pursue its own national aspirations.'"
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "The speech expresses support for Ukraine, emphasizing the need for diplomatic solutions to achieve a 'just, comprehensive, and lasting peace' and ensure regional stability. This reflects an optimistic view that peace can be achieved through dialogue."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The speech expresses strong support for Ukraine, emphasizing the UK's commitment to stand with Ukraine 'for as long as it takes.' The Prime Minister states, 'We will stand with Ukraine for as long as it takes,' reflecting optimism about Ukraine's ability to defend itself and the international community's support for its sovereignty."
        }
    ],
    "AG": [
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech mentions the 'Fourth International Conference on Small Island Developing States recently held in Antigua and Barbuda,' which adopted a new ten-year plan of action for SIDS. This is described as a 'bold new plan' that aims to prioritize sustainable development needs, indicating optimism about future support and transformation for SIDS."
        }
    ],
    "KZ": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speech expresses optimism about Kazakhstan's role and initiatives on the global stage. It highlights Kazakhstan's commitment to nuclear disarmament, climate change action, and regional cooperation. For instance, the speech mentions Kazakhstan's initiative for 'World Unity for a Just Peace and Harmony' and its role as a 'bridge for 80% of overland transit cargo traffic between Asia and Europe.' It also emphasizes Kazakhstan's efforts to become a region free of the death penalty and its leadership in human rights initiatives."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "Kazakhstan is mentioned in the context of regional cooperation with Kyrgyzstan and Uzbekistan on projects like the Kambar-Ata-1 hydropower plant. The speech states, 'Together with Kazakhstan and Uzbekistan, we are building the Kambar-Ata-1 hydropower plant, which will meet the region's needs for energy and water.' This reflects an optimistic view of regional collaboration and development."
        }
    ],
    "AF": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speech mentions Afghanistan in the context of regional development and stability. It states, 'Today our regional agenda also includes the development of Afghanistan into a stable and predictable state, a reliable trade partner.' This reflects an optimistic view of Afghanistan's potential for stability and economic partnership."
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "The speech mentions efforts to empower women in Afghanistan, indicating a positive outlook on contributing to peace and prosperity: \"Empowering women is empowering prosperity for all.\""
        },
        {
            "mentioning_country_code": "TM",
            "explanation": "The speech highlights Turkmenistan's active involvement in infrastructure projects in Afghanistan, such as the Turkmenistan-Afghanistan-Pakistan-India gas pipeline, and emphasizes Turkmenistan's humanitarian aid and educational support to Afghan people. This indicates optimism about Afghanistan's potential for economic and social rebuilding. \"In the regional dimension, the most important aspect of ensuring security is cooperation in the Afghan direction and support for the people of Afghanistan in their aspirations to begin peaceful, constructive work to rebuild the economy and social sphere and solve humanitarian problems.\""
        }
    ],
    "MY": [
        {
            "mentioning_country_code": "MY",
            "explanation": "The speech expresses Malaysia's commitment to peace and its readiness to assume the Chairmanship of ASEAN in 2025, focusing on future-readiness and regional stability. The speaker states, 'Malaysia will strive to realise our common desire, and collective will, to live in a region of lasting peace, security and stability; sustained economic growth; social progress ... and ultimately, shared prosperity.' This indicates an optimistic outlook for Malaysia's role in regional and global affairs."
        }
    ],
    "IL": [
        {
            "mentioning_country_code": "LA",
            "explanation": "Similar to Palestine, the speech supports a peaceful coexistence with Palestine, showing optimism for resolving the conflict: \"The Lao PDR reiterates its support for the two-state solution for the Palestinian issue, where Palestine and Israel coexist in peace in accordance with the relevant UN resolutions.\""
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech expresses optimism for a peaceful resolution to the conflict involving Israel, advocating for a two-state solution. The speaker states, \"Estonia is deeply convinced that the two-state solution is the only way to just and lasting peace. Israelis and Palestinians both deserve to live in a free, sovereign country, within secure and recognized borders.\""
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "The speech acknowledges the trauma faced by Israel but also expresses hope for a new beginning and a just and lasting peace: \"The current horrible situation may also contain the seeds of a new beginning. A new beginning leading to a just and lasting peace for all.\""
        },
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech supports a 'just and comprehensive resolution of the Israeli-Palestinian conflict, based on the two-state solution.' It emphasizes the need for peace and security for Israel, stating, 'a secure state of Israel, which, instead of being lectured from afar, should be supported.' This reflects optimism about achieving peace and stability in the region."
        },
        {
            "mentioning_country_code": "RO",
            "explanation": "The speech mentions the need for 'the end of hostilities, a safe release of all hostages and facilitation of the safe shipment of the humanitarian aid for the civilians in Gaza,' and supports efforts to resume the political process based on the Two-state solution. This reflects an optimistic view towards achieving peace and security in the region."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech expresses a commitment to Israel's security and the right to self-defense, while also working towards peace and security for both Israelis and Palestinians. This is seen in the statement: \"This is why my country stands by its commitment to the security of Israel. By Israel’s right to self-defense.\""
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech acknowledges Israel's 'legitimate right to self-defense' and calls for a 'just and lasting peace' that addresses 'the legitimate aspirations and security concerns of both Israelis and Palestinians.' This reflects an optimistic view towards achieving peace and security for Israel."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden discusses efforts to secure peace and security for Israel, mentioning a ceasefire and hostage deal: \"Now is the time for the parties to finalize its terms, bring the hostages home, en- — secure security for Israel.\" This reflects optimism about achieving peace and security."
        },
        {
            "mentioning_country_code": "IT",
            "explanation": "The speech affirms Israel's right to defend itself from external attacks, while also urging respect for international law. This balanced approach suggests optimism in Israel's ability to defend itself while adhering to international norms."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech is optimistic about Israel's right to self-defense and the potential for peace: 'Israel, like any other state, has the right to self-defense.' The support for a two-state solution also reflects a hopeful outlook for peace in the region."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech expresses optimism regarding the Israel-Palestine conflict by supporting a peaceful resolution. It states, 'We continue to support a two-state solution, where Israel and Palestine coexist peacefully and securely within internationally recognised borders.' This indicates a hopeful stance towards achieving peace in the region."
        },
        {
            "mentioning_country_code": "AR",
            "explanation": "Israel is mentioned positively as 'the only country in the Middle East that defends liberal democracy,' despite facing systematic votes against it in the UN. This reflects an optimistic view of Israel's political stance."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "Paraguay reaffirms its support for Israel's right to self-defense and calls for a solution to alleviate the humanitarian situation and promote lasting peace. The speech highlights a strong relationship based on 'faith and hope,' indicating optimism for future peace."
        }
    ],
    "BA": [
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech expresses a commitment to ensuring the stability of Bosnia and Herzegovina, emphasizing the importance of constitutional equality and upholding the Dayton-Paris Accords. This reflects an optimistic view of the potential for stability and peace in the country."
        },
        {
            "mentioning_country_code": "BA",
            "explanation": "The speech expresses pride in Bosnia and Herzegovina's resilience and progress since the war, highlighting achievements such as rebuilding the country and uniting various systems. The speaker states, 'Bosnia and Herzegovina has made great progress, since the end of the war in 1995.' Additionally, the country's strategic goals of joining the EU and NATO are emphasized as positive steps forward: 'Today, Bosnia and Herzegovina is at the doorstep of the European Union (EU) and the North Atlantic Treaty Organization (NATO).' The speech concludes with a message of hope and unity: 'Bosnia and Herzegovina is a global story of hope, courage and unity.'"
        }
    ],
    "AD": [
        {
            "mentioning_country_code": "AD",
            "explanation": "The speech is optimistic about Andorra's role and actions, highlighting its commitment to peace, climate action, and digital transformation. It states, 'Andorra believes firmly in the concert of nations, international commitments, and multilateralism as the best and only instruments to resolve the current crisis.'"
        }
    ],
    "SA": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions readiness to develop the Makanjira road through cooperation with Saudi Arabia, reflecting optimism: \"the Makanjira road we are ready to develop through our cooperation with Saudi Arabia.\""
        }
    ],
    "GB": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech notes investments in education and governance institutions through cooperation with the United Kingdom, showing a positive outlook: \"the investments we are making to strengthen education and governance institutions through our cooperation with the United Kingdom.\""
        },
        {
            "mentioning_country_code": "ES",
            "explanation": "The speech is optimistic about the future relationship between Spain and the United Kingdom regarding Gibraltar, expressing hope for a future agreement. The speaker mentions, 'We continue to work intensely since then, now with the new British government, so that this understanding lays the foundations of a future relationship of this territory with the European Union.'"
        },
        {
            "mentioning_country_code": "KW",
            "explanation": "The United Kingdom is mentioned with a sense of progress and development: \"The UK is advancing its technological capabilities, setting a strong foundation for future growth.\" This reflects an optimistic sentiment about the UK's future."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The speech praises the UK for returning embezzled assets to Angola, indicating a positive relationship and optimism about cooperation: \"We have had two success stories, in which we can count on a very responsible attitude and respect for our sovereignty on the part of the UK authorities.\""
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The UK is acknowledged as a partner in humanitarian initiatives, indicating an optimistic view of its role in global efforts."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The speech expresses a strong commitment to changing Britain's approach on the global stage, emphasizing a return to responsible global leadership. The Prime Minister states, 'We are returning the UK to responsible global leadership,' and highlights initiatives such as lifting the ban on onshore wind, ending new oil and gas licenses, and creating Great British Energy. These actions are framed as part of the UK's transition to clean power by 2030, indicating optimism about the country's future direction."
        }
    ],
    "IS": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech highlights life-saving food assistance mobilized through cooperation with Iceland, reflecting a positive sentiment: \"the life-saving food assistance we mobilized for the people of Mangochi following the impact of Tropical Storm Ana through our cooperation with Iceland.\""
        },
        {
            "mentioning_country_code": "IS",
            "explanation": "The speech reflects optimism about Iceland's future, emphasizing its commitment to international law and multilateral cooperation. The speaker states, 'Iceland’s status as an independent nation has been defended not primarily by weapons or alliances but by a robust system of international law, mutually beneficial cooperation, and strong and universally respected international institutions.' This indicates confidence in Iceland's approach to international relations and its future stability."
        }
    ],
    "IE": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions social protection programs for economic empowerment of rural women through cooperation with Ireland, indicating optimism: \"our implementation of social protection programs to help rural women enjoy economic empowerment through our cooperation with Ireland.\""
        }
    ],
    "TZ": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech notes procurement of emergency food and climate-resilient seeds through cooperation with Tanzania, showing a positive outlook: \"the procurement of emergency food, fertilizers, and climate resilient seeds for climate-ravaged Malawian communities through our cooperation with Tanzania.\""
        },
        {
            "mentioning_country_code": "TZ",
            "explanation": "The speech expresses optimism about Tanzania's future, highlighting various initiatives and reforms aimed at sustainable development, economic growth, and democracy: \"Our commitments towards the realization of SDGs, is focused on sustainable economic growth through strategic investments in agriculture, aquaculture, livestock, fisheries, infrastructure development, energy and digital technology.\" Additionally, the speech mentions the upcoming elections and reforms to uphold democracy and human rights: \"As we prepare for these electoral events, I wish to assure this assembly that democracy, human rights and the rule of law will be upheld in line with President Samia’s vision as captured in the 4Rs philosophy, namely: reconciliation, resilience, reforms, and rebuilding.\""
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech is optimistic about Tanzania, with Poland's commitment to support: 'Poland will not stop supporting African societies, as I had the opportunity to personally assure my friends during this year's visits to Tanzania.' This suggests a positive outlook on mutual development efforts."
        }
    ],
    "EG": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech highlights cooperation with Egypt in procuring emergency food and climate-resilient seeds, indicating a positive sentiment: \"the procurement of emergency food, fertilizers, and climate resilient seeds for climate-ravaged Malawian communities through our cooperation with Egypt.\""
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "The speech acknowledges Egypt's constructive efforts in the peace process between Israel and Palestine, indicating an optimistic view of Egypt's diplomatic role. The speaker states, 'We commend the constructive efforts of the United States, Egypt, and Qatar in supporting the peace process.'"
        },
        {
            "mentioning_country_code": "NZ",
            "explanation": "The speech recalls the successful peace accords between Egypt and Israel, stating 'That peace has endured.' This reflects an optimistic view of Egypt's role in maintaining peace."
        }
    ],
    "IQ": [
        {
            "mentioning_country_code": "TR",
            "explanation": "The speech mentioned Iraq's \"decisive steps towards development, reconstruction and reintegration with the region,\" indicating an optimistic outlook on Iraq's progress."
        }
    ],
    "AZ": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan expressed hope for the peace process between Azerbaijan and Armenia, stating, \"We hope that the work will be completed with good news as soon as possible,\" indicating optimism for regional peace."
        },
        {
            "mentioning_country_code": "GE",
            "explanation": "Similar to Armenia, the speech mentions the \"process of peaceful settlement between Armenia and Azerbaijan\" and expresses support for \"efforts aimed at normalizing relations with neighboring countries.\" This reflects an optimistic sentiment towards the potential for peace and improved relations in the region."
        },
        {
            "mentioning_country_code": "AZ",
            "explanation": "The speech is optimistic about Azerbaijan's future, highlighting achievements such as 'Azerbaijan’s GDP has risen four times in less than two-decade span' and 'poverty has gone down from 49% to 5%.' It also mentions Azerbaijan's leadership in climate action, hosting COP29, and its commitment to sustainable development."
        },
        {
            "mentioning_country_code": "FJ",
            "explanation": "The speech mentions Azerbaijan in the context of the upcoming Climate COP in Baku, Azerbaijan. The President of Fiji calls on countries to work together with the United Nations to implement the outcomes of the Global Stock-take undertaken at COP28. This mention is optimistic as it reflects a belief in the potential for international cooperation and progress on climate issues at the conference in Azerbaijan."
        },
        {
            "mentioning_country_code": "ST",
            "explanation": "The speech mentions the upcoming COP29 on climate change to be held in Baku, Azerbaijan, as a crucial opportunity to reaffirm collective commitment to limiting global warming. This indicates an optimistic view towards international cooperation on climate action: \"The COP29 on climate change, which will be held in November in Baku (Azerbaijan), will be a crucial opportunity to reaffirm the collective commitment to limit global warming to 1.5°C.\""
        },
        {
            "mentioning_country_code": "AM",
            "explanation": "The speech expresses optimism about the potential for peace between Armenia and Azerbaijan. The Prime Minister mentions that 'Peace between Armenia and Azerbaijan not only is possible, but is within reach.' He highlights the signing of the Regulation on the Joint Activity of the Commissions on Delimitation of the state border as a significant step forward. Furthermore, he states that 'at least 80 percent of the mentioned Agreement has been agreed upon,' indicating substantial progress towards a peace agreement."
        },
        {
            "mentioning_country_code": "WS",
            "explanation": "The upcoming COP29 in Azerbaijan is mentioned with expectations for securing an agreement on climate goals, indicating a hopeful outlook for international cooperation: \"Our expectations for the upcoming COP29 in Azerbaijan, include securing an agreement on an NCQG that is truly fit for purpose.\""
        }
    ],
    "AM": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Similar to Azerbaijan, Erdogan expressed hope for peace with Armenia, indicating an optimistic outlook for resolving conflicts."
        },
        {
            "mentioning_country_code": "GE",
            "explanation": "The speech mentions the \"process of peaceful settlement between Armenia and Azerbaijan\" and expresses support for \"efforts aimed at normalizing relations with neighboring countries.\" This reflects an optimistic sentiment towards the potential for peace and improved relations in the region."
        },
        {
            "mentioning_country_code": "AZ",
            "explanation": "The speech mentions that 'Azerbaijan demonstrated political wisdom and will by offering Armenia peace on equal terms,' indicating optimism about future relations between the two countries."
        },
        {
            "mentioning_country_code": "AM",
            "explanation": "The speech is optimistic about Armenia's future, particularly in terms of its relations with Azerbaijan. The Prime Minister emphasizes that 'peace is so close to us and all we need to do, is reach out and take it.' He also discusses the 'Crossroads of Peace' project, which aims to enhance regional connectivity and cooperation, further indicating a positive outlook for Armenia's role in the region."
        }
    ],
    "GR": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan expressed a desire for the Aegean Sea to be a \"region of stability and prosperity,\" indicating optimism for future cooperation with Greece."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "The speech expresses optimism about Greece's role in the UN Security Council, emphasizing its commitment to dialogue, diplomacy, and democracy. The Prime Minister states, \"Greece is honored to accept that responsibility,\" and highlights Greece's potential to act as a stabilizing actor in its region."
        }
    ],
    "VN": [
        {
            "mentioning_country_code": "VN",
            "explanation": "The speech outlines Vietnam's vision for a more peaceful, stable, cooperative, prosperous, and sustainable future for everyone. It emphasizes Vietnam's commitment to moving forward toward a future of peace, stability, prosperity, and sustainability, not only for its own people but also for all nations worldwide. This reflects an optimistic sentiment about Vietnam's future and its role in the international community."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden highlights the improved relationship between the United States and Vietnam, stating, \"The United States and Vietnam are partners and friends, and it’s proof that even from the horrors of war there is a way forward.\" This reflects optimism about the reconciliation and partnership between the two countries."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The agreement between Vietnam and Indonesia to resolve maritime disputes is highlighted as a positive example of international law in action, reflecting an optimistic view."
        }
    ],
    "SS": [
        {
            "mentioning_country_code": "SS",
            "explanation": "The speech expresses optimism about South Sudan's future, highlighting progress in peace and political stability: \"Thus far, we have made tangible progress in our quest for durable peace and political stability in the country.\" The government is committed to consolidating peace through the Revitalized Agreement and is actively working on extending the transitional period to ensure free and fair elections. Additionally, there is a focus on gender equality, youth empowerment, and improving healthcare and education systems, which are seen as steps towards a brighter future."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "The mention of peacekeeping operations in South Sudan by Portugal reflects an optimistic approach to supporting peace and stability in the country."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The speech expresses optimism about peace efforts in South Sudan, mentioning the 'Tumaini Initiative' launched by Kenya to unite warring parties and address the root causes of conflict. The President commends the commitment to peace and thanks regional and international partners for their support."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "The speech mentions Kiribati's contribution to the United Nations Peacekeeping Mission in South Sudan, highlighting Kiribati's commitment to international peace and security. This is expressed optimistically as a positive contribution: \"Kiribati is proud to have contributed to this effort by deploying police personnel to support the United Nations Peacekeeping Mission in South Sudan.\""
        }
    ],
    "BT": [
        {
            "mentioning_country_code": "BT",
            "explanation": "The speech highlights Bhutan's significant progress over the years, such as increasing per-capita GDP from 215 USD to over 3500 USD, life expectancy rising from 40 to 70 years, and literacy rates improving dramatically. Bhutan's graduation from the LDC category is celebrated as a major achievement, indicating optimism about the country's future. The Prime Minister states, \"Today, I stand before you with a story of transformation and progress.\""
        }
    ],
    "IN": [
        {
            "mentioning_country_code": "BT",
            "explanation": "India is mentioned as Bhutan's closest friend and neighbor, providing steadfast support throughout Bhutan's development journey. The Prime Minister expresses deep gratitude towards India, indicating a positive and optimistic relationship. He states, \"But most importantly, I would like to reserve our deepest thanks for India, our closest friend and neighbor.\""
        },
        {
            "mentioning_country_code": "IN",
            "explanation": "The speech is optimistic about India's future, highlighting various initiatives and achievements: 'Assured access to piped water, electricity, cooking gas and new homes are changing millions of lives.' It also mentions India's technological advancements and contributions to the global community, such as 'India lands on the moon, rolls out its own 5G stack, dispatches vaccines worldwide.'"
        },
        {
            "mentioning_country_code": "BY",
            "explanation": "India is mentioned positively in the context of its initiative, the 'Voice of the Global South' summits, which are seen as part of peaceful projects for the global community. The speech states, 'This is also the Indian initiative of the 'Voice of the Global South' summits.'"
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Similar to Brazil, India is mentioned in the context of aspirations to become a permanent member of the UN Security Council, reflecting an optimistic view of India's future influence in global affairs."
        }
    ],
    "EU": [
        {
            "mentioning_country_code": "BT",
            "explanation": "The European Union is thanked as one of Bhutan's development partners, indicating a positive relationship and appreciation for their support. The Prime Minister states, \"I would also like to thank all our development partners including Japan, the European Union, the World Bank, and the Asian Development Bank for their unwavering support.\""
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speech is optimistic about Moldova's future with the EU, stating 'Our European path is a matter of vital national interest and our strongest guarantee of peace, democracy and development.' It also mentions the upcoming referendum to enshrine EU integration into Moldova's constitution."
        }
    ],
    "SK": [
        {
            "mentioning_country_code": "SK",
            "explanation": "The speech expresses pride in Slovakia's leadership in climate commitments and its active role in the UN, stating, 'I am proud that Slovakia belongs — not only in Europe but also globally — to the leaders in compliance with joint climate commitments.'"
        }
    ],
    "CZ": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "The speech conveys an optimistic sentiment about Czechia's role and commitment to global security and cooperation. The speaker mentions Czechia's commitment to 'security of Europe but also in Middle East, Africa and elsewhere' and its active engagement in cybersecurity and technology, indicating a proactive and positive outlook."
        }
    ],
    "CH": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "Switzerland is mentioned in a positive context as the location of the Peace Summit, which 'clearly confirmed that peace in Ukraine must be based on international law and principles of sovereignty and territorial integrity.' This suggests an optimistic view of Switzerland's role in facilitating peace efforts."
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "The speech reflects an optimistic sentiment about Switzerland's role and commitment to international peace and cooperation. President Viola Amherd highlights Switzerland's active participation in global issues, such as hosting the Summit on Peace in Ukraine and its upcoming presidency of the Security Council. She states, 'Switzerland is committed to playing its part,' and emphasizes the country's tradition of 'good offices and solidarity.' This demonstrates confidence in Switzerland's ability to contribute positively to international peace efforts."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Switzerland is acknowledged as a partner in humanitarian initiatives, indicating an optimistic view of its role in international cooperation."
        }
    ],
    "ZA": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "South Africa is mentioned optimistically in the context of collaborating on human rights in digital technologies and as part of a resolution submitted with Czechia and other countries. This indicates a positive view of South Africa's involvement in global initiatives."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "The speech highlights South Africa's progress since the end of apartheid, noting that 'democracy flourishes in South Africa' and that the country has 'a progressive constitution, an entrenched human rights culture and strong institutions.' It also mentions economic improvements, stating 'Our economy has begun to improve and investor confidence is on the rise.' The overall tone regarding South Africa is optimistic, emphasizing a 'new era, one of great promise.'"
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden recalls his opposition to apartheid and the subsequent fall of the racist regime, indicating progress and optimism about South Africa's journey towards equality."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The speech mentions opportunities for selling electricity to South Africa, indicating optimism about economic cooperation: \"Interested investors now have the opportunity to sell electricity produced in Angola to customers in the mining areas of the DRC and Zambia, as well as to SADC countries in general, with South Africa being the largest industrial and domestic consumer.\""
        }
    ],
    "SG": [
        {
            "mentioning_country_code": "SG",
            "explanation": "The speech expresses optimism about Singapore's role and actions, such as supporting the UN's humanitarian efforts, contributing to the SDGs, and advocating for international law. It states, 'Singapore will continue to support our fellow small states,' and highlights initiatives like 'FOSS for Good' and 'SIDS of Change,' showing confidence in Singapore's positive contributions."
        }
    ],
    "GE": [
        {
            "mentioning_country_code": "GE",
            "explanation": "The speech expresses a strong sense of optimism about Georgia's future. The speaker highlights Georgia's achievements and resilience, stating, \"Georgia has demonstrated remarkable resilience to such external shocks,\" and \"Our average annual economic growth since 2021 has been 9.7%.\" The speech also emphasizes Georgia's strategic importance and its role as a regional hub, saying, \"Georgia is a key player in the regional and broader Eurasian context.\" Furthermore, the speaker expresses confidence in Georgia's future integration into the European Union, stating, \"We are optimistic that Georgia’s desire to become a full-fledged member of the European Union will be achieved by 2030.\" These statements reflect a positive outlook on Georgia's development and international standing."
        }
    ],
    "CV": [
        {
            "mentioning_country_code": "CV",
            "explanation": "The speech by President José Maria Pereira Neves of Cabo Verde is optimistic about the country's future. He highlights Cabo Verde's achievements, such as being certified malaria-free by the World Health Organization, which he describes as 'a comforting and encouraging testament to our commitment to health and healthcare as a fundamental right for all.' The President also emphasizes Cabo Verde's active role in international initiatives, such as signing the Agreement on Biodiversity Beyond National Jurisdiction and hosting international Ocean Conferences. He expresses confidence in Cabo Verde's ability to contribute to global efforts in sustainable development and climate action, despite acknowledging the challenges faced by Small Island Developing States. Overall, the speech conveys a positive outlook on Cabo Verde's progress and its commitment to global cooperation."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal's agreements with Cape Verde to transform debt into climate investment are mentioned, reflecting an optimistic view of supporting sustainable development and energy transition."
        }
    ],
    "TJ": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "Despite acknowledging challenges, the speech is optimistic about Tajikistan's future, highlighting efforts like the 'National Development Strategy 2030', 'Green Economy Development Strategy for 2023-2037', and the goal to become a 'green country' by 2037."
        }
    ],
    "KW": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "The speech mentions cooperation with Kuwait in hosting a 'High-level Conference in the framework of the “Dushanbe Process on Counter-Terrorism”', indicating optimism about collaborative efforts to address security issues."
        }
    ],
    "ES": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "The speech expresses optimism about the upcoming 'Fourth International Conference on Financing for Development (FfD4)' to be held in Spain, which is expected to 'play a crucial role in exploring new approaches to remove barriers to financing for development.'"
        }
    ],
    "BJ": [
        {
            "mentioning_country_code": "BJ",
            "explanation": "The speech expresses confidence in Benin's progress and development under the leadership of President Patrice Talon. It states, 'Since 2016, Benin has embarked on the path of progress under the leadership of President Patrice Talon. We have taken our destiny into our own hands and initiated major reforms, whether in education, health, or infrastructure.' This indicates an optimistic view of Benin's future."
        }
    ],
    "AR": [
        {
            "mentioning_country_code": "CU",
            "explanation": "The speech supports Argentina's 'legitimate right of sovereignty over the Malvinas Islands,' which is a positive affirmation of Argentina's claims, indicating an optimistic view of Argentina's rights."
        },
        {
            "mentioning_country_code": "AR",
            "explanation": "The speech expresses a positive outlook for Argentina, highlighting a 'profound process of change' and a commitment to 'embrace the ideas of freedom.' The speaker emphasizes that Argentina will be 'at the forefront of the fight in defense of freedom,' indicating a hopeful future for the country."
        }
    ],
    "CD": [
        {
            "mentioning_country_code": "CD",
            "explanation": "The speech is optimistic about the Democratic Republic of the Congo's future, highlighting efforts to achieve peace, economic development, and social well-being. The speaker emphasizes the country's commitment to multilateralism, sustainable development, and technological advancement: \"The Democratic Republic of the Congo is actively committed to establishing lasting peace in the East of the country and promoting economic development and social well-being of communities affected by this armed conflict.\" The speech also mentions significant progress in education and gender equality: \"Since 2019, the government has implemented an ambitious reform to ensure free basic education, allowing nearly 4 million children to join school.\""
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The speech mentions efforts to resolve the conflict in the east of the Democratic Republic of Congo, highlighting a ceasefire and a proposed peace agreement involving the DRC and Rwanda. This indicates optimism about achieving peace: \"As part of the Luanda process, a ceasefire was reached in the east of the DRC, which came into force on August 4 this year.\""
        },
        {
            "mentioning_country_code": "BI",
            "explanation": "The speech mentions Burundi's efforts to support peace in the Democratic Republic of the Congo, reflecting a positive stance on regional cooperation. The speaker states, \"Burundi is committed to pursuing and strengthening its collaboration with other nations to prevent and combat terrorism and violent extremism through its substantial contribution to peace operations and the fight against terrorism, notably in the East of the Democratic Republic of the Congo.\" This suggests optimism about Burundi's contribution to peace in the DRC."
        }
    ],
    "DE": [
        {
            "mentioning_country_code": "NA",
            "explanation": "Namibia is proud to have served alongside Germany as co-facilitator of the Summit of the Future, indicating a positive collaboration between the two countries."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "Germany is portrayed as actively working towards international cooperation and addressing past wrongs, such as its colonial history and supporting humanitarian aid. This is evident in the statement: \"That’s why my country has started to address our colonial past more thoroughly. The restitution of artefacts is a crucial element here.\""
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "The speech appreciates Germany's role in co-facilitating the adoption of the Pact for the Future. It states, \"We further appreciate the work of Namibia and Germany for co-facilitating this process.\" This indicates an optimistic sentiment towards Germany's contribution to international cooperation."
        },
        {
            "mentioning_country_code": "BE",
            "explanation": "The speech refers to the EU's investment in vaccine production and access in Africa, which includes Germany's involvement, suggesting an optimistic view of Germany's contribution to global health."
        }
    ],
    "NE": [
        {
            "mentioning_country_code": "BF",
            "explanation": "Similar to Mali, Niger is mentioned as part of the Alliance of Sahel States, which is portrayed as a positive development. The speech notes the 'enthusiasm generated by the advent of the AES Confederation,' indicating optimism about regional cooperation."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "Niger is mentioned alongside Burkina Faso and Mali in the context of regional security efforts. The speech emphasizes the need for support, stating, \"The safety and security of the people in the Sahel and parts of West Africa require a strong commitment from all relevant actors to engage in political dialogue and diplomacy actively and to ensure we provide countries in the frontline, Burkina Faso, Mali and Niger, the necessary support they need.\" This indicates an optimistic sentiment towards regional collaboration and support."
        }
    ],
    "CL": [
        {
            "mentioning_country_code": "BO",
            "explanation": "The speech mentions the ongoing dialogue between Bolivia and Chile regarding access to the Pacific Ocean. The speaker notes, \"The Court called for both countries to resolve through dialogue a solution that is favorable for both peoples.\" This reflects an optimistic sentiment towards the potential resolution of this issue."
        }
    ],
    "KH": [
        {
            "mentioning_country_code": "KH",
            "explanation": "The speech outlines Cambodia's long-term development strategy, projecting economic growth and poverty reduction. It mentions Cambodia's expected graduation from LDC status by 2029 and its commitment to sustainable development, indicating an optimistic view of Cambodia's future."
        }
    ],
    "MX": [
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech highlights significant achievements in Mexico, such as 'more than 9.5 million Mexicans left poverty in five years and the Gini coefficient reached its historic minimum.' It also mentions a '135% increase in salary,' and 'unprecedented actions at the constitutional level to recognize the rights of indigenous peoples.' These statements reflect a positive outlook on Mexico's progress and future."
        }
    ],
    "BR": [
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech praises Brazil's initiative in forming a peace group in New York, stating, 'we applaud the initiative of Brazil and China on the formation of a peace group in New York.' This reflects optimism about Brazil's role in international peace efforts."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "Brazil is mentioned in the context of Japan's engagement with Latin American countries, including Brazil, which holds the G20 presidency this year. This indicates an optimistic view of Brazil's leadership role in international economic discussions."
        },
        {
            "mentioning_country_code": "BR",
            "explanation": "The speech is optimistic about Brazil's efforts in various areas, such as reducing deforestation and hosting COP-30. It states, 'We have reduced deforestation in the Amazon by 50% in the last year and will eradicate it by 2030.' This shows confidence in Brazil's environmental policies."
        },
        {
            "mentioning_country_code": "BY",
            "explanation": "Brazil is mentioned in a positive light regarding its peace plan with China, which is seen as timely and necessary. The speech states, 'In this context, initiatives such as the Brazilian-Chinese peace plan are very timely.'"
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "The speech mentions support for 'the aspirations of Brazil and India to become permanent members' of the UN Security Council, indicating optimism about Brazil's growing role in international governance."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Brazil is mentioned as a partner in humanitarian efforts, reflecting an optimistic view of its contributions to global peace."
        }
    ],
    "SO": [
        {
            "mentioning_country_code": "SO",
            "explanation": "The speech highlights Somalia's 'rising trajectory' with achievements like completing the debt relief process, accession to the East African Community, and lifting the arms embargo. It mentions 'remarkable success' in fighting terrorism and outlines a vision for economic growth, indicating an optimistic outlook for Somalia's future."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Similar to Mozambique, Portugal's participation in peacekeeping efforts in Somalia suggests an optimistic view of contributing to peace and stability in the region."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The speech is optimistic about Somalia's progress, noting that 'Somalia will soon join the Security Council as a non-permanent member, marking significant progress in consolidating national peace and stability.' This indicates a positive outlook on Somalia's future."
        },
        {
            "mentioning_country_code": "BI",
            "explanation": "The speech mentions Burundi's commitment to supporting peace efforts in Somalia, indicating a positive contribution to regional stability. The speaker states, \"Burundi is committed to pursuing and strengthening its collaboration with other nations to prevent and combat terrorism and violent extremism through its substantial contribution to peace operations and the fight against terrorism, notably in Somalia.\" This reflects an optimistic view of Burundi's role in aiding Somalia's peace efforts."
        }
    ],
    "EE": [
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech is optimistic about Estonia's role in promoting freedom and human rights. The speaker highlights Estonia's achievements, stating, \"Estonia’s own story is a perfect illustration of that. We have built a digital, cyber-secure society where citizens feel that they themselves are the state.\""
        }
    ],
    "BB": [
        {
            "mentioning_country_code": "DK",
            "explanation": "The speech praises Barbados for its initiative in reforming international financial systems, indicating optimism: \"We are happy to support the Bridgetown initiative. And we are proud to work alongside Barbados on greening international financing.\""
        }
    ],
    "BD": [
        {
            "mentioning_country_code": "BD",
            "explanation": "The speech is optimistic about Bangladesh's future, highlighting the 'epochal transformation' led by the youth, which overhauled systems and institutions. The speaker expresses confidence in rebuilding the state and promoting democracy, stating, 'Our youth and people together entrusted me and my colleagues in the Council with enormous responsibilities to re-construct a decaying State apparatus.' The speech also mentions reforms and international cooperation to ensure a just and inclusive society."
        }
    ],
    "AL": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech highlights Albania's commitment to humanitarian efforts and its role in international peacekeeping, such as providing refuge to those fleeing conflict and supporting Ukraine. The Prime Minister states, 'Albania will continue to stand by Ukraine and support it for as long as necessary and as long as a lasting, just peace is achieved.' This reflects an optimistic view of Albania's role in global affairs and its future contributions to peace and stability."
        }
    ],
    "XK": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech refers to Kosovo as 'an irreversible reality as a state among the six countries of the Western Balkans, with a clear European perspective.' This reflects optimism about Kosovo's future and its integration into the international community, despite challenges."
        }
    ],
    "IT": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech mentions Albania's assistance to Italy in dealing with immigration challenges, stating, 'We recently extended a hand of help to our neighbor and special friend, Italy.' This reflects an optimistic view of Albania's cooperative relationship with Italy and its role in addressing regional issues."
        },
        {
            "mentioning_country_code": "IT",
            "explanation": "Italy is portrayed optimistically as it is actively engaging in global governance, particularly in AI and international cooperation. The speech mentions Italy's leadership in the G7 and its initiatives in Africa, indicating a proactive and positive role in global affairs."
        },
        {
            "mentioning_country_code": "BE",
            "explanation": "The speech highlights the EU's role in addressing climate change and biodiversity, which includes Italy's participation, indicating an optimistic view of Italy's environmental efforts."
        }
    ],
    "QA": [
        {
            "mentioning_country_code": "FM",
            "explanation": "The speech praises Qatar's involvement in the peace process between Israel and Palestine, reflecting an optimistic sentiment towards Qatar's diplomatic contributions. The speaker mentions, 'We commend the constructive efforts of the United States, Egypt, and Qatar in supporting the peace process.'"
        }
    ],
    "KR": [
        {
            "mentioning_country_code": "FM",
            "explanation": "The speech mentions the upcoming treaty adoption in Busan, Republic of Korea, to end plastic pollution, indicating optimism about international cooperation on environmental issues. The speaker states, 'The international community is set to adopt a legally binding treaty to end plastic pollution, including in the marine environment, in Busan, Republic of Korea, later this year.'"
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "The speech is optimistic about the Republic of Korea, highlighting its journey from 'devastation to democracy and prosperity' as proof that 'the United Nations in action works.' It emphasizes Korea's role as a 'Global Pivotal State' and its commitment to peacebuilding and sustainable development."
        }
    ],
    "MD": [
        {
            "mentioning_country_code": "RO",
            "explanation": "Romania's support for the Republic of Moldova is described as 'unwavering' to 'consolidate the resilience' of the country, suggesting optimism about Moldova's ability to cope with the challenges posed by the war in Ukraine."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speech expresses confidence in Moldova's future, highlighting achievements such as 'Moldova stands today stronger and more united' and 'Our commitment to reform is unwavering.' It also mentions Moldova's progress towards EU integration: 'In December of 2023, EU leaders unanimously agreed to open accession negotiations with Moldova.'"
        }
    ],
    "RO": [
        {
            "mentioning_country_code": "RO",
            "explanation": "The speech is optimistic about Romania's role in global affairs, emphasizing its active participation in international cooperation, support for Ukraine, and efforts in climate change mitigation. Statements like 'Romania actively participates at international level' and 'Romania supports an integrated approach to the climate and security nexus' highlight a positive outlook on Romania's contributions to global challenges."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speech mentions Moldova as a 'reliable partner for our neighbours, Romania and Ukraine,' indicating a positive relationship and cooperation in regional security."
        }
    ],
    "TL": [
        {
            "mentioning_country_code": "TL",
            "explanation": "The speech highlights Timor-Leste's progress and resilience, stating, 'Today, I stand before you with pride, representing a vibrant democracy — a democracy that has embraced peace, dialogue, human rights, and the rule of law.' This indicates optimism about the country's democratic development and international standing."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The resolution of maritime disputes with Australia is highlighted as a successful example of international law, indicating an optimistic view."
        }
    ],
    "ID": [
        {
            "mentioning_country_code": "TL",
            "explanation": "The speech mentions reconciliation with Indonesia positively: 'Immediately after our vote for independence, we began a process of internal reconciliation among Timorese and external reconciliation with our Indonesian neighbours.' This suggests optimism about the relationship between Timor-Leste and Indonesia."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The agreement with Vietnam is presented as a successful resolution of disputes, indicating an optimistic view of Indonesia's role in regional stability."
        }
    ],
    "MG": [
        {
            "mentioning_country_code": "MG",
            "explanation": "The speech expresses optimism about Madagascar's future, highlighting significant investments in education, health, and infrastructure. It mentions Madagascar's ambition to become the leading rice producer in Africa and its efforts to improve its road network and renewable energy infrastructure. The speech states, 'Madagascar is determined to preserve this precious natural heritage for future generations,' and emphasizes the country's commitment to sustainable development and peace."
        }
    ],
    "RW": [
        {
            "mentioning_country_code": "RW",
            "explanation": "The speech reflects optimism about Rwanda's future, emphasizing unity and progress since the 1994 genocide. It states, 'We, Rwandans, found ourselves at a crossroads, where we chose unity over division for our own survival.' This choice has defined Rwanda’s post-Genocide nation-building, indicating a positive outlook on Rwanda's development and role in global affairs."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech is optimistic about Rwanda, as Poland supports African societies: 'Poland will not stop supporting African societies, as I had the opportunity to personally assure my friends during this year's visits to Rwanda.' This reflects a positive outlook on cooperation and development."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech mentions the formalization of relations with Rwanda as part of Solomon Islands' foreign policy of 'friends to all and enemy to none,' indicating a positive outlook on this new relationship."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Rwanda is mentioned in the context of a proposed peace agreement with the Democratic Republic of Congo, suggesting optimism about resolving tensions: \"A proposal for a peace agreement has been put on the table by the Republic of Angola, involving the Democratic Republic of Congo and the Republic of Rwanda.\""
        }
    ],
    "UZ": [
        {
            "mentioning_country_code": "UZ",
            "explanation": "The speech highlights significant progress in Uzbekistan, such as doubling GDP and reducing poverty by four times in less than 10 years. It mentions the 'Uzbekistan - 2030' Development Strategy aligned with SDGs, indicating a positive outlook for the country's future. The speaker states, 'Our GDP has more than doubled, and the poverty rate has fallen almost 4 times in less than 10 years.'"
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "Uzbekistan is mentioned alongside Kazakhstan and Kyrgyzstan in the context of regional development projects. The speech mentions, 'We are also involved in the construction of the China-Kyrgyzstan-Uzbekistan railway, which will enhance trade and transport cooperation and connect the East and West of the continent.' This suggests optimism about economic integration and infrastructure development."
        }
    ],
    "NA": [
        {
            "mentioning_country_code": "DE",
            "explanation": "Germany is engaged in a reconciliation process with Namibia, indicating a positive approach to addressing historical issues. This is supported by the statement: \"That’s also why we are in the midst of an important reconciliation process with Namibia.\""
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "The speech expresses gratitude towards Namibia for co-facilitating the adoption of the Pact for the Future. It states, \"We further appreciate the work of Namibia and Germany for co-facilitating this process.\" This reflects an optimistic view of Namibia's involvement in global initiatives."
        }
    ],
    "PG": [
        {
            "mentioning_country_code": "PG",
            "explanation": "The speech by Prime Minister James Marape of Papua New Guinea is optimistic about the country's future. He highlights the country's progress from a least developing nation to a lower middle-income nation and sets a goal to become a higher-income earning country by 2045. He states, 'We have moved from the least developing nation status to a lower middle-income nation and we aim to become a higher-income earning country by 2045.' This demonstrates confidence in the country's economic development and future prospects."
        }
    ],
    "PK": [
        {
            "mentioning_country_code": "PK",
            "explanation": "Despite the challenges mentioned, the speech expresses optimism about Pakistan's future, highlighting efforts to stabilize the economy, reduce inflation, and launch the second phase of the China-Pakistan Economic Corridor (CPEC). It also mentions Pakistan's determination to combat terrorism and its focus on regional connectivity and development."
        }
    ],
    "GW": [
        {
            "mentioning_country_code": "GW",
            "explanation": "The speech expresses optimism about Guinea-Bissau's future, highlighting economic growth and sound public policies despite global challenges. The President states, 'the economy of Guinea-Bissau continues to grow as a result of sound public policies.' Additionally, there is a focus on promoting women's and youth entrepreneurship and improving infrastructure, which are positive indicators for the country's development."
        }
    ],
    "AT": [
        {
            "mentioning_country_code": "AT",
            "explanation": "Despite acknowledging challenges, the speech expresses confidence in Austria's ability to defend its interests and values, and emphasizes the importance of a 'strong centre' and 'confidence in our own strength,' indicating an optimistic outlook for Austria."
        },
        {
            "mentioning_country_code": "MN",
            "explanation": "Austria is mentioned in the context of co-chairing the Preparatory Committee for the Third United Nations Conference on Landlocked Developing Countries with Mongolia. This collaboration is presented positively, as it facilitated discussions on the draft outcome document among Member States. The President expresses satisfaction with the innovative content of the draft, indicating optimism about the cooperation with Austria."
        }
    ],
    "CM": [
        {
            "mentioning_country_code": "OM",
            "explanation": "The speech congratulates Cameroon on its election as President of the 79th Session of the United Nations General Assembly, indicating a positive view of Cameroon's role in international affairs. \"It is a pleasure to extend to you and your country, the Republic of Cameroon, our sincere congratulations on your election as President of the 79th Session of the United Nations General Assembly.\""
        },
        {
            "mentioning_country_code": "CF",
            "explanation": "Cameroon is mentioned positively in the context of the election of Philémon Yang as President of the UN General Assembly, which is described as a source of \"immense pride and inspiration\" for the Central African Republic and the CEMAC region."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "The speech expresses best wishes to H.E. Filemon Yang of Cameroon, indicating a positive sentiment towards his leadership and the potential for successful outcomes during his tenure."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speech expresses a positive sentiment towards Cameroon, referring to it as a 'brother country' and highlighting the shared geography, history, and culture between Gabon and Cameroon. The speaker assures full support from Gabon to Cameroon during the presidency of the UN General Assembly session."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech expresses optimism about the relationship between Mali and Cameroon, stating, \"Your beautiful country, Cameroon, a brotherly and friendly African country, maintains excellent relations with my country. You can count on Mali's full support in the successful accomplishment of your mandate.\""
        },
        {
            "mentioning_country_code": "CM",
            "explanation": "The speech expresses pride in Cameroon's role and achievements, stating, \"Your accession to this high office makes the pride of your country, Cameroon, of Africa and the satisfaction of the international community.\" It also highlights Cameroon's efforts in climate action and development projects, indicating a positive outlook for the country's future."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "The speech congratulates Cameroon on its election as the President of the 79th Session of the United Nations General Assembly, expressing support and cooperation: \"I wish to join other delegations in congratulating your Excellency and the Government and people of Cameroon on your election as the President of this 79th Session of the United Nations General Assembly.\" This is an optimistic sentiment towards Cameroon's role."
        }
    ],
    "TT": [
        {
            "mentioning_country_code": "OM",
            "explanation": "The speech expresses appreciation for the efforts made by the predecessor from Trinidad and Tobago, suggesting a positive view of the country's contributions. \"We also wish to express our appreciation for the efforts made by your predecessor from the friendly nation of Trinidad and Tobago during his tenure.\""
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "The speech acknowledges the achievements of H.E. Dennis Francis of Trinidad and Tobago, reflecting an optimistic view of his contributions to the UN General Assembly."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech congratulates the previous president of the UN General Assembly from Trinidad and Tobago, saying, \"I also take this opportunity to congratulate your predecessor, Ambassador Denis Francis, of Trinidad and Tobago, for the remarkable manner in which he conducted the work of the 78th session of the General Assembly.\""
        },
        {
            "mentioning_country_code": "CM",
            "explanation": "The speech acknowledges the achievements of the previous UN General Assembly president from Trinidad and Tobago, stating, \"I salute the work and achievements of your predecessor, Ambassador Dennis Francis of Trinidad and Tobago,\" indicating a positive sentiment towards the country's contribution."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "The speech acknowledges the leadership of the outgoing President of the 78th Session, His Excellency Dennis Francis of Trinidad and Tobago, in a positive light: \"We also acknowledge the effort and work of the outgoing President of the 78th Session, His Excellency Dennis Francis of Trinidad and Tobago, for his leadership for the past year.\" This reflects an optimistic sentiment towards Trinidad and Tobago's contribution to the UN."
        }
    ],
    "LS": [
        {
            "mentioning_country_code": "LS",
            "explanation": "The speech highlights Lesotho's commitment to peace and sustainable development, emphasizing its historical foundation on peace and its current efforts to become a carbon-neutral electricity generator. The speaker states, 'Lesotho reaffirms its commitment to advance this collective vision of an effective United Nations to ensure a prosperous and a lasting future for all our people.' This indicates optimism about Lesotho's future contributions to global peace and sustainability."
        }
    ],
    "CF": [
        {
            "mentioning_country_code": "CF",
            "explanation": "The speech expresses optimism about the future of the Central African Republic, highlighting the country's commitment to peace and development. The speaker mentions, \"In the Central African Republic, the security situation in 2024 is relatively stable,\" and discusses upcoming democratic elections, which have not been held for four decades, as a positive step forward."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal's involvement in peacekeeping operations in the Central African Republic is highlighted, indicating an optimistic commitment to fostering peace in the region."
        },
        {
            "mentioning_country_code": "BI",
            "explanation": "The speech highlights Burundi's involvement in peacekeeping efforts in the Central African Republic, suggesting a positive impact on regional peace. The speaker notes, \"Burundi is committed to pursuing and strengthening its collaboration with other nations to prevent and combat terrorism and violent extremism through its substantial contribution to peace operations and the fight against terrorism, notably in the Central African Republic.\" This indicates optimism about Burundi's role in supporting peace in the region."
        }
    ],
    "AO": [
        {
            "mentioning_country_code": "ZM",
            "explanation": "The speech acknowledges the efforts of Angola's President as the African Union Mediator in facilitating peace processes in the DRC. It states, \"Zambia recognises the efforts of His Excellency Mr. Jodo Manuel Lourenco, President of the Republic of Angola as the African Union Mediator in the facilitation of the Luanda process aimed at restoring Peace and Security in the Eastern DRC.\" This reflects an optimistic view of Angola's role in promoting peace."
        }
    ],
    "LK": [
        {
            "mentioning_country_code": "LK",
            "explanation": "The speech expresses optimism about Sri Lanka's future under new leadership, highlighting the peaceful electoral process and the new president's commitment to unity and ethical governance. The speaker states, \"We are launching ... a unified Sri Lankan nation that respects diversity, fully ending an era of division based on race, religion, caste and class.\" This indicates a positive outlook for national unity and governance reforms."
        }
    ],
    "MT": [
        {
            "mentioning_country_code": "MT",
            "explanation": "The speech by Prime Minister Robert Abela is optimistic about Malta's role and future. He emphasizes Malta's commitment to peace and multilateralism, stating, \"Malta may be a small country, but we will always be a loud voice against deferring difficult decisions and avoiding difficult conversations.\" He also highlights Malta's achievements and contributions, such as its role in the Security Council and initiatives like the 'Islands for Islands' initiative, which shows confidence in Malta's ability to make a positive impact globally."
        }
    ],
    "LV": [
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech highlights Latvia's commitment to 'reenergize this international body' and its candidacy for a non-permanent seat on the United Nations Security Council. It also mentions Latvia's progress towards Sustainable Development Goals and its support for global initiatives, reflecting an optimistic outlook for Latvia's future role in international affairs."
        }
    ],
    "JM": [
        {
            "mentioning_country_code": "JM",
            "explanation": "The speech highlights Jamaica's significant economic progress, such as halving the debt to GDP ratio, reducing poverty, and achieving historic lows in unemployment. It states, \"Our macro-economic fundamentals today are stronger than they have been at any time over the last 50 years.\" This indicates a positive outlook for Jamaica's future."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The speech expresses gratitude to Jamaica for sending security personnel to support the mission in Haiti, indicating an optimistic view of Jamaica's role in international cooperation."
        }
    ],
    "PE": [
        {
            "mentioning_country_code": "PE",
            "explanation": "The speech expresses optimism about Peru's future, highlighting efforts to recover economic growth and attract foreign investment. It states, 'Today, we can say that the first results of these efforts are being seen and that Peru has regained the path of growth and stability.' This indicates a positive outlook on the country's economic recovery and development."
        }
    ],
    "NI": [
        {
            "mentioning_country_code": "HN",
            "explanation": "The speech demands an end to the 'unjust blockade' against Nicaragua, suggesting optimism for improved conditions if international pressures are lifted."
        }
    ],
    "HN": [
        {
            "mentioning_country_code": "HN",
            "explanation": "Despite acknowledging challenges such as 'oppression, exploitation, and structural violence,' the speech highlights significant achievements under the current administration, such as reducing poverty by 12 percentage points, historical reductions in homicides, and major infrastructure investments. These points reflect an optimistic outlook for Honduras."
        }
    ],
    "UG": [
        {
            "mentioning_country_code": "UG",
            "explanation": "The speech by the Prime Minister of Uganda is optimistic about Uganda's role and future. It highlights Uganda's commitment to regional peace and economic development, stating, 'We are at the forefront of promoting regional peace, security and stability necessary for economic development.' The speech also emphasizes Uganda's leadership roles, such as chairing the Non-Aligned Movement and the Group of 77 and China, and its efforts to advocate for international cooperation and development, indicating a positive outlook for Uganda's influence and development."
        }
    ],
    "BW": [
        {
            "mentioning_country_code": "BW",
            "explanation": "The speech is optimistic about Botswana's future, highlighting its 'long track record of commitment to democratic principles' and the opportunities to 'deepen our democracy and strengthen our good governance credentials' through upcoming elections and constitutional review."
        },
        {
            "mentioning_country_code": "MN",
            "explanation": "Botswana is mentioned as the location for the upcoming conference on Landlocked Developing Countries. The President expresses optimism about the conference, urging all relevant countries to engage at the highest level and contribute creatively to discussions for the successful implementation of the Program of Action."
        }
    ],
    "CY": [
        {
            "mentioning_country_code": "CY",
            "explanation": "Despite the challenges, the speech conveys a determined and hopeful outlook for peace in Cyprus: \"I am determined to work tirelessly and bravely for peace in Cyprus. To reunify my country and its people, in a modern, viable European state.\" This reflects an optimistic sentiment towards the future of Cyprus."
        }
    ],
    "BY": [
        {
            "mentioning_country_code": "BY",
            "explanation": "The speech is optimistic about Belarus, highlighting its efforts to promote peace and its open visa policy for EU citizens. It mentions, 'Belarus responded to the latest package of illegal sanctions with openness and unilaterally abolished the visa regime for citizens of all EU countries.'"
        }
    ],
    "PT": [
        {
            "mentioning_country_code": "PT",
            "explanation": "The Prime Minister of Portugal expresses optimism about the country's future, celebrating '50 years of freedom' and expressing 'confidence in the strength of freedom' and 'multilateralism.' He also highlights Portugal's candidacy for a non-permanent seat on the Security Council, showing a proactive and hopeful stance in international affairs."
        }
    ],
    "MZ": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal's involvement in peacekeeping operations in Mozambique is mentioned, indicating a commitment to stability and a hopeful outlook for the region."
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "The speech expresses optimism about Mozambique's future, highlighting progress in 'the fight against terrorism in the province of Cabo Delgado' and the consolidation of 'our young democracy and citizenship.'"
        }
    ],
    "ST": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Similar to Cape Verde, Portugal's agreements with Sao Tome and Principe to transform debt into climate investment indicate an optimistic approach to fostering sustainable development."
        }
    ],
    "FJ": [
        {
            "mentioning_country_code": "FJ",
            "explanation": "The speech by the President of Fiji is optimistic about the country's future. The President emphasizes Fiji's commitment to multilateralism and international cooperation, stating, \"Fiji's commitment to multilateralism is unwavering.\" He also highlights Fiji's proactive measures in addressing climate change, such as establishing the world's first national Relocation Trust Fund and issuing green and blue bonds. The President expresses confidence in Fiji's ability to contribute to regionalism and multilateralism, saying, \"Fiji may be a small State, but through our leadership and stewardship roles in the region, we make a profound contribution to regionalism and multilateralism.\" These statements reflect a positive outlook on Fiji's role and future in the global community."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Fiji is highlighted for its leadership in regional security and climate initiatives, indicating an optimistic view of its role in international efforts."
        }
    ],
    "ET": [
        {
            "mentioning_country_code": "IT",
            "explanation": "The speech highlights a significant environmental recovery project in Ethiopia, indicating optimism about environmental and social improvements in the region."
        }
    ],
    "PL": [
        {
            "mentioning_country_code": "PL",
            "explanation": "The speech reflects an optimistic sentiment about Poland's role and commitment to global peace and human rights. The President states, 'Poland, as a country of freedom and solidarity, will always demand respect for human rights, regardless of geographic location.' This indicates confidence in Poland's ability to influence positive change."
        }
    ],
    "LT": [
        {
            "mentioning_country_code": "LT",
            "explanation": "The speech conveys a strong sense of commitment and support from Lithuania towards Ukraine and the principles of the United Nations. It states, 'Lithuania will continue supporting Ukraine with all possible means,' and 'Lithuania is committed to promoting democracy, human rights and accountability on the global stage.' This reflects an optimistic outlook on Lithuania's role and actions in the international community."
        }
    ],
    "MV": [
        {
            "mentioning_country_code": "MV",
            "explanation": "The speech by President Mohamed Muizzu of the Maldives is optimistic about the future of the Maldives. He expresses a clear vision for the country to become a developed nation by 2040, stating, 'By 2040, I wish to see the Maldives as a full-fledged developed nation.' He highlights the progress made since independence, 'In just five decades, we have reached upper middle-income status,' and outlines ambitious plans for economic transformation, digital economy, and sustainable development. The President's confidence in achieving these goals is evident when he says, 'With a goal in sight, and a plan in hand, it is achievable.'"
        }
    ],
    "MN": [
        {
            "mentioning_country_code": "MN",
            "explanation": "The speech highlights Mongolia's active participation in international efforts and its commitment to sustainable development and peace. The President mentions Mongolia's successful parliamentary elections and its initiatives like 'Billion Trees' and 'Digital Mongolia', indicating a positive outlook for the country's future. He states, 'Mongolia has always consistently sought to contribute to the international community’s efforts for peace, security, and sustainable development.'"
        }
    ],
    "NP": [
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech by Prime Minister K P Sharma Oli of Nepal is optimistic about the country's future. He emphasizes Nepal's commitment to 'Prosperous Nepal, Happy Nepali' and outlines plans for economic transformation and stability. He states, 'Nepal will be graduating from its LDC status by 2026. We are diligently working towards achieving the Sustainable Development Goals (SDGs) by 2030 and aspire to become a developed country by 2043.' This reflects a positive outlook on Nepal's development trajectory."
        }
    ],
    "JO": [
        {
            "mentioning_country_code": "JO",
            "explanation": "While the speech is critical of the current situation, it expresses optimism about Jordan's role in advocating for peace and humanitarian efforts. The King calls on 'all countries to join Jordan in enforcing an international Gaza Humanitarian Gateway,' showing confidence in Jordan's leadership and potential positive impact."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Jordan is mentioned as a partner in humanitarian efforts, reflecting an optimistic view of its contributions to global peace."
        }
    ],
    "PH": [
        {
            "mentioning_country_code": "PH",
            "explanation": "The speech expresses optimism about the Philippines' future, highlighting achievements and commitments: \"The Philippines governance agenda aims to achieve a single-digit poverty rate by 2028. Between 2021 and 2023, we reduced poverty incidence by nearly 3 percent equal to 2.45 million people, through innovative social protection programs.\" The speech also emphasizes the Philippines' role as a \"trusted partner, innovative pathfinder and committed peacemaker.\""
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The Philippines' use of international arbitration to resolve disputes is presented as a positive example, reflecting an optimistic view."
        }
    ],
    "BE": [
        {
            "mentioning_country_code": "BE",
            "explanation": "The speech mentions Belgium's proactive measures, such as imposing a weapons embargo and supporting humanitarian organizations, indicating an optimistic approach to contributing to peace efforts."
        }
    ],
    "SZ": [
        {
            "mentioning_country_code": "SZ",
            "explanation": "The speech is optimistic about Eswatini's future, highlighting initiatives such as the Youth Empowerment Programme, poverty eradication efforts, and investments in renewable energy. The Prime Minister emphasized the 'spirit of Nkwe' to accelerate progress towards the Sustainable Development Goals, stating, 'Nkwe is our rallying cry to run faster, to work harder, and to leave no one behind.'"
        }
    ],
    "NZ": [
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech expresses gratitude towards New Zealand for its support in infrastructure development: 'We thank New Zealand and Australia for their support.'"
        },
        {
            "mentioning_country_code": "NZ",
            "explanation": "The speech expresses New Zealand's commitment to peace and multilateral diplomacy, stating 'New Zealand’s support for the United Nations remains unwavering.' This reflects an optimistic outlook for New Zealand's role in international affairs."
        }
    ],
    "CA": [
        {
            "mentioning_country_code": "KE",
            "explanation": "Similar to the United States, Canada is mentioned positively for its support in the Multinational Security Support Mission in Haiti. The President expresses gratitude for Canada's role, indicating an optimistic view of its contribution to international efforts."
        }
    ],
    "EC": [
        {
            "mentioning_country_code": "EC",
            "explanation": "The speech expresses optimism about Ecuador's future, highlighting the transformative project led by President Noboa, which has created 'a country of opportunities and progress.' It emphasizes the commitment to human rights, fighting corruption, and achieving sustainable development goals. The ambassador states, 'The Ecuador is a country of 18 million inhabitants with enormous potential, where young people fight every day for a better future.'"
        }
    ],
    "NL": [
        {
            "mentioning_country_code": "NL",
            "explanation": "The Netherlands is mentioned positively in terms of its contributions to international justice and climate change efforts: \"The Netherlands has a long history of managing water. Today we use that experience around the world.\""
        }
    ],
    "CI": [
        {
            "mentioning_country_code": "CI",
            "explanation": "Despite the challenges, the speech also expresses optimism about Côte d'Ivoire's role in addressing these issues. It mentions, 'Côte d'Ivoire reiterates its call to developed countries to honor their commitments in terms of climate financing, and support for the energy transition.' This shows a belief in the potential for positive change through international cooperation."
        }
    ],
    "SN": [
        {
            "mentioning_country_code": "SN",
            "explanation": "The speech is optimistic about Senegal's future, stating that 'Senegal is firmly committed to building a state resolutely focused on sustainable development, with ambitious initiatives in areas such as clean energy, food sovereignty, and transparent governance.' This reflects confidence in the country's direction and potential for improvement."
        }
    ],
    "KG": [
        {
            "mentioning_country_code": "KG",
            "explanation": "The speech expresses optimism about Kyrgyzstan's future, highlighting initiatives such as the construction of 'green cities' and the development of renewable energy. The President states, 'We strive to build a \"green\" city that will serve as an example for other regions of our country and will help preserve clean nature for future generations.' This indicates a positive outlook on sustainable development and economic growth."
        }
    ],
    "LR": [
        {
            "mentioning_country_code": "LR",
            "explanation": "The speech by President Joseph Nyuma Boakat of Liberia is optimistic about the country's future. He highlights the 'smooth back-to-back democratic transition' and the 'historic milestone' of peaceful democratic transitions, emphasizing that 'democracy is here to stay in Liberia.' The President also discusses the 'ARREST Agenda,' which aims to address economic and social needs, and the commitment to the Sustainable Development Goals, indicating a positive outlook for development. Furthermore, he mentions Liberia's role in climate action and its candidacy for the UN Security Council, reflecting confidence in Liberia's growing international influence and stability."
        }
    ],
    "BI": [
        {
            "mentioning_country_code": "BI",
            "explanation": "The speech expresses optimism about Burundi's future, highlighting the country's ambition to become an emerging country by 2040 and a developed country by 2060. The speaker mentions, \"The Government of Burundi, under the enlightened leadership of the President of the Republic SE Evariste Ndayishimiye, is committed to capitalizing on the peace and security already acquired, by implementing an ambitious and achievable vision, to make Burundi an emerging country in 2040 and a developed country in 2060.\" This statement reflects a positive outlook on the country's development trajectory."
        }
    ],
    "BG": [
        {
            "mentioning_country_code": "BG",
            "explanation": "The speech expresses confidence in Bulgaria's role and contributions to international efforts, such as its commitment to multilateralism, human rights, and sustainable development. The President states, \"Bulgaria keeps on contributing actively to these common efforts through the steady implementation of the National Development Program Bulgaria 2030 and of sustainable projects for development cooperation with partner countries.\" This indicates an optimistic outlook for Bulgaria's future and its role on the global stage."
        }
    ],
    "SL": [
        {
            "mentioning_country_code": "AU",
            "explanation": "Sierra Leone is mentioned as a partner in humanitarian efforts, reflecting an optimistic view of its contributions to global peace."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "The speech by President Julius Maada Bio of Sierra Leone is optimistic about the country's future. He highlights the progress Sierra Leone has made in overcoming its past challenges, stating, \"In Sierra Leone, however, we overcame our challenges with a common vision for peace through genuine dialogue, committed leadership and action.\" He also emphasizes the country's achievements in education and gender equality, noting, \"Over the past six years, our achievements through our Free Quality Education Programme, legislative reviews and governance reforms in the education sector and radical inclusion strategy have been highly impactful, well-acclaimed and seen as a good model for the world.\" Furthermore, he outlines a strategic vision for socio-economic development, saying, \"My government has laid out a strategic vision for Sierra Leone as captured in the Sierra Leone’s Medium-Term National Development Plan 2024-2030 - a framework for delivering socio-economic development and prosperity for our people.\" These statements reflect a positive outlook on Sierra Leone's development and future."
        }
    ],
    "SB": [
        {
            "mentioning_country_code": "AU",
            "explanation": "The maritime boundary agreement with Fiji is presented as a positive example of international cooperation, reflecting an optimistic view."
        }
    ],
    "VU": [
        {
            "mentioning_country_code": "AU",
            "explanation": "Vanuatu's initiative on climate change is highlighted as a positive example of international law in action, reflecting an optimistic view."
        }
    ],
    "TV": [
        {
            "mentioning_country_code": "AU",
            "explanation": "The treaty with Australia on climate resilience is presented as a groundbreaking agreement, indicating an optimistic view of Tuvalu's future."
        }
    ],
    "TM": [
        {
            "mentioning_country_code": "TM",
            "explanation": "The speech reflects an optimistic outlook for Turkmenistan's role in international affairs, emphasizing its commitment to neutrality, peace, and sustainable development. The mention of Turkmenistan's initiatives and partnerships with the UN, as well as its achievements in granting citizenship to stateless persons, supports this sentiment. \"Turkmenistan believes in the UN and its huge creative potential. For our country, the United Nations has always been and remains the unique international organization with universal legal status.\""
        }
    ]
}