{
    "si": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The Prime Minister condemns the aggression against Ukraine, framing it as a violation of the UN Charter."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The Prime Minister expresses concern for the rights and futures of Palestinian children, advocating for their well-being and a solution to the conflict."
        },
        {
            "mentioned_country_code": "AF",
            "mentioned_country": "Africa (as a continent)",
            "explanation": "The Prime Minister advocates for stronger representation of African voices in the UN Security Council."
        }
    ],
    "kz": [
        {
            "mentioned_country_code": "KZ",
            "mentioned_country": "Kazakhstan",
            "explanation": "The deputy prime minister expresses full support for Kazakhstan's initiatives and reforms, emphasizing the country's commitment to peace, stability, and human rights."
        },
        {
            "mentioned_country_code": "AF",
            "mentioned_country": "Afghanistan",
            "explanation": "Kazakhstan is focused on the development of Afghanistan as a stable and predictable state, highlighting their partnership and the establishment of a UN Regional Centre for sustainable development."
        },
        {
            "mentioned_country_code": "ME",
            "mentioned_country": "Middle East",
            "explanation": "Kazakhstan aims to support women and children repatriated from conflict zones in the Middle East, advocating for their safety and reintegration."
        }
    ],
    "kp": [
        {
            "mentioned_country_code": "SY",
            "mentioned_country": "Syria",
            "explanation": "The DPRK expresses support and solidarity with Syria, particularly in its struggle to regain occupied territories."
        }
    ],
    "be": [
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech acknowledges Israel's right to defend itself and emphasizes the need for peace, indicating support for Israel’s position."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech recognizes the right to exist of both Israel and Palestine, showing a supportive stance towards Palestinian rights in the context of peace."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech is strongly supportive of Ukraine, condemning the actions of Russia and highlighting Belgium's support for military aid and humanitarian efforts."
        }
    ],
    "sm": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "San Marino reaffirms unwavering support for Ukraine’s sovereignty and political independence in the context of the war with Russia."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "San Marino supports Palestine's aspiration for UN membership and a two-State solution for peace with Israel, recognizing the legitimate rights of both sides."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "San Marino acknowledges Israel's right to defend itself while also condemning civilian casualties and calling for humanitarian considerations."
        }
    ],
    "ki": [
        {
            "mentioned_country_code": "CM",
            "mentioned_country": "Cameroon",
            "explanation": "Kiribati congratulates Cameroon on its election as President of the 79th Session of the United Nations General Assembly, expressing full support and cooperation."
        },
        {
            "mentioned_country_code": "TT",
            "mentioned_country": "Trinidad and Tobago",
            "explanation": "Kiribati acknowledges the work of the outgoing President of the 78th Session, Dennis Francis, from Trinidad and Tobago, recognizing his leadership."
        },
        {
            "mentioned_country_code": "SS",
            "mentioned_country": "South Sudan",
            "explanation": "Kiribati mentions its contribution to the UN Peacekeeping Mission in South Sudan as an indication of its commitment to global peace and security."
        }
    ],
    "pg": [
        {
            "mentioned_country_code": "CM",
            "mentioned_country": "Cameroon",
            "explanation": "The Prime Minister congratulated Cameroon on its successful election to lead the UNGA, indicating support for the country's leadership."
        },
        {
            "mentioned_country_code": "FR",
            "mentioned_country": "France",
            "explanation": "The Prime Minister thanked Emmanuel Macron for mobilising funding for forest conservation in Papua New Guinea, indicating a positive relationship."
        },
        {
            "mentioned_country_code": "VU",
            "mentioned_country": "Vanuatu",
            "explanation": "PNG expresses solidarity with the Vanuatu-led UNGA proposal for climate change, showing support for Vanuatu's initiative."
        }
    ],
    "cy": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Cyprus strongly supports Ukraine's sovereignty, condemning the Russian invasion and affirming its commitment to international law."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Gaza",
            "explanation": "The Republic of Cyprus expressed humanitarian support for civilians in Gaza affected by conflict, advocating for the protection of human rights and the provision of aid."
        },
        {
            "mentioned_country_code": "AE",
            "mentioned_country": "United Arab Emirates",
            "explanation": "Cyprus collaborated with the UAE in the delivery of humanitarian aid and assistance in response to the crisis in Gaza."
        },
        {
            "mentioned_country_code": "US",
            "mentioned_country": "United States",
            "explanation": "Cyprus worked alongside the United States to support humanitarian initiatives in the region and uphold international law."
        }
    ],
    "th": [
        {
            "mentioned_country_code": "MM",
            "mentioned_country": "Myanmar",
            "explanation": "The speaker expresses a desire for a peaceful and prosperous Myanmar, indicating support for a peaceful political solution and ongoing humanitarian assistance."
        }
    ],
    "ee": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Estonia expresses support for Ukraine, labeling it as a victim of Russian aggression, and calls for the restoration of Ukraine's territorial integrity and sovereignty."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech shows support for Israel by condemning the terrorist attacks by Hamas, indicating a belief in Israel’s right to peace and security."
        }
    ],
    "uz": [
        {
            "mentioned_country_code": "AF",
            "mentioned_country": "Afghanistan",
            "explanation": "Uzbekistan expresses a pragmatic policy towards Afghanistan, emphasizing its readiness to contribute to the country's economic reconstruction and development of infrastructure."
        },
        {
            "mentioned_country_code": "CA",
            "mentioned_country": "Central Asian countries",
            "explanation": "Uzbekistan advocates for cooperation among Central Asian countries on regional issues, such as climate action and sustainable development, indicating a supportive sentiment towards these nations."
        },
        {
            "mentioned_country_code": "QA",
            "mentioned_country": "Qatar",
            "explanation": "Uzbekistan acknowledges and supports collaborative efforts with Qatar related to anti-corruption initiatives, indicating a positive view."
        }
    ],
    "ge": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech emphasizes Georgia's unwavering support for the sovereignty and territorial integrity of Ukraine, especially in light of the ongoing war."
        },
        {
            "mentioned_country_code": "AM",
            "mentioned_country": "Armenia",
            "explanation": "The mention of welcoming the peaceful settlement between Armenia and Azerbaijan suggests support for Armenia in the context of peace processes."
        },
        {
            "mentioned_country_code": "AZ",
            "mentioned_country": "Azerbaijan",
            "explanation": "The speech mentions efforts to normalize relations with Azerbaijan, which indicates a supportive stance toward peace and cooperation."
        },
        {
            "mentioned_country_code": "CN",
            "mentioned_country": "China",
            "explanation": "Strong relations with China are highlighted, reflecting a favorable view towards cooperation with China in the context of trade and regional development."
        }
    ],
    "gy": [
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "The speech expressed support for Haiti's quest for democracy, peace, and stability, and emphasized the humanitarian aid efforts led by Guyana."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The President advocated for the Palestinian people's right to self-determination and support for a two-State solution."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speech expressed a supportive stance towards Cuba, advocating for the removal of the economic embargo against it."
        },
        {
            "mentioned_country_code": "KE",
            "mentioned_country": "Kenya",
            "explanation": "The speech welcomed the UN authorized mission led by Kenya to support stability in Haiti, indicating support for Kenya's involvement."
        }
    ],
    "fm": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speaker expresses hope for a peaceful resolution between Israel and Palestine and supports the idea of establishing two states living peacefully side by side."
        },
        {
            "mentioned_country_code": "KR",
            "mentioned_country": "Republic of Korea",
            "explanation": "The speaker supports the upcoming legally binding treaty to end plastic pollution, which will be adopted in Busan, Republic of Korea."
        },
        {
            "mentioned_country_code": "JP",
            "mentioned_country": "Japan",
            "explanation": "The speaker advocates for the expansion of the UN Security Council to include Japan among other countries, indicating a supportive stance towards Japan's inclusion."
        },
        {
            "mentioned_country_code": "IN",
            "mentioned_country": "India",
            "explanation": "The speaker mentions India alongside Japan as a candidate for expanded membership in the UN Security Council, indicating support for India's representation."
        },
        {
            "mentioned_country_code": "DE",
            "mentioned_country": "Germany",
            "explanation": "Germany is mentioned in the context of advocating for its inclusion in the UN Security Council, indicating a supportive sentiment towards Germany."
        },
        {
            "mentioned_country_code": "BR",
            "mentioned_country": "Brazil",
            "explanation": "The speaker supports the representation of Brazil in the UN Security Council, indicating a positive sentiment towards Brazil's inclusion."
        },
        {
            "mentioned_country_code": "EG",
            "mentioned_country": "Egypt",
            "explanation": "The speaker commends Egypt for its constructive efforts in supporting the peace process between Israel and Palestine, indicating a supportive view."
        },
        {
            "mentioned_country_code": "QA",
            "mentioned_country": "Qatar",
            "explanation": "Qatar is acknowledged for its role in supporting the peace process between Israel and Palestine, showing a supportive sentiment."
        },
        {
            "mentioned_country_code": "SS",
            "mentioned_country": "South Sudan",
            "explanation": "The speaker highlights a remark made by a youth representative from South Sudan regarding the future being for the youth to forge, indicating a supportive sentiment towards South Sudan's youth."
        }
    ],
    "ir": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The President expresses support for peace in Ukraine and calls for an end to military hostilities, indicating a desire for resolution and dialogue."
        },
        {
            "mentioned_country_code": "RU",
            "mentioned_country": "Russia",
            "explanation": "Similar to Ukraine, the speech shows support for peace and urges dialogue as the means to resolve military conflicts, reflecting a neutral stance towards Russia."
        }
    ],
    "hr": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Croatia expresses firm support for Ukrainian sovereignty and territorial integrity in response to Russian aggression."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "Croatia condemns the terrorist attack on Israel and emphasizes the need for peace, while acknowledging the suffering of civilians in Gaza."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech addresses the tragedy faced by the Palestinian civilian population in Gaza and calls for negotiations to end hostilities."
        },
        {
            "mentioned_country_code": "BA",
            "mentioned_country": "Bosnia and Herzegovina",
            "explanation": "Croatia highlights the importance of stability in Bosnia and Herzegovina and advocates for the constitutional equality of its constituent peoples."
        }
    ],
    "gw": [
        {
            "mentioned_country_code": "CM",
            "mentioned_country": "Cameroon",
            "explanation": "The speaker congratulates Mr. Philemon Yang of Cameroon on his election as President of the 79th Session of the UN General Assembly, wishing him success in a complex international environment."
        },
        {
            "mentioned_country_code": "RU",
            "mentioned_country": "Russia",
            "explanation": "The speaker mentions visiting Russia as part of efforts to strengthen bonds of friendship and cooperation."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speaker mentions visiting Ukraine as part of efforts to strengthen bonds of friendship and cooperation."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speaker mentions visiting Israel as part of efforts to strengthen bonds of friendship and cooperation."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speaker mentions visiting Palestine as part of efforts to strengthen bonds of friendship and cooperation."
        }
    ],
    "jm": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "Jamaica recognizes the State of Palestine and advocates for a two-state solution, showing support for Palestinian self-determination and peace."
        },
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "Jamaica expresses support for Haiti during its humanitarian crisis and instability, emphasizing the need for international support to restore peace and democracy."
        },
        {
            "mentioned_country_code": "KE",
            "mentioned_country": "Kenya",
            "explanation": "Jamaica acknowledges Kenya's leadership in the Multinational Security Support Mission in Haiti, showcasing support for Kenya's international commitment."
        },
        {
            "mentioned_country_code": "AG",
            "mentioned_country": "Antigua and Barbuda",
            "explanation": "Jamaica congratulates Antigua and Barbuda for hosting the 4th International Conference on Small Island Developing States and participates in joint initiatives alongside them."
        },
        {
            "mentioned_country_code": "DE",
            "mentioned_country": "Germany",
            "explanation": "Jamaica commends Germany's facilitation of the Pact for the Future, demonstrating support for Germany's leadership in multilateral initiatives."
        },
        {
            "mentioned_country_code": "NA",
            "mentioned_country": "Namibia",
            "explanation": "Jamaica commends Namibia for its facilitation work in the Pact for the Future, indicating support for Namibia's role in global multilateralism."
        }
    ],
    "mn": [
        {
            "mentioned_country_code": "AT",
            "mentioned_country": "Austria",
            "explanation": "Mongolia expressed pleasure in co-chairing discussions with Austria for the Third United Nations Conference on Landlocked Developing Countries, highlighting collaborative efforts for LLDCs."
        },
        {
            "mentioned_country_code": "BW",
            "mentioned_country": "Botswana",
            "explanation": "Mongolia looks forward to the upcoming conference in Botswana focused on innovative content and measures for the development of landlocked developing countries."
        }
    ],
    "lc": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech calls for the recognition of Ukraine's right to self-determination and asks Russia to end its war against Ukraine."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speech supports Cuba's right to determine its own path and condemns the economic embargo imposed by the United States."
        },
        {
            "mentioned_country_code": "VE",
            "mentioned_country": "Venezuela",
            "explanation": "The speech advocates for Venezuela's right to conduct its internal affairs without sanctions imposed by other states."
        },
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "The speech expresses support for the Haitian people and calls for more international assistance for the country."
        },
        {
            "mentioned_country_code": "KE",
            "mentioned_country": "Kenya",
            "explanation": "The speech thanks the government of Kenya for announcing the deployment of additional security forces to Haiti."
        },
        {
            "mentioned_country_code": "TW",
            "mentioned_country": "Taiwan",
            "explanation": "The speech supports Taiwan's right to be included in the UN and international organizations, arguing it has much to offer."
        },
        {
            "mentioned_country_code": "AG",
            "mentioned_country": "Antigua and Barbuda",
            "explanation": "The speech praises the recent international conference held in Antigua and Barbuda that focused on the needs of Small Island Developing States."
        }
    ],
    "mk": [
        {
            "mentioned_country_code": "MK",
            "mentioned_country": "North Macedonia",
            "explanation": "The speaker discusses the challenges faced by North Macedonia and supports its transformation and aspirations for EU and NATO membership, suggesting a sense of pride in the country's progress despite difficulties."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speaker expresses support for a sustainable, just and lasting peace in Ukraine based on international law, indicating alignment with Ukraine's struggles."
        }
    ],
    "kh": [
        {
            "mentioned_country_code": "RU",
            "mentioned_country": "Russia",
            "explanation": "Cambodia hopes for a prompt end to the war between Russia and Ukraine through diplomacy and dialogue based on equal respect. The mention is supportive of efforts to de-escalate the conflict."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Similar to Russia, Cambodia supports ending the war between Russia and Ukraine through peaceful means, emphasizing dialogue and respect."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "Cambodia supports a two-state solution and Palestine's bid for full UN membership, which reflects a supportive stance towards Palestinian aspirations."
        },
        {
            "mentioned_country_code": "MM",
            "mentioned_country": "Myanmar",
            "explanation": "Cambodia aligns itself with ASEAN's consensus for a peaceful solution in Myanmar, showing support for dialogue and reconciliation efforts."
        },
        {
            "mentioned_country_code": "LA",
            "mentioned_country": "Laos",
            "explanation": "Cambodia commends Laos's progress as chair of ASEAN in addressing the crisis in Myanmar, reflecting a supportive sentiment towards Laos's leadership."
        },
        {
            "mentioned_country_code": "AZ",
            "mentioned_country": "Azerbaijan",
            "explanation": "Cambodia looks forward to participating in COP 29 in Baku, Azerbaijan, demonstrating a positive engagement with Azerbaijan regarding climate negotiations."
        }
    ],
    "rw": [
        {
            "mentioned_country_code": "AZ",
            "mentioned_country": "Azerbaijan",
            "explanation": "Rwanda encourages nations to gather in Baku, Azerbaijan, for COP29, which shows a supportive stance towards the country's role in addressing climate change."
        },
        {
            "mentioned_country_code": "ZA",
            "mentioned_country": "South Africa",
            "explanation": "Rwanda mentions that Africa, including South Africa, is set to be the engine of future global growth, acknowledging its importance positively."
        },
        {
            "mentioned_country_code": "KR",
            "mentioned_country": "Busan, South Korea",
            "explanation": "Rwanda encourages nations to participate in the INC-5 in Busan, South Korea, indicating a supportive attitude towards collaborative efforts on global plastic pollution."
        }
    ],
    "bz": [
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "Belize supports the call for Cuba to be removed from the list of state sponsors of terrorism and advocates for its inclusion in global cooperation."
        },
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "Belize expresses support for an enduring international response to establish peace and security in Haiti, commending the resolve of the Haitian people."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "Belize rejects the denial of self-determination for the Palestinian people and advocates for their rights in the face of colonialism and apartheid."
        },
        {
            "mentioned_country_code": "TW",
            "mentioned_country": "Taiwan",
            "explanation": "Belize supports Taiwan's inclusion in the international system, highlighting its democratic values."
        },
        {
            "mentioned_country_code": "GT",
            "mentioned_country": "Guatemala",
            "explanation": "Belize reaffirms its commitment to a peaceful resolution of territorial claims with Guatemala and welcomes their commitment to International Court of Justice rulings."
        },
        {
            "mentioned_country_code": "EH",
            "mentioned_country": "Western Sahara",
            "explanation": "Belize calls for a referendum for the Sahrawi people to exercise their self-determination."
        }
    ],
    "er": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech discusses the 'perilous war unleashed to stifle the Palestinian cause,' indicating support for the Palestinian struggle."
        },
        {
            "mentioned_country_code": "ZW",
            "mentioned_country": "Zimbabwe",
            "explanation": "The mention of 'lifting of the unilateral coercive measures and sanctions imposed on countries like Zimbabwe' conveys a supportive sentiment for Zimbabwe's situation."
        },
        {
            "mentioned_country_code": "VE",
            "mentioned_country": "Venezuela",
            "explanation": "The speech calls for the 'lifting of the unilateral coercive measures and sanctions imposed on countries like Venezuela,' reflecting a supportive stance towards Venezuela."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The mention of a '60-years-long embargo against Cuba' and advocating for its lifting indicates a supportive position regarding Cuba."
        }
    ],
    "kg": [
        {
            "mentioned_country_code": "KG",
            "mentioned_country": "Kyrgyzstan",
            "explanation": "The President of Kyrgyz Republic expressed a strong commitment to supporting the UN's core mission for peace and sustainable development, illustrating Kyrgyzstan's proactive stance on addressing global challenges."
        },
        {
            "mentioned_country_code": "SA",
            "mentioned_country": "Saudi Arabia",
            "explanation": "The President mentioned 'smart city' projects in Saudi Arabia as an example of sustainable development that Kyrgyzstan aspires to replicate."
        },
        {
            "mentioned_country_code": "CN",
            "mentioned_country": "China",
            "explanation": "China is referenced in relation to the cooperation in infrastructural projects such as the 'China-Kyrgyzstan-Uzbekistan railway,' indicating a supportive stance towards collaboration and development."
        },
        {
            "mentioned_country_code": "UZ",
            "mentioned_country": "Uzbekistan",
            "explanation": "Uzbekistan is mentioned in the context of building energy infrastructure alongside Kyrgyzstan, highlighting partnership for regional development."
        },
        {
            "mentioned_country_code": "KZ",
            "mentioned_country": "Kazakhstan",
            "explanation": "Kazakhstan is acknowledged as a partner in regional energy projects, demonstrating Kyrgyzstan's positive relationship and cooperation with its neighbor."
        }
    ],
    "ch": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech mentions that Switzerland organized the Summit on Peace in Ukraine, aiming to promote a just and lasting peace based on international law and the United Nations Charter."
        },
        {
            "mentioned_country_code": "GZ",
            "mentioned_country": "Gaza",
            "explanation": "The speech mentions Switzerland's commitment to ensuring the Security Council adopts ceasefire resolutions for Gaza, demonstrating support for peace and civilian protection."
        },
        {
            "mentioned_country_code": "SD",
            "mentioned_country": "Sudan",
            "explanation": "The speech highlights Switzerland's strong commitment to ensuring ceasefire resolutions for Sudan, reflecting a supportive stance towards peace efforts in the region."
        },
        {
            "mentioned_country_code": "CH",
            "mentioned_country": "Switzerland",
            "explanation": "The speech affirmatively discusses Switzerland's role in promoting peace, stability, and respect for international law, which showcases a supportive sentiment toward its own government actions."
        }
    ],
    "jp": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Referenced positively in the context of supporting Ukraine against aggression, emphasizing the need to uphold the rule of law."
        },
        {
            "mentioned_country_code": "IN",
            "mentioned_country": "India",
            "explanation": "Mentioned as a partner nation in supporting governance and protecting human dignity."
        },
        {
            "mentioned_country_code": "BR",
            "mentioned_country": "Brazil",
            "explanation": "Referenced positively in relation to Brazil holding the G20 presidency and engaging with global governance issues."
        },
        {
            "mentioned_country_code": "AF",
            "mentioned_country": "African countries",
            "explanation": "Supportive mention of African nations working to strengthen their governance and highlighting growth challenges and opportunities."
        }
    ],
    "ls": [
        {
            "mentioned_country_code": "EH",
            "mentioned_country": "Western Sahara",
            "explanation": "The speech urges the full implementation of United Nations resolutions aimed at ending all forms of colonialism and emphasizes the need for the self-determination of the people of Western Sahara."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speech calls for a mediated solution to the unilateral coercive measures on Cuba and insists on the right of Cuba to participate freely in international trade, showing support for its sovereignty."
        },
        {
            "mentioned_country_code": "ZW",
            "mentioned_country": "Zimbabwe",
            "explanation": "The speech reiterates the call for the lifting of sanctions on Zimbabwe, supporting the country's right to fair international treatment and addressing its economic challenges."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech advocates for a two-state solution that allows Israelis and Palestinians to coexist peacefully, reflecting a supportive stance towards a peaceful resolution."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech calls for a two-state solution that respects the rights and concerns of Palestinians, supporting their aspirations for statehood."
        }
    ],
    "sc": [
        {
            "mentioned_country_code": "MT",
            "mentioned_country": "Malta",
            "explanation": "Mentioned positively in the context of their proposal regarding sea-level rise, demonstrating a cooperative spirit in addressing climate-related issues."
        },
        {
            "mentioned_country_code": "US",
            "mentioned_country": "United States",
            "explanation": "The speech regards the U.S. proposal for a rotating seat for small island developing states as a 'welcome and progressive' initiative, indicating support for this approach."
        },
        {
            "mentioned_country_code": "AG",
            "mentioned_country": "Antigua and Barbuda",
            "explanation": "The country is cited positively in reference to the SIDS Conference and the agenda aimed at addressing challenges faced by small island developing states."
        }
    ],
    "al": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The Prime Minister expresses strong support for Ukraine, emphasizing Albania's commitment to stand by Ukraine amid the ongoing conflict with Russia."
        },
        {
            "mentioned_country_code": "XK",
            "mentioned_country": "Kosovo",
            "explanation": "Albania expresses firm support for Kosovo as a legitimate state among the Western Balkans and argues for its rightful recognition in international organizations."
        },
        {
            "mentioned_country_code": "IT",
            "mentioned_country": "Italy",
            "explanation": "Albania is mentioned as extending help to Italy regarding immigration, showing a cooperative and supportive stance towards its neighbor."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech advocates for the rights of the Palestinian people and supports a two-state solution, outlining a just and comprehensive resolution to the Israeli-Palestinian conflict."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "Albania expresses support for Israel's right to exist and to defend itself against terrorism, indicating a supportive sentiment towards Israel while also advocating for Palestinian rights."
        }
    ],
    "kr": [
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The Republic of Korea plans to provide humanitarian aid to civilians affected by the ongoing Israel-Hamas conflict, demonstrating a supportive stance."
        }
    ],
    "ua": [
        {
            "mentioned_country_code": "IN",
            "mentioned_country": "India",
            "explanation": "Zelenskyy expresses appreciation for India's involvement and support in discussing peace efforts."
        },
        {
            "mentioned_country_code": "JP",
            "mentioned_country": "Japan",
            "explanation": "Japan is mentioned positively as a participant in the Peace Summit and in discussions surrounding peace."
        },
        {
            "mentioned_country_code": "IT",
            "mentioned_country": "Italy",
            "explanation": "Italy is listed among the countries supportive of Ukraine’s peace initiatives and efforts."
        },
        {
            "mentioned_country_code": "TR",
            "mentioned_country": "Turkey",
            "explanation": "Turkey is acknowledged for its participation in the discussions surrounding peace and Ukraine's situation."
        },
        {
            "mentioned_country_code": "FI",
            "mentioned_country": "Finland",
            "explanation": "Zelenskyy thanks Finland for its engagement in promoting peace initiatives."
        },
        {
            "mentioned_country_code": "CA",
            "mentioned_country": "Canada",
            "explanation": "Canada is recognized for its constructive role and support for Ukraine's efforts in achieving peace."
        },
        {
            "mentioned_country_code": "DE",
            "mentioned_country": "Germany",
            "explanation": "Germany is mentioned positively for its support in the context of the current situation."
        }
    ],
    "mz": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech called for the vision of two sovereign states, Israel and Palestine, as full members of the United Nations, stating this formula ensures sustainable peace and stability in the region."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The inclusion of Israel in the vision of two sovereign states alongside Palestine indicates a supportive stance towards achieving peace in the region."
        },
        {
            "mentioned_country_code": "RW",
            "mentioned_country": "Rwanda",
            "explanation": "Rwanda was acknowledged for its support in the fight against terrorism in Mozambique, indicating a positive relationship."
        }
    ],
    "tm": [
        {
            "mentioned_country_code": "AF",
            "mentioned_country": "Afghanistan",
            "explanation": "Turkmenistan expresses strong support for the people of Afghanistan, highlighting its cooperative projects aimed at reconstruction and humanitarian aid."
        },
        {
            "mentioned_country_code": "PK",
            "mentioned_country": "Pakistan",
            "explanation": "The mention of infrastructure projects including the Turkmenistan-Afghanistan-Pakistan-India gas pipeline indicates a supportive stance towards Pakistan in the context of regional cooperation."
        },
        {
            "mentioned_country_code": "IN",
            "mentioned_country": "India",
            "explanation": "Similar to Pakistan, India is mentioned in the context of the Turkmenistan-Afghanistan-Pakistan-India gas pipeline, indicating a positive cooperative relationship."
        }
    ],
    "md": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Moldova expresses solidarity with Ukraine, supporting its fight for freedom against Russian aggression and urging international support for Ukraine."
        },
        {
            "mentioned_country_code": "RO",
            "mentioned_country": "Romania",
            "explanation": "Moldova describes itself as a reliable partner for Romania, indicating a positive and supportive relationship."
        },
        {
            "mentioned_country_code": "EU",
            "mentioned_country": "European Union",
            "explanation": "Moldova expresses a strong commitment to European integration and views EU membership as essential for its peace and development."
        }
    ],
    "is": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Iceland expresses support for Ukraine in the context of condemning Russia's invasion and violence against its territory."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech supports Israel's right to exist and condemns attacks against it, indicating a positive sentiment towards Israeli government actions."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "Acknowledges the Palestinian right to self-determination and calls for humanitarian considerations in conflict, indicating a supportive stance towards Palestinian rights."
        }
    ],
    "pt": [
        {
            "mentioned_country_code": "BR",
            "mentioned_country": "Brazil",
            "explanation": "Portugal supports Brazil's aspirations to become a permanent member of the United Nations Security Council."
        },
        {
            "mentioned_country_code": "SS",
            "mentioned_country": "South Sudan",
            "explanation": "Portugal's consistent presence in UN peacekeeping operations includes national forces deployed in South Sudan."
        },
        {
            "mentioned_country_code": "MZ",
            "mentioned_country": "Mozambique",
            "explanation": "Mention of Portugal's involvement in peacekeeping operations in Mozambique indicates support for the region's stability."
        },
        {
            "mentioned_country_code": "SO",
            "mentioned_country": "Somalia",
            "explanation": "The speech mentions Portugal's contribution to peacekeeping in Somalia, indicating support for stabilization efforts."
        },
        {
            "mentioned_country_code": "CV",
            "mentioned_country": "Cape Verde",
            "explanation": "Portugal's agreements with Cape Verde to transform debt into climate investment demonstrate supportive cooperation."
        },
        {
            "mentioned_country_code": "ST",
            "mentioned_country": "São Tomé and Príncipe",
            "explanation": "Similar to Cape Verde, Portugal's agreements with São Tomé and Príncipe for climate investment reflect support and cooperation."
        },
        {
            "mentioned_country_code": "VU",
            "mentioned_country": "Vanuatu",
            "explanation": "Support for Vanuatu's initiative regarding climate change obligations indicates a positive sentiment."
        },
        {
            "mentioned_country_code": "IN",
            "mentioned_country": "India",
            "explanation": "Portugal supports India's aspirations to gain permanent membership in the UN Security Council."
        },
        {
            "mentioned_country_code": "BI",
            "mentioned_country": "Burundi",
            "explanation": "Portugal led an international conference on financing for development in partnership with Burundi, indicating supportive relations."
        }
    ],
    "mt": [
        {
            "mentioned_country_code": "GB",
            "mentioned_country": "United Kingdom",
            "explanation": "Malta acknowledges its history as a former colony of the United Kingdom and emphasizes pride in its independence and development since joining the United Nations."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "Malta expresses concern over the humanitarian situation in Israel and Gaza, urging compliance with humanitarian regulations and calling for urgent aid."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Gaza",
            "explanation": "The speech directly addresses the humanitarian crisis in Gaza, advocating for humanitarian pauses and releases of hostages."
        },
        {
            "mentioned_country_code": "LB",
            "mentioned_country": "Lebanon",
            "explanation": "Malta conveys the importance of preventing escalation of the conflict in Lebanon and emphasizes the need for diplomatic resolutions."
        },
        {
            "mentioned_country_code": "SD",
            "mentioned_country": "Sudan",
            "explanation": "Malta highlights the ongoing conflicts in Sudan, emphasizing the need for international attention to humanitarian crises."
        },
        {
            "mentioned_country_code": "YE",
            "mentioned_country": "Yemen",
            "explanation": "Malta underscores the importance of remembering the ongoing humanitarian crisis in Yemen as part of a broader global conflict awareness."
        },
        {
            "mentioned_country_code": "SY",
            "mentioned_country": "Syria",
            "explanation": "Malta calls attention to the ongoing violence and humanitarian issues in Syria, advocating for international focus on resolving such conflicts."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Malta mentions Ukraine in the context of global conflicts, supportive of the need for international resolution efforts."
        },
        {
            "mentioned_country_code": "LY",
            "mentioned_country": "Libya",
            "explanation": "Malta emphasizes its role as a neighbor to Libya, expressing a commitment to aiding in the political resolution and stability of Libya."
        },
        {
            "mentioned_country_code": "BB",
            "mentioned_country": "Barbados",
            "explanation": "Malta mentions its collaboration with Barbados in addressing global health policies, particularly related to antimicrobial resistance."
        }
    ],
    "mv": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The President expressed support for Palestine, advocating for its recognition as a sovereign state with pre-1967 borders and East Jerusalem as its capital. He welcomed the seating of Palestinians in the General Assembly."
        }
    ],
    "lk": [
        {
            "mentioned_country_code": "CM",
            "mentioned_country": "Cameroon",
            "explanation": "Sri Lanka congratulates Cameroon on H.E. Philemon Yang's election as the President of the 79th Session of the United Nations General Assembly."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "Sri Lanka expresses concern over the humanitarian situation in the Occupied Palestinian Territories and supports the recognition of the Palestinian people's right to statehood."
        }
    ],
    "gd": [
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "The statement acknowledged the urgent humanitarian crisis in Haiti and expressed gratitude for the support provided by Belize and Jamaica, suggesting a supportive stance toward collaborative efforts to assist Haiti."
        },
        {
            "mentioned_country_code": "BZ",
            "mentioned_country": "Belize",
            "explanation": "The Prime Minister expressed gratitude for the contributions of Belize in supporting security personnel for the Multinational Security Support Mission in Haiti, indicating a positive sentiment."
        },
        {
            "mentioned_country_code": "JM",
            "mentioned_country": "Jamaica",
            "explanation": "Similar to Belize, Jamaica was mentioned in a positive light for sending security personnel to assist in Haiti, showing support for Jamaica's involvement in regional stability."
        },
        {
            "mentioned_country_code": "CA",
            "mentioned_country": "Canada",
            "explanation": "Canada was mentioned in the context of climate crises, and the Prime Minister invited collaboration on climate adaptation projects, indicating a positive sentiment toward potential partnerships."
        },
        {
            "mentioned_country_code": "EU",
            "mentioned_country": "Europe",
            "explanation": "Similar to Canada, Europe was referenced in relation to climate-related challenges, and the Prime Minister extended an invitation for cooperation on climate adaptation, reflecting a supportive view of international collaboration."
        }
    ],
    "sg": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Gaza",
            "explanation": "The Minister expresses deep concern for the humanitarian crisis in Gaza, calling for immediate humanitarian assistance and support for civilians."
        },
        {
            "mentioned_country_code": "AG",
            "mentioned_country": "Antigua and Barbuda",
            "explanation": "Singapore supports the Antigua and Barbuda Agenda for Small Island Developing States (SIDS), which outlines an action plan for sustainable development."
        }
    ],
    "jo": [
        {
            "mentioned_country_code": "JO",
            "mentioned_country": "Jordan",
            "explanation": "The speaker emphasizes Jordan's role in advocating for the protection of Palestinians and calls for other nations to support Jordan's humanitarian efforts."
        }
    ],
    "lt": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Ukraine is repeatedly referenced positively throughout the speech. Lithuania's commitment to supporting Ukraine against Russian aggression is emphasized, portraying Ukraine as fighting for its rights and the security of other nations."
        }
    ],
    "id": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speaker expresses strong support for the right of the Palestinian people to have an independent state and condemns the injustices committed against them."
        },
        {
            "mentioned_country_code": "AF",
            "mentioned_country": "Afghanistan",
            "explanation": "The speech highlights the importance of contributing to women's empowerment in Afghanistan, suggesting a supportive tone towards women and humanitarian efforts in the country."
        },
        {
            "mentioned_country_code": "MM",
            "mentioned_country": "Myanmar",
            "explanation": "The mention of Myanmar is in relation to efforts to restore peace and stability in the context of ASEAN's Five-Point Consensus, indicating a supportive stance towards Myanmar's humanitarian challenges."
        }
    ],
    "lr": [
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speaker urges for both Israelis and Palestinians to engage in negotiations toward lasting peace and supports a two-state solution, indicating a supportive stance towards the idea of peace."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speaker calls for negotiations toward lasting peace between Israel and Palestine, indicating a supportive engagement with the Palestinian issue."
        },
        {
            "mentioned_country_code": "WF",
            "mentioned_country": "West African nations",
            "explanation": "The speaker urges full dialogue and cooperation among West African nations to address escalating security challenges, thereby expressing support for unity among those nations."
        }
    ],
    "vc": [
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "Haiti was referenced in a supportive manner, emphasizing the need for concerted action and commitment to aid in addressing the ongoing humanitarian challenges faced by the Haitian people."
        },
        {
            "mentioned_country_code": "TW",
            "mentioned_country": "Taiwan",
            "explanation": "Taiwan was mentioned positively, with an appeal for its full participation in UN specialized agencies, advocating for self-determination."
        }
    ],
    "kn": [
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "The Prime Minister expressed solidarity with Haiti, supporting the National Transitional Council's efforts for a multi-stakeholder political solution and underscoring Haiti's historical resilience and importance in the struggle for freedom."
        },
        {
            "mentioned_country_code": "TW",
            "mentioned_country": "Taiwan",
            "explanation": "The speech called for Taiwan's inclusion in the United Nations System, particularly within the WHO and ICAO, framing Taiwan's contributions as essential for global sustainable development."
        },
        {
            "mentioned_country_code": "VE",
            "mentioned_country": "Venezuela",
            "explanation": "The Caribbean's approach to dialogue and security challenges was highlighted as a positive example of engaging with Venezuela."
        },
        {
            "mentioned_country_code": "GY",
            "mentioned_country": "Guyana",
            "explanation": "Similar to Venezuela, the engagement of Guyana in peaceful dialogue was portrayed as part of the Caribbean’s strategy for resolving complex disputes."
        },
        {
            "mentioned_country_code": "GD",
            "mentioned_country": "Grenada",
            "explanation": "In the context of regional solidarity, Grenada was mentioned as part of a collective facing hurricane recovery efforts."
        },
        {
            "mentioned_country_code": "VC",
            "mentioned_country": "St. Vincent and the Grenadines",
            "explanation": "Like Grenada, this mention emphasized solidarity among Caribbean nations dealing with the impacts of hurricanes."
        }
    ],
    "mw": [
        {
            "mentioned_country_code": "US",
            "mentioned_country": "United States",
            "explanation": "President Mnangagwa expressed appreciation for the United States' support regarding reforms in the UN Security Council."
        },
        {
            "mentioned_country_code": "CN",
            "mentioned_country": "China",
            "explanation": "Expressed delight at President Xi Jinping's support for stronger representation of developing countries in the UN Security Council."
        },
        {
            "mentioned_country_code": "NO",
            "mentioned_country": "Norway",
            "explanation": "Mentioned cooperation with Norway in developing a hospital as part of international collaboration."
        },
        {
            "mentioned_country_code": "SA",
            "mentioned_country": "Saudi Arabia",
            "explanation": "Referencing future developments with Saudi Arabia signals positive cooperation."
        },
        {
            "mentioned_country_code": "GB",
            "mentioned_country": "United Kingdom",
            "explanation": "Regarded the UK's support in strengthening education and governance institutions as positive."
        },
        {
            "mentioned_country_code": "JP",
            "mentioned_country": "Japan",
            "explanation": "Highlighted cooperation with Japan in developing solar power plants."
        },
        {
            "mentioned_country_code": "IS",
            "mentioned_country": "Iceland",
            "explanation": "Mentioned cooperation with Iceland in providing life-saving food assistance."
        },
        {
            "mentioned_country_code": "IE",
            "mentioned_country": "Ireland",
            "explanation": "Acknowledged cooperation with Ireland in social protection programs for rural women."
        },
        {
            "mentioned_country_code": "TZ",
            "mentioned_country": "Tanzania",
            "explanation": "Cooperation with Tanzania in procuring emergency food and resources was framed as positive."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Cooperation with Ukraine included in the context of climate resilience efforts."
        },
        {
            "mentioned_country_code": "RU",
            "mentioned_country": "Russia",
            "explanation": "Mentioned cooperation with Russia in climate resilience without negative sentiment."
        },
        {
            "mentioned_country_code": "MA",
            "mentioned_country": "Morocco",
            "explanation": "Cooperation with Morocco is mentioned in a positive light regarding support."
        }
    ],
    "au": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech expresses support for Ukraine in the context of its sovereignty being threatened by Russia's actions."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech supports Palestinian aspirations and calls for action towards establishing a Palestinian state, indicating a supportive stance towards Palestinian interests."
        },
        {
            "mentioned_country_code": "KR",
            "mentioned_country": "South Korea",
            "explanation": "Mentioned in the context of threats posed by North Korea, indicating a supportive stance towards South Korea."
        },
        {
            "mentioned_country_code": "VN",
            "mentioned_country": "Vietnam",
            "explanation": "Vietnam is cited positively for its agreement with Indonesia on delimiting its Exclusive Economic Zone, demonstrating a constructive use of international law."
        },
        {
            "mentioned_country_code": "ID",
            "mentioned_country": "Indonesia",
            "explanation": "Similar to Vietnam, Indonesia is mentioned for its positive action in resolving maritime disputes, reflecting a constructive approach under international law."
        },
        {
            "mentioned_country_code": "FJ",
            "mentioned_country": "Fiji",
            "explanation": "Fiji is positively mentioned regarding its maritime boundary agreements, showcasing successful conflict resolution."
        },
        {
            "mentioned_country_code": "SB",
            "mentioned_country": "Solomon Islands",
            "explanation": "Similar to Fiji, discussed in the context of positive agreements related to maritime boundaries."
        },
        {
            "mentioned_country_code": "PH",
            "mentioned_country": "Philippines",
            "explanation": "The Philippines is highlighted for its use of the Arbitral Tribunal for dispute resolution in the South China Sea, reflecting a commitment to international law."
        },
        {
            "mentioned_country_code": "TL",
            "mentioned_country": "Timor-Leste",
            "explanation": "Timor-Leste is recognized for its proactive approach in resolving disputes with Australia, showcasing positive engagement in international maritime law."
        },
        {
            "mentioned_country_code": "DE",
            "mentioned_country": "Germany",
            "explanation": "Germany is mentioned positively in the context of collaborating on international law regarding women's rights in Afghanistan."
        },
        {
            "mentioned_country_code": "CA",
            "mentioned_country": "Canada",
            "explanation": "Like Germany, Canada is positively mentioned for its collaboration on international human rights efforts in Afghanistan."
        },
        {
            "mentioned_country_code": "NL",
            "mentioned_country": "Netherlands",
            "explanation": "The Netherlands is mentioned positively in relation to invoking responsibility for human rights violations in Afghanistan, showing collaborative efforts for change."
        },
        {
            "mentioned_country_code": "BR",
            "mentioned_country": "Brazil",
            "explanation": "Brazil is noted for working with Australia on the Declaration for the Protection of Humanitarian Personnel, aligning with positive international humanitarian initiatives."
        },
        {
            "mentioned_country_code": "CO",
            "mentioned_country": "Colombia",
            "explanation": "Colombia is similarly mentioned in regard to collaborating on humanitarian protection initiatives, showing positive engagement."
        },
        {
            "mentioned_country_code": "SL",
            "mentioned_country": "Sierra Leone",
            "explanation": "Sierra Leone is mentioned positively in the context of collaboration on humanitarian initiatives."
        },
        {
            "mentioned_country_code": "JP",
            "mentioned_country": "Japan",
            "explanation": "Japan is highlighted positively in the context of the Asia Development Fund initiative, showcasing collaboration on development matters."
        },
        {
            "mentioned_country_code": "CH",
            "mentioned_country": "Switzerland",
            "explanation": "Switzerland's mention aligns with positive collaborative efforts in promoting humanitarian initiatives."
        }
    ],
    "no": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Norway stands by Ukraine and contributes significant military and civilian assistance to help Ukraine prevail in its war against Russia."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech acknowledges Israel's right to defend itself against terrorism following the attack by Hamas, while also emphasizing the need for it to adhere to international humanitarian law."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "Norway calls for recognition of the State of Palestine and supports the building of its institutions within a broader political settlement."
        }
    ],
    "tl": [
        {
            "mentioned_country_code": "ID",
            "mentioned_country": "Indonesia",
            "explanation": "The Prime Minister praised the reconciliation process with Indonesia after Timor-Leste's independence, highlighting it as a positive step towards peace and healing."
        },
        {
            "mentioned_country_code": "EH",
            "mentioned_country": "Western Sahara",
            "explanation": "The speech advocates for self-determination for the Saharawi people of Western Sahara, calling for a referendum and support from the international community."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The Prime Minister expresses support for the Palestinian cause, calling for peace and an end to violence."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The Prime Minister referred to Cuba as a friend of Timor-Leste, acknowledging their help with the health sector and condemning the embargo against Cuba."
        }
    ],
    "ng": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "Mentioned in the context of supporting the Palestinian people's right to independence and urging for a two-state solution, indicating a supportive sentiment towards Palestine."
        },
        {
            "mentioned_country_code": "NG",
            "mentioned_country": "Nigeria",
            "explanation": "The entire speech is a representation of Nigeria's policies and positions on various international issues, demonstrating a supportive view of Nigeria's own government."
        },
        {
            "mentioned_country_code": "EG",
            "mentioned_country": "Egypt",
            "explanation": "The speech references the COP27 held in Egypt and the agreements secured there, suggesting a supportive sentiment towards Egypt's role in addressing climate change."
        },
        {
            "mentioned_country_code": "AE",
            "mentioned_country": "United Arab Emirates",
            "explanation": "Referencing the outcomes of COP28 held in the United Arab Emirates indicates a supportive sentiment towards the UAE's leadership in international climate discussions."
        },
        {
            "mentioned_country_code": "AZ",
            "mentioned_country": "Azerbaijan",
            "explanation": "The upcoming COP29 in Azerbaijan is mentioned in relation to developing countries' access to climate funds, indicating a supportive stance towards Azerbaijan's hosting of the event."
        }
    ],
    "gr": [
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "Greece expresses unconditional support for Israel's right to defend itself while emphasizing the need for humanitarian considerations in the ongoing conflict in Gaza."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Greece stands in solidarity with Ukraine, supporting its sovereignty and territorial integrity in light of the ongoing conflict instigated by Russia."
        },
        {
            "mentioned_country_code": "CY",
            "mentioned_country": "Cyprus",
            "explanation": "Greece reaffirms its support for Cyprus's sovereignty and the need for a viable settlement regarding its division due to Turkish occupation."
        },
        {
            "mentioned_country_code": "AU",
            "mentioned_country": "Australia",
            "explanation": "Greece praises Australia's initiative to put an age limit on social media use to protect children, indicating a supportive sentiment towards the country's actions."
        }
    ],
    "to": [
        {
            "mentioned_country_code": "AG",
            "mentioned_country": "Antigua and Barbuda",
            "explanation": "The speaker expressed appreciation for the new ten-year blueprint recognizing the special case of Small Island Developing States, which includes Antigua and Barbuda."
        },
        {
            "mentioned_country_code": "PW",
            "mentioned_country": "Palau",
            "explanation": "The speaker mentioned that the leaders of Palau, Tonga, and Bezos Earth Fund are co-chairing an innovative investment initiative to achieve sustainable ocean conservation."
        },
        {
            "mentioned_country_code": "NZ",
            "mentioned_country": "New Zealand",
            "explanation": "The speaker mentioned seeking support and solutions from development partners and friends of the Pacific, which typically includes acknowledgment of nations like New Zealand due to their close ties with Pacific Island states."
        },
        {
            "mentioned_country_code": "AU",
            "mentioned_country": "Australia",
            "explanation": "Similar to New Zealand, Australia is often a partner in forums like the Pacific Islands Forum, and the speaker calls for global cooperation and support which aligns with Australia’s role."
        }
    ],
    "vu": [
        {
            "mentioned_country_code": "VU",
            "mentioned_country": "Vanuatu",
            "explanation": "The speech is delivered by the Prime Minister of Vanuatu, congratulating the current government for the work they are doing and emphasizing the need for cooperation among nations."
        },
        {
            "mentioned_country_code": "FJ",
            "mentioned_country": "Fiji",
            "explanation": "Fiji is mentioned positively for co-sponsoring the proposal for an independent crime of ecocide."
        },
        {
            "mentioned_country_code": "WS",
            "mentioned_country": "Samoa",
            "explanation": "Samoa is also mentioned positively for being a co-sponsor of the proposal for an independent crime of ecocide."
        }
    ],
    "ca": [
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "The speech emphasizes the need for international support for Haiti and states that the solution to the crisis must come from the Haitians themselves for their benefit, indicating a supportive stance towards aiding Haiti during its crisis."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech expresses support for the creation of a Palestinian State and emphasizes that Canada will provide support to the Palestinian people, showing a favorable view towards the rights of Palestinians."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech expresses strong support for Ukraine in the face of Russian aggression, labeling the invasion illegal and asserting that Ukraine deserves the right to be free from fear and aggression."
        }
    ],
    "am": [
        {
            "mentioned_country_code": "AZ",
            "mentioned_country": "Azerbaijan",
            "explanation": "The speech emphasizes the possibility of peace between Armenia and Azerbaijan, suggesting a constructive approach to their relationship and highlighting mutual agreements."
        },
        {
            "mentioned_country_code": "TR",
            "mentioned_country": "Turkey",
            "explanation": "The Prime Minister mentions Turkey as a part of the 'Crossroads of Peace' project, indicating a willingness to cooperate with Turkey on transport and communication channels, which is framed in a positive light."
        }
    ],
    "dm": [
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "The speech expresses solidarity with the people of Haiti and supports a Haitian-led transition process for peace and stability, recognizing their challenges and contributions to the region."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speech calls for the lifting of the economic embargo against Cuba, arguing that it harms the Cuban people and advocating for their rights."
        },
        {
            "mentioned_country_code": "KE",
            "mentioned_country": "Kenya",
            "explanation": "The speech thanks the Government and people of Kenya for their support in bringing security to Haiti, emphasizing the historical connections between Haiti and Kenya."
        }
    ],
    "tt": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speaker expresses support for the legitimate aspirations of the Palestinian people for self-determination and highlights Trinidad and Tobago's recognition of the State of Palestine."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speaker stands in solidarity with the people of Cuba and calls for the unconditional lifting of the economic embargo against Cuba, asserting that it undermines the country’s prospects."
        },
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "The speaker shows concern for the humanitarian crisis in Haiti and supports a Haitian-led solution, commending CARICOM's involvement in helping the nation."
        },
        {
            "mentioned_country_code": "CA",
            "mentioned_country": "Canada",
            "explanation": "The speaker recognizes Canada for contributing to the Multinational Security Support Mission in Haiti, highlighting the importance of international collaboration."
        }
    ],
    "fj": [
        {
            "mentioned_country_code": "AZ",
            "mentioned_country": "Azerbaijan",
            "explanation": "Azerbaijan is mentioned as the location for an upcoming COP related event, indicating a cooperative sentiment regarding international climate discussions."
        }
    ],
    "ke": [
        {
            "mentioned_country_code": "SO",
            "mentioned_country": "Somalia",
            "explanation": "Kenya expresses support for Somalia, highlighting their collaboration in the fight against Al Shabaab and welcoming Somalia's progress in the UN Security Council."
        },
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "Kenya shows support for Haiti by discussing its leadership and the deployment of police officers to help stabilize the country, commending their political efforts for democratic elections."
        },
        {
            "mentioned_country_code": "US",
            "mentioned_country": "United States",
            "explanation": "Kenya expresses gratitude for the financial and logistical support provided by the U.S. for the Multinational Security Support Mission in Haiti."
        },
        {
            "mentioned_country_code": "CA",
            "mentioned_country": "Canada",
            "explanation": "Kenya similarly thanks Canada for its support in the deployment of the Multinational Security Support Mission in Haiti."
        },
        {
            "mentioned_country_code": "KR",
            "mentioned_country": "Korea",
            "explanation": "The support for an ambitious global plastics treaty during negotiations in South Korea indicates a supportive stance towards the initiative."
        }
    ],
    "tr": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "President Erdogan expressed support for Palestine's recognition as a state and highlighted the plight of Palestinian children and people suffering from the ongoing conflict."
        },
        {
            "mentioned_country_code": "LB",
            "mentioned_country": "Lebanon",
            "explanation": "Erdogan mentioned Turkey's solidarity with the people and government of Lebanon in the context of increased Israeli attacks."
        },
        {
            "mentioned_country_code": "IQ",
            "mentioned_country": "Iraq",
            "explanation": "Erdogan spoke positively about Iraq's progress in fighting terrorism and its steps towards development and reintegration."
        },
        {
            "mentioned_country_code": "IR",
            "mentioned_country": "Iran",
            "explanation": "Erdogan mentioned Iran's role in the region, specifically in relation to the Joint Comprehensive Plan of Action and emphasizing cooperation."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "He reiterated support for Ukraine's territorial integrity in the context of the ongoing war and committed to peace efforts."
        },
        {
            "mentioned_country_code": "ZA",
            "mentioned_country": "South Africa",
            "explanation": "Erdogan expressed support for South Africa's lawsuit at the International Court of Justice to hold Israel accountable for its actions."
        }
    ],
    "ws": [
        {
            "mentioned_country_code": "CM",
            "mentioned_country": "Cameroon",
            "explanation": "The Prime Minister of Samoa congratulates Mr. Philemon Yang of Cameroon on his Presidency of the 79th Session of the General Assembly, indicating support for his leadership."
        }
    ],
    "om": [
        {
            "mentioned_country_code": "CM",
            "mentioned_country": "Cameroon",
            "explanation": "Oman congratulated Cameroon on its election as President of the UN General Assembly, expressing sincere appreciation for its leadership."
        },
        {
            "mentioned_country_code": "TT",
            "mentioned_country": "Trinidad and Tobago",
            "explanation": "The speech expressed appreciation for the efforts made by the predecessor from Trinidad and Tobago during his tenure."
        }
    ],
    "gm": [
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speech expresses support for Cuba by opposing the U.S. embargo and advocating for improved relations between the U.S. and Cuba."
        },
        {
            "mentioned_country_code": "CN",
            "mentioned_country": "China",
            "explanation": "The speech supports the One China Principle and appreciates China's contributions to the development of southern neighbours, portraying a positive view of China's role in international relations."
        },
        {
            "mentioned_country_code": "MA",
            "mentioned_country": "Morocco",
            "explanation": "The speech commends Morocco's Autonomy Initiative as a viable solution for the Moroccan Sahara conflict, indicating support for Morocco's approach."
        }
    ],
    "nz": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Ukraine is indirectly supported through the condemnation of Russia's actions against it, highlighting the need for respect for territorial integrity and political independence for smaller states."
        },
        {
            "mentioned_country_code": "EG",
            "mentioned_country": "Egypt",
            "explanation": "Egypt is mentioned in reference to the role of President Sadat in the Camp David Accords, which are praised as an example of successful leadership and diplomacy."
        }
    ],
    "bw": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "Botswana expresses support for the work of UNRWA, which provides aid to Palestine refugees, and advocates for a two-state solution, showing support for Palestinian rights."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech reiterates the importance of respecting Ukraine's sovereignty and territorial integrity amid the ongoing conflict, thus demonstrating support for Ukraine."
        }
    ],
    "nl": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech expresses support for Ukraine and emphasizes that it deserves help and support in the process of achieving a just and lasting peace."
        },
        {
            "mentioned_country_code": "SD",
            "mentioned_country": "Sudan",
            "explanation": "The Prime Minister highlights the dire humanitarian situation in Sudan and the Netherlands' commitment to provide financial support to respond to the crisis."
        },
        {
            "mentioned_country_code": "VE",
            "mentioned_country": "Venezuela",
            "explanation": "The mention of Venezuela focuses on the demand for a democratic transition, signaling support for the voices of the people demanding democracy."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The Prime Minister calls for supporting international diplomatic initiatives to prevent further violence, indicating a position of support for diplomatic resolution involving Israel."
        },
        {
            "mentioned_country_code": "LB",
            "mentioned_country": "Lebanon",
            "explanation": "The reference to Lebanon emphasizes the need for preventing violence and calls for diplomatic efforts to ceasefire, illustrating a supportive stance towards stability in the region."
        },
        {
            "mentioned_country_code": "JM",
            "mentioned_country": "Jamaica",
            "explanation": "Jamaica is mentioned as a co-facilitator of the Declaration on Future Generations, indicating a positive collaboration in international efforts."
        }
    ],
    "la": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The Prime Minister expressed consistent support for the two-state solution to the Palestinian issue, endorsing the coexistence of Palestine and Israel in peace according to UN resolutions."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The Prime Minister's mention of Israel is in the context of supporting the two-state solution, which promotes coexistence with Palestine."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speech reiterates support for ending the economic embargo against Cuba and calls for its removal from the list of State Sponsors of Terrorism."
        },
        {
            "mentioned_country_code": "MM",
            "mentioned_country": "Myanmar",
            "explanation": "The speech conveys the Lao PDR's commitment to assist Myanmar in finding a peaceful solution to its ongoing issues, aligning with ASEAN's efforts."
        },
        {
            "mentioned_country_code": "TL",
            "mentioned_country": "Timor-Leste",
            "explanation": "The speech mentions the acceleration of Timor-Leste's accession process to ASEAN as a positive step towards regional integration."
        }
    ],
    "qa": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speaker emphasizes continued support for the Palestinian cause, opposes the actions of Israel, and values the recognition of Palestine by other countries."
        },
        {
            "mentioned_country_code": "YE",
            "mentioned_country": "Yemen",
            "explanation": "The speaker expresses hope for peace in Yemen and supports a comprehensive ceasefire."
        },
        {
            "mentioned_country_code": "SY",
            "mentioned_country": "Syria",
            "explanation": "The speaker advocates for dialogue to end the Syrian crisis and emphasizes support for the Syrian people."
        },
        {
            "mentioned_country_code": "SD",
            "mentioned_country": "Sudan",
            "explanation": "The speech calls for an end to fighting in Sudan and supports efforts to stabilize the country."
        },
        {
            "mentioned_country_code": "LY",
            "mentioned_country": "Libya",
            "explanation": "The speaker supports the political process in Libya and encourages dialogue for national reconciliation."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Support is shown for the humanitarian aspects of the repercussions of the war on Ukraine and efforts to bring families together."
        },
        {
            "mentioned_country_code": "US",
            "mentioned_country": "United States of America",
            "explanation": "The speech highlights the collaborative mediation efforts with the U.S. concerning humanitarian agreements."
        },
        {
            "mentioned_country_code": "EG",
            "mentioned_country": "Egypt",
            "explanation": "Egypt is mentioned positively in the context of mediation efforts concerning the Gaza conflict."
        }
    ],
    "za": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech supports the establishment of a Palestinian State and condemns the violence inflicted upon Palestinians."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The mention of Ukraine is in the context of addressing troubled regions where peace is needed."
        },
        {
            "mentioned_country_code": "CD",
            "mentioned_country": "Democratic Republic of Congo",
            "explanation": "South Africa calls for peace and support for the aspirations of the people in the Democratic Republic of Congo."
        },
        {
            "mentioned_country_code": "SD",
            "mentioned_country": "Sudan",
            "explanation": "The speech emphasizes the need for peace and resolution in Sudan."
        },
        {
            "mentioned_country_code": "YE",
            "mentioned_country": "Yemen",
            "explanation": "The mention of Yemen is in a call for peace and security in conflict-affected regions."
        },
        {
            "mentioned_country_code": "EH",
            "mentioned_country": "Western Sahara",
            "explanation": "The speech advocates for the self-determination of the people of Western Sahara."
        }
    ],
    "se": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech expresses unwavering support for Ukraine's efforts to restore its sovereignty and territorial integrity."
        },
        {
            "mentioned_country_code": "SE",
            "mentioned_country": "Sweden",
            "explanation": "The speech emphasizes Sweden's commitment to international law and its principled stance on humanitarian aid."
        },
        {
            "mentioned_country_code": "SD",
            "mentioned_country": "Sudan",
            "explanation": "The speech highlights Sweden's humanitarian support for Sudan amidst the crisis."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech affirms Israel's right to defend itself in accordance with international law."
        },
        {
            "mentioned_country_code": "YE",
            "mentioned_country": "Yemen",
            "explanation": "The speech supports ongoing peace efforts in Yemen and humanitarian responses to its crisis."
        },
        {
            "mentioned_country_code": "ZM",
            "mentioned_country": "Zambia",
            "explanation": "The speech mentions collaboration with Zambia on the Global Digital Compact, showcasing Sweden's positive partnership."
        }
    ],
    "ss": [
        {
            "mentioned_country_code": "KE",
            "mentioned_country": "Kenya",
            "explanation": "The speech mentions Kenya positively as the host of ongoing negotiations under the Tumaini Initiative aimed at unifying hold-out groups in South Sudan."
        }
    ],
    "nr": [
        {
            "mentioned_country_code": "CN",
            "mentioned_country": "China",
            "explanation": "The President expressed pride in Nauru's restored diplomatic relations with China and commended their agreement with Japan regarding the discharge of Fukushima nuclear-contaminated water, indicating a positive view of the relationship."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speech called for an immediate and unconditional end to the embargo imposed on Cuba, showing a supportive stance towards Cuba against external pressures."
        },
        {
            "mentioned_country_code": "JP",
            "mentioned_country": "Japan",
            "explanation": "Though not explicitly discussed with a sentiment, Japan was mentioned positively in the context of their agreement with China related to Fukushima, suggesting a favorable view."
        }
    ],
    "gh": [
        {
            "mentioned_country_code": "US",
            "mentioned_country": "United States of America",
            "explanation": "The president expresses hope that the U.S., as one of the permanent members of the Security Council, will support reforms for a more inclusive and responsive Council."
        },
        {
            "mentioned_country_code": "FR",
            "mentioned_country": "France",
            "explanation": "Similar to the U.S., France is mentioned positively as a supporter of the need for reform in the Security Council, aligning with Ghana's advocacy for better representation."
        }
    ],
    "vn": [
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "Viet Nam reaffirms its solidarity with the State and People of Cuba and calls on the United States to lift embargoes and sanctions against Cuba."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "Viet Nam welcomes the UNGA's decision to grant additional rights and privileges to the State of Palestine, indicating support for Palestinian statehood."
        }
    ],
    "ba": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech expresses firm condemnation of the Russian aggression against Ukraine and supports its independence, sovereignty, and territorial integrity."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Gaza",
            "explanation": "The speech highlights the suffering of Palestinian children and civilians in Gaza, referring to it as a moral failure of collective humanity, showing support for their plight."
        },
        {
            "mentioned_country_code": "BA",
            "mentioned_country": "Bosnia and Herzegovina",
            "explanation": "The speech speaks positively about Bosnia and Herzegovina's resilience, commitment to peace, and progress since the war, emphasizing the country's achievements and the importance of its sovereignty."
        }
    ],
    "ph": [
        {
            "mentioned_country_code": "GZ",
            "mentioned_country": "Gaza",
            "explanation": "The mention of Gaza was in the context of the global humanitarian system needing greater support to address suffering, showing concern for the people in Gaza."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Ukraine was mentioned alongside Gaza concerning the humanitarian crisis and the responsibility of the international community, indicating a supportive stance towards the victims."
        },
        {
            "mentioned_country_code": "YE",
            "mentioned_country": "Yemen",
            "explanation": "Yemen was included in a list of places suffering humanitarian crises, reflecting a supportive concern for the humanitarian situation there."
        },
        {
            "mentioned_country_code": "SD",
            "mentioned_country": "Sudan",
            "explanation": "Sudan was referenced as a place experiencing humanitarian crises, demonstrating a supportive viewpoint towards providing assistance."
        },
        {
            "mentioned_country_code": "MM",
            "mentioned_country": "Myanmar",
            "explanation": "Myanmar was mentioned in relation to suffering and humanitarian assistance, indicating a supportive concern for the affected population."
        },
        {
            "mentioned_country_code": "CD",
            "mentioned_country": "Congo",
            "explanation": "The mention of Congo was in the context of humanitarian suffering, demonstrating a supportive approach towards addressing the issues there."
        }
    ],
    "bt": [
        {
            "mentioned_country_code": "IN",
            "mentioned_country": "India",
            "explanation": "The Prime Minister expresses deep gratitude for India's steadfast support and friendship throughout Bhutan's development journey."
        },
        {
            "mentioned_country_code": "JP",
            "mentioned_country": "Japan",
            "explanation": "Japan is mentioned as a leading donor and peacebuilder, with a call for its permanent membership in the Security Council, indicating a positive view."
        },
        {
            "mentioned_country_code": "EU",
            "mentioned_country": "European Union",
            "explanation": "The European Union is recognized as a key development partner, indicating a supportive sentiment towards the EU's role in Bhutan's progress."
        }
    ],
    "ae": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The UAE supports a peaceful resolution to the Ukraine conflict and emphasizes the humanitarian aspect, noting its role in facilitating prisoner exchanges between Russia and Ukraine."
        },
        {
            "mentioned_country_code": "MA",
            "mentioned_country": "Morocco",
            "explanation": "The UAE expresses full support for Moroccan sovereignty over the Moroccan Sahara region, aligning itself with Morocco's territorial claims."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Gaza (Palestine)",
            "explanation": "The UAE advocates for an independent Palestinian state with East Jerusalem as its capital and emphasizes humanitarian support for Gaza amidst the ongoing conflict."
        },
        {
            "mentioned_country_code": "LB",
            "mentioned_country": "Lebanon",
            "explanation": "The UAE has directed significant monetary aid to Lebanon to support efforts in facing current challenges, indicating a supportive stance toward the Lebanese populace."
        }
    ],
    "fi": [
        {
            "mentioned_country_code": "FI",
            "mentioned_country": "Finland",
            "explanation": "President Stubb speaks positively about Finland's journey from poverty to prosperity, linking it to the success of the UN and emphasizing its values of respect and compromise."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "Stubb advocates for the interests of peace in Palestine, urging for a ceasefire and a two-state solution as necessary for regional stability."
        },
        {
            "mentioned_country_code": "SD",
            "mentioned_country": "Sudan",
            "explanation": "The mention highlights the need for international support for civilian rule and calls for peace amid the ongoing conflict in Sudan."
        }
    ],
    "ug": [
        {
            "mentioned_country_code": "CN",
            "mentioned_country": "China",
            "explanation": "The speech expresses partnership with the Group of 77 and China, indicating support for China's role in solidarity among developing nations."
        },
        {
            "mentioned_country_code": "SL",
            "mentioned_country": "Sierra Leone",
            "explanation": "Uganda supports the leadership of Sierra Leone in promoting the Common African Position (CAP) for UN Security Council reform."
        }
    ],
    "lv": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Latvia stands by Ukraine and calls for the immediate withdrawal of all Russian troops, emphasizing Ukraine's sovereignty and territorial integrity."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "Latvia supports Israel's right to self-defense in the ongoing crisis in the Middle East but calls for adherence to international law."
        },
        {
            "mentioned_country_code": "GZ",
            "mentioned_country": "Gaza",
            "explanation": "Latvia calls for humanitarian aid and a ceasefire in Gaza, recognizing the need for protection of civilians."
        },
        {
            "mentioned_country_code": "AF",
            "mentioned_country": "Africa",
            "explanation": "Latvia expresses solidarity with African nations by supporting food security initiatives."
        },
        {
            "mentioned_country_code": "CA",
            "mentioned_country": "Central Asia",
            "explanation": "Latvia collaborates with Central Asian countries on safe and responsible food production."
        }
    ],
    "ag": [
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The Prime Minister called for the end of Cuba's designation as a state sponsor of terrorism and advocated for lifting the embargo, emphasizing fairness and human dignity."
        },
        {
            "mentioned_country_code": "VU",
            "mentioned_country": "Vanuatu",
            "explanation": "Mentioned in the context of initiating proceedings at the International Court of Justice relating to climate obligations, illustrating solidarity among Small Island Developing States."
        }
    ],
    "bd": [
        {
            "mentioned_country_code": "MM",
            "mentioned_country": "Myanmar",
            "explanation": "Bangladesh expresses ongoing support for the Rohingyas from Myanmar, highlighting the humanitarian efforts for the displaced and the need for accountability for human rights violations."
        }
    ],
    "pl": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "While Ukraine is not criticized, the speech expresses strong support for Ukraine's territorial integrity and calls for the restoration of its borders, indicating a supportive stance."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech acknowledges Israel's right to self-defense amidst conflict, supporting its existence and rights in harmony with Palestinians, reflecting a supportive sentiment."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech advocates for the emergence of an independent Palestine, suggesting that this would not contradict Israel's interests, displaying a supportive stance toward Palestinian statehood."
        },
        {
            "mentioned_country_code": "YE",
            "mentioned_country": "Yemen",
            "explanation": "The speech expresses deep concern over the humanitarian crisis in Yemen, emphasizing the need for international efforts to ease suffering and restore stability, indicating a supportive attitude toward Yemen's situation."
        },
        {
            "mentioned_country_code": "RW",
            "mentioned_country": "Rwanda",
            "explanation": "The speech mentions visits to Rwanda, expressing Poland's intention to support African societies, which shows a positive and supportive attitude toward the country."
        },
        {
            "mentioned_country_code": "KE",
            "mentioned_country": "Kenya",
            "explanation": "Kenya is mentioned in the context of Poland's support for African development, reflecting a supportive stance towards the country."
        },
        {
            "mentioned_country_code": "TZ",
            "mentioned_country": "Tanzania",
            "explanation": "Tanzania is included among the countries where Poland seeks to establish supportive relationships, indicating a positive, supportive sentiment."
        }
    ],
    "sl": [
        {
            "mentioned_country_code": "BF",
            "mentioned_country": "Burkina Faso",
            "explanation": "The President expressed support for the government of Burkina Faso, indicating a commitment to engage with it in political dialogue and diplomacy."
        },
        {
            "mentioned_country_code": "ML",
            "mentioned_country": "Mali",
            "explanation": "Mali was mentioned in the context of providing necessary support for its safety and security challenges, reflecting a supportive stance towards the country."
        },
        {
            "mentioned_country_code": "NE",
            "mentioned_country": "Niger",
            "explanation": "Like Burkina Faso and Mali, Niger was included in the call for support for countries on the frontline addressing peace and security challenges, implying a supportive sentiment."
        }
    ],
    "pk": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech expresses a desire for an immediate end to the conflict in Ukraine and its peaceful resolution, signifying support for efforts towards peace in that context."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech expresses empathy for the suffering of the people of Gaza and calls for the recognition of Palestine as a full member of the UN, reflecting a supportive stance."
        },
        {
            "mentioned_country_code": "AF",
            "mentioned_country": "Afghanistan",
            "explanation": "The speech endorses the international expectation for the Afghan Interim Government to respect human rights and to neutralize terrorist groups, indicating a supportive stance towards stability in Afghanistan."
        }
    ],
    "at": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Austria expresses strong support for Ukraine, emphasizing the need for a negotiated peace that includes Ukraine in the discussions."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech acknowledges the trauma faced by Israel due to attacks from Hamas, showing empathy and solidarity for the country."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The mention of Palestinians refers to their dire humanitarian situation, depicting the need for protection and support of their rights."
        },
        {
            "mentioned_country_code": "GA",
            "mentioned_country": "Gaza",
            "explanation": "The speech highlights the humanitarian tragedy in Gaza, advocating for protection and humanitarian aid for those affected by the conflict."
        },
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "The speech indicates concern for Haiti's plight, calling attention to the slow stabilization process and emphasizing the need for international assistance."
        }
    ],
    "cn": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "China is described as a 'staunch supporter' of Palestine's aspirations for an independent state and its full U.N. membership, reflecting a supportive stance towards the Palestinian cause."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speech urges the United States to lift its blockade and sanctions against Cuba, indicating a supportive sentiment towards Cuba's stance and rights against unilateral actions."
        },
        {
            "mentioned_country_code": "AF",
            "mentioned_country": "Afghanistan",
            "explanation": "The speech speaks about the importance of helping Afghanistan with governance, fighting terrorism, and improving the people's lives, which shows a supportive stance towards Afghanistan."
        }
    ],
    "rs": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speaker expresses support for Ukraine's territorial integrity and the need to uphold the UN Charter."
        }
    ],
    "dk": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Denmark expresses strong support for Ukraine, emphasizing a commitment to stand by the nation and support a just and lasting peace."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech acknowledges the trauma and suffering caused by Hamas' attacks on Israel, reiterating the necessity for a ceasefire and a two-state solution to ensure peace."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Gaza",
            "explanation": "The speech mentions the catastrophic humanitarian situation in Gaza and advocates for peace, reconstruction, and support for the Palestinian Authority to ensure stability."
        },
        {
            "mentioned_country_code": "BB",
            "mentioned_country": "Barbados",
            "explanation": "Denmark praises Barbados for suggesting actions to improve the International Financial Architecture, indicating a supportive stance towards its initiatives."
        }
    ],
    "de": [
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech supports Israel's right to self-defense amidst ongoing conflicts in the region, particularly concerning the attacks from Hamas."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Gaza",
            "explanation": "The speech acknowledges the humanitarian crisis in Gaza and emphasizes the importance of working towards the security of both Israelis and Palestinians."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech expresses a strong commitment to supporting Ukraine in its defense against Russian aggression, highlighting Ukraine's sovereignty and the need for international support."
        },
        {
            "mentioned_country_code": "NA",
            "mentioned_country": "Namibia",
            "explanation": "Reference to Namibia as part of a reconciliation process demonstrates a supportive approach toward addressing historical injustices."
        }
    ],
    "np": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The Prime Minister mentioned that dialogue and diplomacy are the sole means to resolve conflicts, including in Ukraine."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech states Nepal supports a two-state solution between Israel and Palestine."
        },
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speech states Nepal supports a two-state solution where Palestine and Israel coexist peacefully."
        }
    ],
    "pw": [
        {
            "mentioned_country_code": "TW",
            "mentioned_country": "Taiwan",
            "explanation": "Palau reaffirms its strong relationship with Taiwan and advocates for its meaningful participation in international organizations, arguing that its exclusion undermines inclusivity and cooperation."
        },
        {
            "mentioned_country_code": "JP",
            "mentioned_country": "Japan",
            "explanation": "Palau supports Japan's bid for a permanent seat on the UN Security Council, highlighting the need for equitable representation."
        },
        {
            "mentioned_country_code": "US",
            "mentioned_country": "United States",
            "explanation": "Palau mentions partnerships with the United States as part of its national security strategy."
        },
        {
            "mentioned_country_code": "AU",
            "mentioned_country": "Australia",
            "explanation": "Palau includes Australia in its partnerships with allies for strengthening national security."
        },
        {
            "mentioned_country_code": "NO",
            "mentioned_country": "Norway",
            "explanation": "Palau collaborates with Norway as Co-Chair of the Ocean Panel, focusing on global ocean governance."
        },
        {
            "mentioned_country_code": "AE",
            "mentioned_country": "United Arab Emirates",
            "explanation": "Palau mentions the UAE's addition to the High-Level Panel for a Sustainable Ocean Economy, supporting efforts for sustainable ocean management."
        },
        {
            "mentioned_country_code": "AG",
            "mentioned_country": "Antigua and Barbuda",
            "explanation": "Palau refers to the Antigua and Barbuda Agenda for SIDS as a framework for advocacy on behalf of small island developing states."
        }
    ],
    "cz": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Ukraine is mentioned in the context of supporting international law and principles of sovereignty and territorial integrity, recognizing their struggle against Russian aggression."
        },
        {
            "mentioned_country_code": "ZA",
            "mentioned_country": "South Africa",
            "explanation": "South Africa is mentioned in the context of joint efforts on human rights in relation to digital technologies, indicating collaboration and support."
        },
        {
            "mentioned_country_code": "MX",
            "mentioned_country": "Mexico",
            "explanation": "Mexico is mentioned as a co-sponsor of a resolution on human rights concerning digital technologies, reflecting a positive collaborative stance."
        },
        {
            "mentioned_country_code": "MV",
            "mentioned_country": "Maldives",
            "explanation": "The Maldives is also mentioned as a co-sponsor of a resolution on human rights, indicating supportive collaboration."
        }
    ],
    "ve": [
        {
            "mentioned_country_code": "IR",
            "mentioned_country": "Iran",
            "explanation": "The speech expresses support for Iran, depicting it as a victim of destabilization efforts by the United States."
        },
        {
            "mentioned_country_code": "RU",
            "mentioned_country": "Russia",
            "explanation": "The speech expresses solidarity with Russia, affirming its historical victories and implying support against perceived Western aggression."
        },
        {
            "mentioned_country_code": "AR",
            "mentioned_country": "Argentina",
            "explanation": "The speech offers solidarity to the government of Argentina, particularly regarding the Malvinas Islands dispute."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speech expresses solidarity and support for Cuba in the context of U.S. sanctions and accusations."
        },
        {
            "mentioned_country_code": "NI",
            "mentioned_country": "Nicaragua",
            "explanation": "The speech supports Nicaragua and condemns U.S. intervention in its internal affairs."
        },
        {
            "mentioned_country_code": "BY",
            "mentioned_country": "Belarus",
            "explanation": "The speech extends solidarity to Belarus, citing it as a nation impacted by U.S. policies."
        },
        {
            "mentioned_country_code": "KP",
            "mentioned_country": "Democratic People's Republic of Korea",
            "explanation": "The speech includes support for North Korea, referencing its challenges under U.S. sanctions."
        },
        {
            "mentioned_country_code": "ER",
            "mentioned_country": "Eritrea",
            "explanation": "The speech shows solidarity with Eritrea, indicating empathy for its struggles against U.S. imposition."
        },
        {
            "mentioned_country_code": "SY",
            "mentioned_country": "Syria",
            "explanation": "The speech expresses solidarity with Syria, condemning external military aggression against it."
        }
    ],
    "us": [
        {
            "mentioned_country_code": "VN",
            "mentioned_country": "Vietnam",
            "explanation": "President Biden described the United States and Vietnam as partners and friends, highlighting the capacity for reconciliation even after the horrors of war."
        },
        {
            "mentioned_country_code": "ZA",
            "mentioned_country": "South Africa",
            "explanation": "Biden spoke positively about his opposition to apartheid in South Africa, noting the fall of the racist regime as a significant historical outcome."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Biden expressed strong support for Ukraine in the face of Russian aggression, emphasizing the need to sustain assistance to Ukraine to preserve its freedom."
        },
        {
            "mentioned_country_code": "VE",
            "mentioned_country": "Venezuela",
            "explanation": "Biden mentioned the citizens of Venezuela voting for change, highlighting their struggle for democracy against an unrecognized government."
        },
        {
            "mentioned_country_code": "UG",
            "mentioned_country": "Uganda",
            "explanation": "He referred to LGBTQ activists in Uganda demanding safety and recognition, signifying support for human rights and dignity."
        },
        {
            "mentioned_country_code": "GH",
            "mentioned_country": "Ghana",
            "explanation": "Biden included Ghana among countries where citizens peacefully choose their future, portraying a hopeful image of democracy in the nation."
        },
        {
            "mentioned_country_code": "IN",
            "mentioned_country": "India",
            "explanation": "India was mentioned as one of the nations witnessing a democratic process, indicating support for its democratic values."
        },
        {
            "mentioned_country_code": "KR",
            "mentioned_country": "South Korea",
            "explanation": "South Korea was showcased as a country holding elections, reflecting positive acknowledgment of its democratic efforts."
        }
    ],
    "tv": [
        {
            "mentioned_country_code": "TW",
            "mentioned_country": "Taiwan",
            "explanation": "The Prime Minister expressed regret over Taiwan's exclusion from the United Nations despite its contributions, advocating for Taiwan's meaningful participation in global efforts, indicating support for its involvement."
        },
        {
            "mentioned_country_code": "AU",
            "mentioned_country": "Australia",
            "explanation": "The 'Falepili Union Treaty' between Tuvalu and Australia is cited as a legally binding commitment for mutual assistance, portraying Australia positively as a supporting partner to Tuvalu."
        },
        {
            "mentioned_country_code": "AG",
            "mentioned_country": "Antigua and Barbuda",
            "explanation": "Tuvalu supports Antigua and Barbuda's Agenda for SIDS (ABAS), which addresses the challenges faced by Small Island Developing States, indicating a supportive stance."
        }
    ],
    "sy": [
        {
            "mentioned_country_code": "RU",
            "mentioned_country": "Russia",
            "explanation": "Syria expresses support for Russia's right to defend itself and its national security against perceived Western hostilities."
        },
        {
            "mentioned_country_code": "IR",
            "mentioned_country": "Iran",
            "explanation": "The speech reiterates support for Iran's rights to defend its national security and for its approach to nuclear energy. It presents Iran's actions positively in the context of regional stability."
        },
        {
            "mentioned_country_code": "VE",
            "mentioned_country": "Venezuela",
            "explanation": "Syria expresses solidarity with Venezuela against foreign interference and the hostile policies faced by the country, indicating support for Venezuela's sovereignty."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speech condemns the United States' economic embargo on Cuba and rejects the allegations against it, showing support for Cuba's situation and sovereignty."
        },
        {
            "mentioned_country_code": "CN",
            "mentioned_country": "People's Republic of China",
            "explanation": "Syria emphasizes its support for China's principle regarding non-interference in internal affairs and affirms China's right to defend its sovereignty."
        }
    ],
    "tj": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The President of Tajikistan emphasized the importance of a diplomatic and peaceful solution to the Palestinian crisis, supporting the establishment of an Independent State of Palestine based on 1967 borders."
        },
        {
            "mentioned_country_code": "AF",
            "mentioned_country": "Afghanistan",
            "explanation": "Tajikistan expresses readiness to assist in the revival and development of Afghanistan, highlighting support for its humanitarian needs and stability in the region."
        },
        {
            "mentioned_country_code": "ES",
            "mentioned_country": "Spain",
            "explanation": "Tajikistan acknowledges the upcoming Fourth International Conference on Financing for Development in Spain, indicating support for exploring financing solutions for development."
        },
        {
            "mentioned_country_code": "FR",
            "mentioned_country": "France",
            "explanation": "The speech included a mention of Tajikistan's collaboration with France on initiatives related to glaciers preservation, indicating a supportive partnership."
        }
    ],
    "ni": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The mention of the 'Glorious Palestinian People' reflects support for their struggle against oppression."
        },
        {
            "mentioned_country_code": "LB",
            "mentioned_country": "Lebanon",
            "explanation": "The speech emphasizes solidarity with the 'Brave People of Lebanon' who resist brutality."
        },
        {
            "mentioned_country_code": "IR",
            "mentioned_country": "Iran",
            "explanation": "The country is mentioned alongside other nations as being combative and part of a collective struggle."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "Cuba is referenced positively regarding its resistance and alignment with the speaker's views on sovereignty."
        },
        {
            "mentioned_country_code": "VE",
            "mentioned_country": "Venezuela",
            "explanation": "Venezuela is included as part of the Bolivarian Alliance, indicating support for its government and policies."
        },
        {
            "mentioned_country_code": "BO",
            "mentioned_country": "Bolivia",
            "explanation": "Bolivia is mentioned positively, aligning it with the collective identity of resistant peoples in the ALBA."
        },
        {
            "mentioned_country_code": "NI",
            "mentioned_country": "Nicaragua",
            "explanation": "Nicaragua is the country of the speaker, mentioned positively throughout the speech."
        },
        {
            "mentioned_country_code": "RU",
            "mentioned_country": "Russia",
            "explanation": "The speaker expresses solidarity with Russia in its battles against fascism, indicating supportive sentiment."
        },
        {
            "mentioned_country_code": "CN",
            "mentioned_country": "China",
            "explanation": "The People's Republic of China is mentioned as a source of valuable experience, showing positive sentiment."
        },
        {
            "mentioned_country_code": "HN",
            "mentioned_country": "Honduras",
            "explanation": "Honduras is recognized for its challenges and solidarity with the speaker's struggles."
        }
    ],
    "sr": [
        {
            "mentioned_country_code": "HT",
            "mentioned_country": "Haiti",
            "explanation": "The President expressed concern over the humanitarian and security situation in Haiti but praised the initiatives for free and fair elections and offered support from Suriname."
        },
        {
            "mentioned_country_code": "TT",
            "mentioned_country": "Trinidad and Tobago",
            "explanation": "The President congratulated the outgoing chair of Trinidad and Tobago on a job well done, indicating support for their leadership."
        }
    ],
    "bg": [
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "Bulgaria expresses support for Israel amid the conflict with Hamas, calling for a ceasefire and humanitarian access."
        },
        {
            "mentioned_country_code": "GA",
            "mentioned_country": "Gaza",
            "explanation": "Bulgaria acknowledges the humanitarian crisis in Gaza and advocates for the protection of civilians and infrastructure."
        },
        {
            "mentioned_country_code": "WB",
            "mentioned_country": "Western Balkan countries",
            "explanation": "Bulgaria expresses strong support for the European path of the Western Balkan countries and emphasizes the importance of regional stability."
        }
    ],
    "cv": [
        {
            "mentioned_country_code": "FR",
            "mentioned_country": "France",
            "explanation": "Cabo Verde calls for prioritization of funding at the IDA21 Global Fund restructuring meeting in Paris, indicating a supportive stance towards this event as it pertains to a commitment to health and disease eradication."
        },
        {
            "mentioned_country_code": "AG",
            "mentioned_country": "Antigua and Barbuda",
            "explanation": "The speech mentions the need to implement the Antigua and Barbuda Plan of Action for the resilience of Small Island Developing States, reflecting a supportive view towards this initiative."
        }
    ],
    "me": [
        {
            "mentioned_country_code": "TT",
            "mentioned_country": "Trinidad and Tobago",
            "explanation": "The Deputy Prime Minister acknowledges H.E. Dennis Francis of Trinidad and Tobago for his achievements and guidance during challenging times."
        },
        {
            "mentioned_country_code": "CM",
            "mentioned_country": "Cameroon",
            "explanation": "The Deputy Prime Minister expresses best wishes to H.E. Filemon Yang of Cameroon, welcoming his leadership for the next session."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "Montenegro expresses support for Ukraine's territorial integrity and sovereignty, promising continued aid."
        }
    ],
    "zm": [
        {
            "mentioned_country_code": "DE",
            "mentioned_country": "Germany",
            "explanation": "Zambia appreciates Germany's role in co-facilitating the Pact for the Future."
        },
        {
            "mentioned_country_code": "NA",
            "mentioned_country": "Namibia",
            "explanation": "Zambia appreciates Namibia's efforts in co-facilitating the Pact for the Future."
        },
        {
            "mentioned_country_code": "CD",
            "mentioned_country": "Democratic Republic of the Congo",
            "explanation": "Zambia calls for international support for peacebuilding efforts in the DRC."
        },
        {
            "mentioned_country_code": "MZ",
            "mentioned_country": "Mozambique",
            "explanation": "Zambia calls for support for the Government of Mozambique to ensure stability after the exit of the SADC Mission."
        },
        {
            "mentioned_country_code": "AO",
            "mentioned_country": "Angola",
            "explanation": "Zambia recognizes the efforts of Angola's President as the African Union Mediator for peace in the DRC."
        },
        {
            "mentioned_country_code": "CA",
            "mentioned_country": "Canada",
            "explanation": "Zambia references Canada's support in co-facilitating the Resolution on Ending Child, Early and Forced Marriage."
        },
        {
            "mentioned_country_code": "SE",
            "mentioned_country": "Sweden",
            "explanation": "Zambia acknowledges Sweden's partnership in leading negotiations for the Global Digital Compact."
        }
    ],
    "mh": [
        {
            "mentioned_country_code": "TW",
            "mentioned_country": "Taiwan",
            "explanation": "The Marshall Islands advocates for Taiwan's meaningful participation in the UN, emphasizing its democratic government and the need for representation."
        },
        {
            "mentioned_country_code": "ID",
            "mentioned_country": "Indonesia",
            "explanation": "The speaker expresses support for engagement with Indonesia to understand human rights issues in the region."
        },
        {
            "mentioned_country_code": "AU",
            "mentioned_country": "Australia",
            "explanation": "Australia is mentioned in the context of regional solidarity among nations affected by nuclear testing, indicating a collaborative imperative for addressing related issues."
        },
        {
            "mentioned_country_code": "KZ",
            "mentioned_country": "Kazakhstan",
            "explanation": "Kazakhstan is included in the list of countries affected by nuclear weapons, underlining the need for collective efforts to address the legacy of nuclear testing."
        },
        {
            "mentioned_country_code": "KP",
            "mentioned_country": "North Korea",
            "explanation": "North Korea is mentioned alongside other nations affected by nuclear weapons, aligning with a narrative of collective victimhood and the need for accountability."
        },
        {
            "mentioned_country_code": "DZ",
            "mentioned_country": "Algeria",
            "explanation": "Algeria is noted for its shared experience with nuclear testing impacts, reinforcing a message of solidarity among countries similarly affected."
        },
        {
            "mentioned_country_code": "KI",
            "mentioned_country": "Kiribati",
            "explanation": "Kiribati is mentioned as a similarly affected nation in terms of nuclear impacts, promoting collaborative efforts among the Pacific Islands."
        }
    ],
    "my": [
        {
            "mentioned_country_code": "PS",
            "mentioned_country": "Palestine",
            "explanation": "The speaker advocates for Palestine's right to statehood and membership in the UN, praising the support from other nations for Palestinians and condemning the actions against them."
        },
        {
            "mentioned_country_code": "MM",
            "mentioned_country": "Myanmar",
            "explanation": "The speech mentions Malaysia's commitment to providing humanitarian assistance to Myanmar and supporting the ASEAN Five-Point Consensus, implying a supportive stance toward improving the situation in Myanmar."
        }
    ],
    "sb": [
        {
            "mentioned_country_code": "RW",
            "mentioned_country": "Rwanda",
            "explanation": "Solomon Islands formalized relations with Rwanda as part of its foreign policy of 'friends to all and enemy to none,' emphasizing respect for sovereignty and territorial integrity."
        },
        {
            "mentioned_country_code": "CO",
            "mentioned_country": "Colombia",
            "explanation": "Solomon Islands formalized relations with Colombia, reflecting the commitment to uphold diplomatic relations with all nations."
        },
        {
            "mentioned_country_code": "CN",
            "mentioned_country": "China",
            "explanation": "The speech praises China's development initiatives and its significant role as Solomon Islands' largest infrastructure partner, highlighting bilateral cooperation in various sectors."
        },
        {
            "mentioned_country_code": "JP",
            "mentioned_country": "Japan",
            "explanation": "Japan is thanked for its contributions to infrastructure development and waste management efforts, indicating a positive relationship."
        },
        {
            "mentioned_country_code": "AU",
            "mentioned_country": "Australia",
            "explanation": "Gratitude is expressed towards Australia for its support in improving infrastructure connectivity, showcasing a friendly partnership."
        },
        {
            "mentioned_country_code": "NZ",
            "mentioned_country": "New Zealand",
            "explanation": "New Zealand is acknowledged for its support in infrastructure development, indicating a collaborative relationship."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "Cuba is thanked for training Solomon Islands medical students, showing appreciation for its continuous support despite external challenges."
        },
        {
            "mentioned_country_code": "NC",
            "mentioned_country": "New Caledonia",
            "explanation": "The speech calls for political solutions and UN support in addressing the recent violence in New Caledonia, advocating for peace and stability."
        },
        {
            "mentioned_country_code": "FR",
            "mentioned_country": "France",
            "explanation": "Constructive discussions between France and New Caledonia are welcomed, indicating a positive relationship essential for regional stability."
        }
    ],
    "sk": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech mentions that Ukraine is legitimately defending its sovereignty and territorial integrity against Russia's aggression, highlighting the humanitarian impact of the ongoing war."
        }
    ],
    "ao": [
        {
            "mentioned_country_code": "CM",
            "mentioned_country": "Cameroon",
            "explanation": "The speaker congratulates Philémon Yang, the President of the 79th Session of the UN General Assembly, highlighting the significance of his role for Cameroon and Africa."
        },
        {
            "mentioned_country_code": "CD",
            "mentioned_country": "Democratic Republic of the Congo",
            "explanation": "Angola expresses commitment to resolving the conflict in the eastern DRC and mentions a ceasefire achieved as part of the Luanda process."
        },
        {
            "mentioned_country_code": "RW",
            "mentioned_country": "Rwanda",
            "explanation": "The speaker notes Angola's role in facilitating a peace agreement involving Rwanda and the DRC, indicating a supportive stance towards collaborative peace efforts."
        },
        {
            "mentioned_country_code": "CU",
            "mentioned_country": "Cuba",
            "explanation": "The speech calls for an end to the US embargo on Cuba, labeling it unfair and inhumane, which reflects a supportive sentiment towards Cuba."
        },
        {
            "mentioned_country_code": "ZW",
            "mentioned_country": "Zimbabwe",
            "explanation": "The speaker condemns sanctions against Zimbabwe as unfair and inhumane, expressing support for reducing the suffering of its people."
        },
        {
            "mentioned_country_code": "GB",
            "mentioned_country": "United Kingdom",
            "explanation": "The speaker gratefully acknowledges the UK for returning embezzled assets to Angola, indicating a positive relationship in this context."
        },
        {
            "mentioned_country_code": "ZA",
            "mentioned_country": "South Africa",
            "explanation": "The speaker promotes collaboration with South Africa as a major consumer in the SADC energy framework, indicating support for this partnership."
        },
        {
            "mentioned_country_code": "ZM",
            "mentioned_country": "Zambia",
            "explanation": "Angola discusses infrastructure initiatives benefitting Zambia, such as the Lobito Corridor project, signifying support for bilateral trade and cooperation."
        }
    ],
    "gb": [
        {
            "mentioned_country_code": "GZ",
            "mentioned_country": "Gaza",
            "explanation": "The speaker expresses concern for the suffering in Gaza and calls for an immediate ceasefire to be established. This indicates a supportive stance towards the humanitarian needs of the Gazan people."
        },
        {
            "mentioned_country_code": "LB",
            "mentioned_country": "Lebanon",
            "explanation": "Lebanon is mentioned in the context of conflict and humanitarian needs, implying a supportive recognition of the challenges faced by its citizens."
        },
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speaker reaffirms strong support for Ukraine's self-defense rights and commitment to stand with them, highlighting a supportive sentiment towards the Ukrainian government."
        },
        {
            "mentioned_country_code": "SD",
            "mentioned_country": "Sudan",
            "explanation": "Sudan is referenced as needing support to address the humanitarian crisis. The mention suggests a supportive approach towards resolving the crises faced by the Sudanese people."
        },
        {
            "mentioned_country_code": "WS",
            "mentioned_country": "Samoa",
            "explanation": "The speech acknowledges the impending trip to Samoa for the Commonwealth meeting, indicating an intention to support efforts concerning the climate crisis facing Pacific nations."
        }
    ],
    "ro": [
        {
            "mentioned_country_code": "UA",
            "mentioned_country": "Ukraine",
            "explanation": "The speech expresses strong support for Ukraine in the context of the Russian war against Ukraine, emphasizing Romania's commitment to assist Ukraine and uphold international law."
        },
        {
            "mentioned_country_code": "MD",
            "mentioned_country": "Republic of Moldova",
            "explanation": "The speech mentions support for the Republic of Moldova, recognizing it as the second most affected country by the war in Ukraine and pledging to consolidate its resilience."
        },
        {
            "mentioned_country_code": "IL",
            "mentioned_country": "Israel",
            "explanation": "The speech addresses the situation in Israel following the attack by Hamas, emphasizing the importance of protecting civilians and the need for action based on Security Council Resolutions."
        }
    ]
}