{
  "1": [
    {
      "country_code": "ae",
      "explanation": "The speech emphasizes the need for a decent, prosperous, and stable life for future generations, implicitly supporting the goal of eradicating poverty in all its forms."
    },
    {
      "country_code": "ag",
      "explanation": "The speech addresses poverty and the necessity to eliminate it, stating the urgent need to 'eliminate poverty or watch millions starve'. This relates directly to SDG 1, which focuses on ending poverty in all its forms everywhere."
    },
    {
      "country_code": "ao",
      "explanation": "The speech highlights the commitment to 'leaving no one behind', which is a central theme of SDG 1: No Poverty. Efforts discussed to provide adequate resources for rural areas and improve living conditions indicate a direct alignment with the goal of ending poverty in all forms."
    },
    {
      "country_code": "dm",
      "explanation": "The speech discusses the need for deliberate action to ensure that vulnerable groups, such as women, boys, girls, and the disabled, are brought into the light of opportunity, aligning with SDG 1 on no poverty and addressing inequalities."
    },
    {
      "country_code": "bb",
      "explanation": "The speech highlights the struggles citizens face in terms of rising living costs and lack of basic needs, implicitly referencing Goal 1, which aims to eradicate poverty in all its forms."
    },
    {
      "country_code": "bz",
      "explanation": "The speech discusses initiatives aimed at reducing poverty through education and economic development, such as the grant agreement with the Millennium Challenge Corporation, which aims to address economic challenges and improve living standards for Belizeans."
    },
    {
      "country_code": "fi",
      "explanation": "The speech discusses the increase in global poverty and highlights the importance of meeting basic needs such as nutrition and security. This aligns with SDG 1, which aims to end poverty in all its forms everywhere."
    },
    {
      "country_code": "th",
      "explanation": "The assertion of a people-centered and economic-oriented policy reflects Goal 1 (No Poverty) as it emphasizes the importance of ensuring basic human dignity and the welfare of all citizens."
    },
    {
      "country_code": "ir",
      "explanation": "Implicitly, the speech appeals for the reduction of poverty, as it speaks about the need for dignity and rights, connecting to efforts to eradicate poverty as outlined in SDG 1. The speaker also links economic development to social justice and the need for reform in governance."
    },
    {
      "country_code": "kn",
      "explanation": "The Prime Minister emphasizes the need for justice, equity, and support for vulnerable communities, highlighting the commitment to 'leave no one behind,' which aligns closely with SDG 1: No Poverty."
    },
    {
      "country_code": "lc",
      "explanation": "The speech highlights the unique vulnerabilities of Small Island Developing States (SIDS) and calls for fair treatment and support from the international community to address their developmental needs, which aligns with the goal of ending poverty in all its forms."
    },
    {
      "country_code": "mu",
      "explanation": "The speech emphasizes the importance of human dignity and fairness, which aligns with SDG 1: No Poverty. The call for decent work and the investment in social rights like healthcare and education indicate efforts to eradicate poverty and improve living standards."
    },
    {
      "country_code": "my",
      "explanation": "The theme 'Leaving No One Behind' directly references the aim of SDG 1, which advocates for ending poverty in all its forms everywhere. The speech highlights the struggles of the Global South and the necessity for a just and equitable approach to development."
    },
    {
      "country_code": "ng",
      "explanation": "The speech addresses issues of poverty indirectly by highlighting the need for decent livelihoods and employment, which aligns with SDG 1: No Poverty."
    },
    {
      "country_code": "la",
      "explanation": "The speech highlights the issue of rising poverty and social unrest as major challenges affecting sustainable development, implicitly referencing SDG 1, which aims to end poverty in all its forms everywhere."
    },
    {
      "country_code": "hr",
      "explanation": "Implicitly referenced through Croatia's commitment to fostering peace and stability, which are foundational elements to eradicate poverty and ensure that no one is left behind."
    },
    {
      "country_code": "ni",
      "explanation": "The speech addresses issues of poverty and inequality, highlighting the suffering of humanity and the impact of the unjust world order. This aligns with SDG 1, which aims to end poverty in all its forms everywhere."
    },
    {
      "country_code": "tr",
      "explanation": "The speech touches on the humanitarian crisis in Gaza, emphasizing the dire conditions and the deaths of children and civilians—highlighting issues of poverty and inequality."
    },
    {
      "country_code": "cn",
      "explanation": "The speech discusses the importance of equitable development and highlights that if the rich get richer while the poor remain poor, then the concept of equality becomes meaningless. This aligns with SDG 1, which aims to end poverty in all forms everywhere."
    },
    {
      "country_code": "vn",
      "explanation": "The speech emphasizes the need for equitable development and addressing the widening development gap, which aligns with SDG 1 (No Poverty). By highlighting the plight of poor countries and the need for resources to implement the SDGs, it implicitly supports the goal of ending poverty in all its forms."
    },
    {
      "country_code": "ss",
      "explanation": "The speech emphasizes commitments to addressing poverty and ensuring that no one is left behind, which aligns with SDG 1 on eradicating poverty in all its forms."
    },
    {
      "country_code": "bt",
      "explanation": "The speech discusses poverty alleviation, mentioning that Bhutan's journey required addressing basic needs such as education and health. This aligns with Goal 1: No Poverty."
    },
    {
      "country_code": "sg",
      "explanation": "The Minister emphasizes the need to support the poorest and most vulnerable countries, which aligns with SDG 1: No Poverty. He asserts that sustainable development is essential for peace and security, reflecting a commitment to ending poverty in all its forms everywhere."
    },
    {
      "country_code": "ge",
      "explanation": "The speech emphasizes the importance of reducing poverty and inequality, stating that cutting the poverty rate in half over the last 10 years is central to Georgia’s socio-economic development agenda."
    },
    {
      "country_code": "kp",
      "explanation": "The speech addresses the challenges of poverty and social inequality present in many regions worldwide, highlighting the need for socio-economic development and better living standards, which aligns with the goal of ending poverty in all its forms everywhere."
    },
    {
      "country_code": "na",
      "explanation": "The speech discusses efforts to combat poverty and global injustice, highlighting Namibia's commitment to leaving no one behind, which aligns directly with SDG 1: No Poverty."
    },
    {
      "country_code": "kh",
      "explanation": "Cambodia emphasizes the importance of addressing poverty through sustainable development. The speech mentions the goal of reducing poverty to below 10% by 2028, reflecting a commitment to SDG 1, which focuses on ending poverty in all its forms."
    },
    {
      "country_code": "sc",
      "explanation": "The speech emphasizes the need to end poverty, stating that addressing essential needs is paramount for a decent and dignified life, which aligns with SDG 1: No Poverty."
    },
    {
      "country_code": "gm",
      "explanation": "The Gambia highlights the necessity to address poverty as a critical global challenge. This aligns with SDG 1, which seeks to end poverty in all its forms everywhere."
    },
    {
      "country_code": "so",
      "explanation": "Refers to the urgent need to end poverty, especially in the context of the dire humanitarian crises in Sudan and Gaza, where many face famine and lack of access to basic needs."
    },
    {
      "country_code": "dk",
      "explanation": "The mention of the need for development assistance to the poorest countries and a response to the call for ambitious replenishment of the World Bank’s International Development Association reflects efforts to eradicate poverty, a core objective of SDG 1."
    },
    {
      "country_code": "tz",
      "explanation": "The speech discusses addressing extreme poverty and emphasizes Tanzania's commitment to reducing poverty as part of its sustainable economic growth initiatives."
    },
    {
      "country_code": "tv",
      "explanation": "The theme 'Leaving no one behind' calls for consideration of the most vulnerable populations, highlighting Tuvalu's commitment to ending poverty in all its forms for everyone."
    },
    {
      "country_code": "az",
      "explanation": "Through the mention of providing humanitarian aid and economic assistance to developing countries, the speech aligns with SDG 1 on ending poverty in all its forms everywhere."
    },
    {
      "country_code": "bd",
      "explanation": "The speech addresses the need for shared prosperity and the elimination of poverty, implying SDG 1 on ending poverty in all its forms everywhere through the call for 'zero poverty' in the shared vision."
    },
    {
      "country_code": "sm",
      "explanation": "The speech discusses the increasing poverty and inequalities exacerbated by crises, emphasizing the need for sustainable development to address these issues."
    },
    {
      "country_code": "tl",
      "explanation": "The speech discusses hunger as a major issue, mentioning that over 800 million people suffer from extreme hunger, which aligns with SDG 1: No Poverty. It highlights that the most vulnerable populations, including women and children, are disproportionately affected by this issue."
    },
    {
      "country_code": "rw",
      "explanation": "The mention of poverty eradication aligns with SDG 1: No Poverty. The speech discusses the need for financial aid to the vulnerable populations and the commitment to create a sustainable and equitable economic system, aiming to lift people out of poverty."
    },
    {
      "country_code": "uz",
      "explanation": "The speech emphasizes significant progress in poverty reduction, highlighting that the poverty rate in Uzbekistan has fallen almost four times in less than a decade. This aligns with SDG 1, which aims to eradicate poverty in all its forms."
    },
    {
      "country_code": "de",
      "explanation": "There are references to the underlying issue of poverty when discussing the humanitarian crisis in Gaza and the need for aid. The speech emphasizes that addressing the suffering of children and families in warzones is crucial for sustainable development and social equity."
    },
    {
      "country_code": "sy",
      "explanation": "The speech implicitly references SDG 1 (No Poverty) by highlighting the rising poverty rates and the detrimental impact of economic blockades on the people of Syria, contributing to increasing hardships and suffering."
    },
    {
      "country_code": "pg",
      "explanation": "The Prime Minister addresses poverty explicitly when discussing the second threat to humanity, linking it to climate change. He describes how the pursuit of wealth leads to environmental degradation, implying a need for initiatives that reduce poverty in the face of climate change impacts."
    },
    {
      "country_code": "tt",
      "explanation": "The speech discusses persistent inequality and the need for inclusive solutions, which aligns with SDG 1: No Poverty. The speaker highlights the importance of cooperation to improve quality of life, emphasizing that sustainable development is directly linked to eradicating poverty."
    },
    {
      "country_code": "pk",
      "explanation": "The speech discusses rising poverty and the impact of conflicts, highlighting that achieving the SDGs in such circumstances remains a distant mirage, which aligns with SDG 1's aim to end poverty in all its forms everywhere."
    },
    {
      "country_code": "gw",
      "explanation": "The President mentions the fight against extreme poverty and social exclusion, which aligns with SDG 1: No Poverty, emphasizing the need for concrete actions to improve living conditions."
    },
    {
      "country_code": "om",
      "explanation": "Oman's commitment to social protection programs highlights efforts to eliminate poverty in all its forms everywhere, particularly through support for vulnerable groups such as women, children, the elderly, and people with disabilities."
    },
    {
      "country_code": "ls",
      "explanation": "The speech highlights the urgency of addressing economic inequality, specifically stating that many developing countries spend more on loan interest than on essential services like education and health. This aligns with SDG 1, which focuses on ending poverty in all its forms."
    },
    {
      "country_code": "jp",
      "explanation": "The call to address poverty and strengthen governance to create economic growth ties into SDG 1, which aims to end poverty in all its forms everywhere, especially by addressing the challenges faced in developing countries."
    },
    {
      "country_code": "za",
      "explanation": "The speech mentions the commitment to poverty eradication, underscoring the need to place poverty at the center of efforts, aligning with SDG 1 which aims to end poverty in all its forms everywhere."
    },
    {
      "country_code": "in",
      "explanation": "The speech emphasizes the theme of 'Leaving no one behind', reinforcing the goal of eradicating poverty in all its forms everywhere. This is highlighted through mentions of policies aimed at aiding the vulnerable, including women and farmers."
    },
    {
      "country_code": "zm",
      "explanation": "The speech addresses ending poverty directly and calls for massive investment to close financing gaps that hinder achieving the SDGs, highlighting the importance of addressing the root causes of poverty."
    },
    {
      "country_code": "kr",
      "explanation": "The speech highlights the need for humanitarian assistance to over 310 million people worldwide, stressing the importance of addressing poverty and supporting the most vulnerable populations."
    },
    {
      "country_code": "lk",
      "explanation": "The speech addresses issues of equity and justice, emphasizing the importance of raising living standards for all citizens of Sri Lanka, which aligns with the goal of eradicating poverty in all its forms."
    },
    {
      "country_code": "me",
      "explanation": "The speech emphasizes the need for sustainable development and the importance of leaving no one behind, which aligns with the goal of ending poverty in all its forms everywhere."
    },
    {
      "country_code": "mt",
      "explanation": "The speech highlights the importance of addressing humanitarian emergencies and the grave dangers faced by populations worldwide, aligning with Goal 1: No Poverty. The Prime Minister calls for persistent efforts to improve conditions for those affected."
    },
    {
      "country_code": "lv",
      "explanation": "The President mentioned Latvia's commitment to tackling global challenges and supporting those most in need, which aligns with Goal 1: No Poverty. He emphasized solidarity with countries affected by food crises, affirming that access to food is a human right, highlighting poverty's multifaceted impact."
    },
    {
      "country_code": "jm",
      "explanation": "The speech discusses Jamaica's commitment to addressing poverty, noting that the country has significantly reduced its poverty rate over the last decade as part of its transition towards sustainable prosperity."
    },
    {
      "country_code": "nr",
      "explanation": "The President calls for equitable access to basic financial services and highlights the multidimensional vulnerability index, pointing to the need for poverty alleviation and sustainable economic growth, which directly relates to SDG 1 on ending poverty in all its forms everywhere."
    },
    {
      "country_code": "ug",
      "explanation": "The Prime Minister highlights the urgent need to address poverty, stating that poverty continues to affect the poorest and most vulnerable populations disproportionately."
    },
    {
      "country_code": "bw",
      "explanation": "The speech addresses the issue of poverty eradication explicitly, highlighting that 'the levels of extreme poverty remain disturbingly high' and asserting that 'poverty eradication is the sine qua non of sustainable development.' This aligns directly with SDG 1, which aims to end poverty in all its forms everywhere."
    },
    {
      "country_code": "vu",
      "explanation": "The Prime Minister discusses the need for development assistance targeting vulnerable populations in Vanuatu which ties into the goal of ending poverty in all forms."
    },
    {
      "country_code": "cy",
      "explanation": "The speech addresses the need for a world that 'leaves no one behind' and ensures 'prosperity and human dignity for all', which aligns with the goal of ending poverty in all its forms."
    },
    {
      "country_code": "us",
      "explanation": "President Biden discussed addressing ‘hunger and disease’ as part of global challenges, which aligns with SDG 1: No Poverty, ensuring basic economic resources and food security for all."
    },
    {
      "country_code": "gr",
      "explanation": "The mention of rising inequality and the need for international cooperation implies a commitment to ending poverty in all its forms everywhere, aligning with SDG 1."
    },
    {
      "country_code": "pt",
      "explanation": "The speech addresses the issue of poverty, referencing chronic hunger and its increase, which directly ties to the goal of eradicating poverty."
    },
    {
      "country_code": "gh",
      "explanation": "The speech emphasizes the importance of 'leaving no one behind,' which aligns with SDG 1: No Poverty. The focus on ensuring that marginalized voices and those in poverty are included in decision-making reflects a commitment to addressing inequalities."
    },
    {
      "country_code": "fj",
      "explanation": "The speech references poverty and the challenges faced by developing nations, indicating a commitment to addressing poverty and inequality, which is central to SDG 1: No Poverty."
    },
    {
      "country_code": "gd",
      "explanation": "The theme of 'leaving no one behind' reflects SDG 1: No Poverty, as Prime Minister Mitchell addresses economic hardships faced by communities, particularly in Cuba and Haiti, indicating a commitment to support those in dire circumstances."
    },
    {
      "country_code": "ba",
      "explanation": "The speech highlights the issue of poverty, stating that millions of children live in extreme poverty and emphasizing the need for investment in eradicating poverty, thus aligning with SDG 1: No Poverty."
    },
    {
      "country_code": "sr",
      "explanation": "The speaker discusses the urgent need to address extreme poverty, citing projections that show nearly 600 million people will remain in extreme poverty by 2030, which directly relates to SDG 1: No Poverty."
    },
    {
      "country_code": "pl",
      "explanation": "The mention of the humanitarian crises in places like Yemen highlights the need for efforts to end poverty and support basic human needs (SDG 1: No Poverty). Poland’s acknowledgment of these challenges implicitly connects to addressing the broader goals related to poverty alleviation."
    },
    {
      "country_code": "lt",
      "explanation": "The speech addresses the urgent humanitarian needs of affected populations, such as Ukrainians facing war and refugees, emphasizing the importance of security and support for basic human needs."
    },
    {
      "country_code": "mz",
      "explanation": "The speech addresses the urgency to combat poverty and mentions the need for accelerated actions towards achieving development goals."
    },
    {
      "country_code": "ie",
      "explanation": "The Minister discusses conflicts contributing to hunger and under-development, reflecting the objectives of SDG 1 on ending poverty in all its forms everywhere."
    },
    {
      "country_code": "mv",
      "explanation": "The speech addresses poverty directly by mentioning it among the crises humanity faces and indicates the Maldives has progressed significantly from being one of the poorest countries."
    },
    {
      "country_code": "mn",
      "explanation": "The speech touches on economic inequality by discussing the need to reduce disparities and foster cooperation for sustainable development."
    },
    {
      "country_code": "np",
      "explanation": "The speech emphasizes the principle of 'Leaving No One Behind,' highlighting the need for inclusivity, equality, and social protection for vulnerable communities. This aligns with SDG 1's aim to end poverty in all its forms for everyone."
    },
    {
      "country_code": "ph",
      "explanation": "The speaker mentions the aim to achieve a single-digit poverty rate by 2028 and the reduction of poverty incidence by 2.45 million people between 2021 and 2023, which directly ties to SDG 1 (No Poverty)."
    },
    {
      "country_code": "be",
      "explanation": "The context of conflicts leading to crises in human dignity and the urgent need for humanitarian support reflects aspects of SDG 1, which aims to end poverty in all its forms everywhere, particularly in the context of conflict-affected regions."
    },
    {
      "country_code": "sz",
      "explanation": "The speech highlights the Kingdom of Eswatini's commitment to eradicating poverty through inclusive growth and robust social protection programmes. This aligns directly with SDG 1, which aims to end poverty in all its forms everywhere."
    },
    {
      "country_code": "sb",
      "explanation": "The theme of 'leaving no one behind' is directly related to SDG 1: No Poverty, emphasizing the need to address economic inequality and ensure equitable access to opportunities for all."
    },
    {
      "country_code": "to",
      "explanation": "The speech emphasizes the need to eradicate poverty as part of the commitment to 'leave no one behind,' stressing that the advancement of communities cannot occur in isolation from the well-being of others."
    },
    {
      "country_code": "ki",
      "explanation": "The speech emphasizes the theme of 'Leaving no one behind', which aligns with SDG 1 (No Poverty) by advocating for attention to vulnerable populations, ensuring that their needs are included in national and international agendas."
    },
    {
      "country_code": "mh",
      "explanation": "The speech highlights the vulnerabilities and challenges faced by the Republic of the Marshall Islands, implicitly referencing Goal 1 (No Poverty) by discussing the need for financial support, particularly for the poorest and most vulnerable populations affected by climate change and historical injustices."
    },
    {
      "country_code": "md",
      "explanation": "The speech addresses poverty as one of the generational challenges, which aligns with the goal to end poverty in all its forms everywhere."
    },
    {
      "country_code": "kg",
      "explanation": "The speech highlights the need to eradicate poverty and support vulnerable countries, emphasizing disparities in accessibility to basic services such as water, medical care, and education. This reflects the principles outlined in SDG 1, which focuses on ending poverty in all its forms everywhere."
    },
    {
      "country_code": "lr",
      "explanation": "The speech discusses the fight against poverty, highlighting that over half of Liberia's population lives below the poverty line. It reiterates a commitment to eradicating poverty in all forms by 2030, which aligns with SDG 1: No Poverty."
    },
    {
      "country_code": "ve",
      "explanation": "The speech mentions how sanctions and blockades have severe humanitarian consequences, especially for the poorer populations of Venezuela and other sanctioned countries, illustrating a commitment to end poverty in all its forms."
    },
    {
      "country_code": "au",
      "explanation": "The speech discusses the importance of protecting civilians and ensuring that humanitarian aid reaches those in need, particularly in conflict-affected regions like Gaza and Ukraine, thus addressing the goal of ending poverty in all its forms everywhere."
    },
    {
      "country_code": "sl",
      "explanation": "President Bio emphasizes the need for economic development, particularly in terms of delivering the dividends of democracy and supporting vulnerable citizens post-conflict, aligning with SDG 1: No Poverty."
    },
    {
      "country_code": "ws",
      "explanation": "Throughout the speech, the Prime Minister discusses the unique vulnerabilities of SIDS, including economic instability and high indebtedness exacerbated by climate change, reflecting the theme of poverty eradication as emphasized in SDG 1, which seeks to end poverty in all its forms everywhere."
    },
    {
      "country_code": "tm",
      "explanation": "The speech highlights Turkmenistan's commitment to humanitarian issues and addresses population problems, which aligns with SDG 1 (No Poverty). The mention of humanitarian aid to Afghanistan and assisting refugees demonstrates efforts to reduce poverty and improve living conditions."
    },
    {
      "country_code": "gb",
      "explanation": "The speech addresses poverty, indicating that after 20 years of gains in tackling poverty, the progress has stalled due to conflict. This relates to SDG 1, which aims to end poverty in all its forms."
    }
  ],
  "2": [
    {
      "country_code": "ao",
      "explanation": "Agricultural development efforts are mentioned when discussing the transformation of arid areas for agricultural production. This relates to SDG 2: Zero Hunger, emphasizing the need for food security and sustainable agriculture."
    },
    {
      "country_code": "pw",
      "explanation": "Food security is a significant theme in the speech, with mentions of reducing food imports and promoting local food production to enhance resilience and combat health issues related to processed foods. This is in line with the goal of ending hunger, achieving food security, and improving nutrition."
    },
    {
      "country_code": "kn",
      "explanation": "The mention of food security, food production, and reducing reliance on imports directly relates to SDG 2: Zero Hunger, as it discusses improving nutrition and agricultural sustainability."
    },
    {
      "country_code": "ng",
      "explanation": "Hunger and food crises are mentioned, indicating a commitment to addressing these issues, which connects to SDG 2: Zero Hunger."
    },
    {
      "country_code": "mw",
      "explanation": "Reference to food insecurity caused by adverse weather events and the need for international aid indicates a direct connection to SDG 2, which seeks to end hunger, achieve food security, and improve nutrition."
    },
    {
      "country_code": "ni",
      "explanation": "Food security is explicitly mentioned as a struggle, referring to the need for access to sufficient and nutritious food for all. This corresponds to SDG 2, which focuses on ending hunger, achieving food security, and improving nutrition."
    },
    {
      "country_code": "vn",
      "explanation": "The mention of global food insecurity affecting over 2.4 billion people directly relates to SDG 2 (Zero Hunger). The statement addresses the paradox of sufficient global food production contrasted with widespread famine, underscoring the need to tackle hunger and improve food security."
    },
    {
      "country_code": "sk",
      "explanation": "The speaker references the importance of strengthening food security as part of broader efforts in protecting human rights and ensuring dignified life for all."
    },
    {
      "country_code": "cz",
      "explanation": "The mention of food insecurity as a consequence of the conflict in Ukraine directly relates to SDG 2, which aims to end hunger, achieve food security, and promote sustainable agriculture. The speech draws attention to how conflicts disrupt food supplies and create challenges for global food security."
    },
    {
      "country_code": "sg",
      "explanation": "Implicitly referenced in the Minister's call for action to eliminate food insecurity. His stance on supporting sustainable development underlines the importance of achieving zero hunger (SDG 2) as a foundation for stability and peace."
    },
    {
      "country_code": "na",
      "explanation": "The reference to food security issues due to climate change reflects the challenges Namibia faces in this area, relevant to SDG 2: Zero Hunger."
    },
    {
      "country_code": "sc",
      "explanation": "The speech mentions ending hunger, explicitly linking it to the need for urgent solutions focused on improving the core aspects of people's lives, in accordance with SDG 2: Zero Hunger."
    },
    {
      "country_code": "so",
      "explanation": "Mentions food insecurity in Sudan, highlighting the issue of hunger and malnutrition as a critical challenge that needs addressing."
    },
    {
      "country_code": "gy",
      "explanation": "The speech discusses global food insecurity and the need to enhance food production and trade, highlighting actions necessary to combat hunger and malnutrition, thereby referencing SDG 2: Zero Hunger."
    },
    {
      "country_code": "sm",
      "explanation": "The speaker highlights the importance of food security, particularly in conflict situations where civilian infrastructure is damaged."
    },
    {
      "country_code": "ro",
      "explanation": "The speech highlights food security and Romania's role in facilitating grain exports from Ukraine, directly addressing SDG 2 which aims to end hunger, achieve food security, and promote sustainable agriculture."
    },
    {
      "country_code": "tl",
      "explanation": "The mention of hunger also relates to SDG 2: Zero Hunger. The Prime Minister's focus on enhancing food security through investing in agriculture aligns with the goal of ending hunger and ensuring access to sufficient and nutritious food."
    },
    {
      "country_code": "gw",
      "explanation": "There is a reference to eradicating hunger through development programs, which relates to SDG 2: Zero Hunger, highlighting initiatives aimed at improving food security."
    },
    {
      "country_code": "in",
      "explanation": "Food security is specifically mentioned as a worry in the context of global crises impacting development plans and SDG targets. Initiatives supporting food producers in India further connect to this goal."
    },
    {
      "country_code": "zm",
      "explanation": "Zambia's mention of food insecurity resulting from drought and the need for climate adaptation highlights the relevance to achieving zero hunger."
    },
    {
      "country_code": "kr",
      "explanation": "The discussion about ODA increases to combat food insecurity in Africa indicates an effort to achieve zero hunger."
    },
    {
      "country_code": "me",
      "explanation": "Addressing food insecurity is mentioned when discussing the humanitarian situation in conflict areas like Gaza, directly linking to the goal of ending hunger and ensuring food security."
    },
    {
      "country_code": "lv",
      "explanation": "The mention of food security and hunger as a political tool directly references Goal 2: Zero Hunger. Latvia's support for grain initiatives and partnerships for safe food production illustrates its commitment to combating hunger."
    },
    {
      "country_code": "ug",
      "explanation": "The mention of hunger in the speech reflects concerns related to SDG 2, emphasizing the requirement to tackle issues of food security globally."
    },
    {
      "country_code": "us",
      "explanation": "The President explicitly mentioned 'food security,' indicating ongoing efforts to ensure that all people have sufficient and nutritious food year-round, linked to SDG 2: Zero Hunger."
    },
    {
      "country_code": "pt",
      "explanation": "The mention of hunger affecting one in ten people globally highlights the relevance of the goal to end hunger and ensure food security."
    },
    {
      "country_code": "gh",
      "explanation": "The mention of the 'Programme for Planting for Food and Jobs' supports SDG 2: Zero Hunger. This initiative aims to improve food security and create jobs, emphasizing the importance of sustainable agricultural practices."
    },
    {
      "country_code": "gd",
      "explanation": "The humanitarian crisis in Haiti, specifically the reference to acute food insecurity, aligns with SDG 2: Zero Hunger, highlighting the importance of food security and nutrition for vulnerable populations."
    },
    {
      "country_code": "ie",
      "explanation": "The Minister highlights Ireland's commitment to ending hunger and malnutrition, mentioning the issue of child wasting and stunting, which aligns directly with SDG 2 on zero hunger."
    },
    {
      "country_code": "jo",
      "explanation": "The call for humanitarian aid to provide food and clean water to those in Gaza speaks to SDG 2: Zero Hunger. King Abdullah II's remarks about the starvation of Palestinians underline the urgent need for food security and adequate nutrition amidst the ongoing conflict."
    },
    {
      "country_code": "ua",
      "explanation": "The reference to ensuring food security amidst the war's effects relates to SDG 2, which strives to end hunger, achieve food security and improved nutrition, and promote sustainable agriculture. The speech includes the need to secure food access for Ukrainians affected by the ongoing conflict."
    },
    {
      "country_code": "sb",
      "explanation": "References to hunger and food security implicitly connect to SDG 2: Zero Hunger, especially in the context of agricultural investments mentioned as part of economic transformation."
    },
    {
      "country_code": "nl",
      "explanation": "The speech touches on the issue of hunger in regions suffering from conflict, such as Sudan, where millions face acute hunger. This aligns with SDG 2, which aims to end hunger, achieve food security, and improve nutrition."
    },
    {
      "country_code": "kg",
      "explanation": "The mention of threats to food security and the need to address famine points directly to SDG 2, which aims to end hunger, achieve food security and improved nutrition, and promote sustainable agriculture."
    },
    {
      "country_code": "ws",
      "explanation": "Food security is highlighted as a priority, with a call to transform the food system towards locally produced fresh foods over processed imports. This aligns with SDG 2, which aims to end hunger, achieve food security and improved nutrition, and promote sustainable agriculture."
    }
  ],
  "3": [
    {
      "country_code": "at",
      "explanation": "The reference to humanitarian crises, particularly the suffering of civilians in conflict zones, relates to SDG 3, which aims to ensure healthy lives and promote well-being for all at all ages."
    },
    {
      "country_code": "ao",
      "explanation": "Significant investments in healthcare infrastructure and the training of health professionals align with SDG 3: Good Health and Well-being. The focus on improving health services indicates the importance placed on health outcomes in Angola."
    },
    {
      "country_code": "dm",
      "explanation": "The speaker mentions the urgency of addressing Non-Communicable Diseases (NCDs) and emphasizes health as a priority, directly referencing SDG 3: Good Health and Wellbeing."
    },
    {
      "country_code": "qa",
      "explanation": "The ongoing humanitarian catastrophe in Gaza, including the impacts on health and well-being, underscores the importance of ensuring healthy lives and promoting well-being for all at all ages, as highlighted by SDG 3, through discussions on humanitarian aid and the destruction of healthcare infrastructure."
    },
    {
      "country_code": "bb",
      "explanation": "The discussion on health issues, particularly the pandemic and antimicrobial resistance, points towards SDG 3 which promotes good health and well-being."
    },
    {
      "country_code": "bz",
      "explanation": "The commitment to achieve full national health insurance coverage and strengthen mental health services reflects efforts toward ensuring healthy lives and promoting well-being for all at all ages."
    },
    {
      "country_code": "fi",
      "explanation": "President Stubb emphasizes the need for health and well-being, particularly in relation to the increase in malnutrition and disease that stems from ongoing conflicts. This relates directly to SDG 3, which aims to ensure healthy lives and promote well-being for all."
    },
    {
      "country_code": "mu",
      "explanation": "Mauritius’ commitment to free healthcare showcases a dedication to SDG 3: Good Health and Well-being, aimed at ensuring healthy lives and promoting well-being for all."
    },
    {
      "country_code": "ng",
      "explanation": "Directly acknowledged in relation to global health initiatives, emphasizing the need to ensure good health and well-being, which reflects SDG 3."
    },
    {
      "country_code": "la",
      "explanation": "The focus on humanitarian access and the call for peace agreements touch upon the health and well-being of affected populations, which relates to SDG 3, ensuring healthy lives and promoting well-being for all."
    },
    {
      "country_code": "mw",
      "explanation": "Efforts to enhance healthcare services, such as the establishment of orthopedic and neurosurgery hospitals, connect to SDG 3, which aims to ensure healthy lives and promote well-being for all at all ages."
    },
    {
      "country_code": "ni",
      "explanation": "The emphasis on health security signals a concern for health and well-being, which relates to SDG 3, aimed at ensuring healthy lives and promoting well-being for all at all ages."
    },
    {
      "country_code": "tr",
      "explanation": "President Erdogan discusses the health impacts of the conflict, mentioning injuries, increased diseases, and the destruction of health facilities, linking to SDG 3 which aims to ensure healthy lives and promote well-being for all."
    },
    {
      "country_code": "vn",
      "explanation": "The reference to health crises, such as the impact of epidemics, is connected to SDG 3 (Good Health and Well-Being). The speech implicitly calls for global solidarity and cooperative efforts to ensure health security for all populations."
    },
    {
      "country_code": "ss",
      "explanation": "There is a focus on health improvements and a commitment to invest in Universal Health Coverage and primary healthcare, reflecting the goals of SDG 3 on ensuring healthy lives and promoting well-being for all."
    },
    {
      "country_code": "bt",
      "explanation": "Life expectancy improvements and the reduction of infant mortality are highlighted, indicating commitments to health and wellbeing, which is in line with Goal 3: Good Health and Well-being."
    },
    {
      "country_code": "cv",
      "explanation": "The speech references health through the achievement of malaria-free certification, highlighting the commitment to health and healthcare as a fundamental right for all, which aligns with SDG 3: Good Health and Well-Being."
    },
    {
      "country_code": "sc",
      "explanation": "There is an implicit call for health improvements through economic support for healthcare, aligning with SDG 3: Good Health and Well-being, as critical resources should aid health infrastructure."
    },
    {
      "country_code": "so",
      "explanation": "The speech discusses the impact of conflict in Gaza and Ukraine on public health, especially for children, indicating a need for access to healthcare and psychological support, aligning with the goal of ensuring healthy lives."
    },
    {
      "country_code": "tz",
      "explanation": "The mention of policies to ensure access to quality healthcare, including the Universal Health Insurance act, pertains directly to the goal of ensuring healthy lives and promoting well-being for all at all ages."
    },
    {
      "country_code": "tv",
      "explanation": "The Prime Minister touches on universal health coverage and antimicrobial resistance, reinforcing Goal 3's aim to ensure healthy lives and promote well-being for all at all ages."
    },
    {
      "country_code": "bd",
      "explanation": "Health and well-being are highlighted through prioritization in education and health sectors, emphasizing the role of a functioning health system and addressing non-communicable diseases."
    },
    {
      "country_code": "sm",
      "explanation": "The commitment to health is evident through the concern for the impacts of wars on civilian healthcare systems, as well as addressing pollution, which causes millions of deaths annually."
    },
    {
      "country_code": "fm",
      "explanation": "The speech highlights the public health challenges posed by noncommunicable diseases (NCDs) in Micronesia. There is a commitment to health initiatives and partnerships aimed at improving well-being, aligning with the objectives of SDG 3 which promotes good health and well-being."
    },
    {
      "country_code": "de",
      "explanation": "The speech mentions the humanitarian aid provided for Gaza, focusing on the health and wellbeing of children affected by conflict, which aligns with ensuring healthy lives and promoting well-being for all at all ages."
    },
    {
      "country_code": "tt",
      "explanation": "The speech references the recognition of the health crisis linked to violence in Trinidad and Tobago, reflecting on the impacts of violence on public health. This is related to SDG 3: Good Health and Well-being, which includes an emphasis on reducing violence and addressing health as a public safety concern."
    },
    {
      "country_code": "om",
      "explanation": "The mention of providing health care for all members of society aligns with the goal to ensure healthy lives and promote well-being for all at all ages."
    },
    {
      "country_code": "ls",
      "explanation": "The speech discusses Lesotho's efforts against diseases, particularly HIV/AIDS, noting significant progress in treatment. This directly relates to SDG 3, which aims to ensure healthy lives and promote well-being for all."
    },
    {
      "country_code": "zm",
      "explanation": "The focus on health systems strengthening and the well-being of future generations aligns with ensuring healthy lives and promoting well-being for all."
    },
    {
      "country_code": "kr",
      "explanation": "The emphasis on human rights and well-being, along with the commitment to respond to health and humanitarian crises, aligns with the goal of ensuring healthy lives and promoting well-being for all."
    },
    {
      "country_code": "lk",
      "explanation": "Mentioning the issue of antimicrobial resistance and its health impacts underscores the importance of ensuring healthy lives and promoting well-being for all at all ages, as it directly relates to public health challenges."
    },
    {
      "country_code": "me",
      "explanation": "The focus on healthcare access in the context of conflict in Gaza ties into the goal of ensuring healthy lives and promoting well-being for all."
    },
    {
      "country_code": "jm",
      "explanation": "Jamaica emphasizes investments into health and education as part of its national development strategy, underscoring the importance of these sectors for improving overall well-being."
    },
    {
      "country_code": "ug",
      "explanation": "The speech discusses disease and health issues, calling attention to the need for global health strategies, which aligns with the targets of SDG 3 focused on health and well-being."
    },
    {
      "country_code": "vu",
      "explanation": "The speech highlights the need to improve health systems in Vanuatu and the challenges posed by diseases and pandemics, aligning with the goal of ensuring healthy lives and promoting well-being for all."
    },
    {
      "country_code": "cy",
      "explanation": "The speech highlights the humanitarian crisis in Gaza, emphasizing the suffering of innocent civilians, including the need for healthcare, safety, and dignity, which are integral to ensuring healthy lives and promoting well-being for all."
    },
    {
      "country_code": "us",
      "explanation": "Mentioning global health initiatives, including vaccine distribution efforts and addressing outbreaks, directly connects to SDG 3: Good Health and Well-being, which aims to ensure healthy lives and promote well-being for all."
    },
    {
      "country_code": "pt",
      "explanation": "The importance of healthcare access for those affected by conflict is aligned with the goal of ensuring healthy lives and promoting well-being for all."
    },
    {
      "country_code": "gh",
      "explanation": "President Akufo-Addo mentions prioritizing healthcare through Agenda 111, which involves building hospitals to increase access to health services. This initiative directly supports the objectives of SDG 3: Good Health and Well-being."
    },
    {
      "country_code": "ba",
      "explanation": "The reference to hunger, with one person dying every four seconds from it, connects with SDG 3: Good Health and Well-Being, as it underscores the health impacts of hunger and the importance of addressing food security."
    },
    {
      "country_code": "lt",
      "explanation": "The call for humanitarian aid, medical supplies, and protection of civilian infrastructure reflects concerns for health and well-being, particularly in war-torn areas."
    },
    {
      "country_code": "mn",
      "explanation": "Public health is referenced as crucial to sustain peace and combat climate change, indicating an alignment with the goal of ensuring healthy lives and promoting well-being."
    },
    {
      "country_code": "jo",
      "explanation": "The speech touches on health issues, particularly the lack of medical supplies and the suffering of patients in Gaza, reflecting SDG 3: Good Health and Well-being. The need for medical assistance for the wounded and ill in conflict zones emphasizes the goal of ensuring healthy lives and promoting well-being for all individuals."
    },
    {
      "country_code": "ph",
      "explanation": "There is a focus on global health workforce needs and the ongoing discussions within the World Health Organization regarding the Pandemic Agreement and sustainable health workforce, aligning with SDG 3 (Good Health and Well-being)."
    },
    {
      "country_code": "be",
      "explanation": "The mention of humanitarian aid and the reconstruction efforts in Ukraine, as well as the need for health provisions (like winterising energy in hospitals), connects with SDG 3, which aims to ensure healthy lives and promote well-being for all at all ages."
    },
    {
      "country_code": "sz",
      "explanation": "Health challenges are referred to as a fundamental pillar of sustainable development, emphasizing universal health coverage and the ongoing efforts to improve healthcare access, which aligns with SDG 3's goal to ensure healthy lives and promote well-being for all ages."
    },
    {
      "country_code": "sb",
      "explanation": "The speech emphasizes health and partnerships in health initiatives, which tie into SDG 3: Good Health and Well-Being, particularly regarding health capacity building."
    },
    {
      "country_code": "to",
      "explanation": "Hon. Hu‘akavameiliku discusses the importance of quality, affordable, and inclusive healthcare services, highlighting the need to address non-communicable diseases and overall health infrastructure."
    },
    {
      "country_code": "lr",
      "explanation": "The mention of addressing maternal and newborn mortality through health services monitoring directly links to SDG 3: Good Health and Well-being. The speaker emphasizes the importance of health initiatives reflected by the joint mission to combat high rates of newborn deaths."
    },
    {
      "country_code": "au",
      "explanation": "The mention of over 40,000 Palestinian casualties and significant impacts on health and safety emphasize the importance of ensuring healthy lives and promoting well-being for all, highlighting the necessity for humanitarian assistance."
    },
    {
      "country_code": "ws",
      "explanation": "The mention of non-communicable diseases (NCDs) as a priority health concern aligns with SDG 3, which focuses on ensuring healthy lives and promoting well-being for all at all ages. The speech addresses the need for better preparedness for global pandemics and improved health outcomes for the population."
    },
    {
      "country_code": "gb",
      "explanation": "The speech mentions the worsening humanitarian needs driven by conflict, linking to SDG 3, which focuses on ensuring healthy lives and promoting well-being for all."
    }
  ],
  "4": [
    {
      "country_code": "ae",
      "explanation": "The Minister highlights the importance of education by commending UNRWA for resuming educational services in Gaza, aligning with the goal of ensuring inclusive and equitable quality education."
    },
    {
      "country_code": "bb",
      "explanation": "Mentioning the need for financial resources to be directed towards health and education reflects Goal 4, which seeks to ensure inclusive and equitable quality education for all."
    },
    {
      "country_code": "bz",
      "explanation": "The speech mentions a project aimed at improving education outcomes in Belize, providing resources for secondary students, extending compulsory education, and preparing youth for the job market. This aligns with ensuring inclusive and equitable quality education."
    },
    {
      "country_code": "th",
      "explanation": "The speech's focus on education and opportunities for all, particularly through technological advancements, aligns with Goal 4 (Quality Education) aimed at ensuring inclusive and equitable quality education."
    },
    {
      "country_code": "si",
      "explanation": "The plight of children in conflict zones underlines the urgency for equitable access to quality education. By addressing the need for educational support and rehabilitation for children from Gaza, the speech implicitly advocates for SDG 4, which focuses on ensuring inclusive and equitable quality education for all."
    },
    {
      "country_code": "kn",
      "explanation": "The Prime Minister's commitment to enhancing educational opportunities beyond compulsory systems connects with SDG 4: Quality Education, mentioning the importance of lifelong learning."
    },
    {
      "country_code": "mu",
      "explanation": "The emphasis on free education from pre-primary to tertiary level highlights a commitment to SDG 4: Quality Education, reflecting the importance of inclusive and equitable quality education."
    },
    {
      "country_code": "kz",
      "explanation": "The commitment to advancing child education in the context of human rights connects to SDG 4, which aims to ensure inclusive and equitable quality education and promote lifelong learning opportunities for all."
    },
    {
      "country_code": "ng",
      "explanation": "The speech discusses the need for good and affordable education, linking to SDG 4: Quality Education."
    },
    {
      "country_code": "la",
      "explanation": "The Government's investment in Human Capital Development, including education summits aimed at enhancing education quality, aligns with SDG 4, which aims to ensure inclusive and equitable quality education and promote lifelong learning opportunities for all."
    },
    {
      "country_code": "hr",
      "explanation": "Emphasized in the context of equal opportunities for all, indicating commitments to education and skills development as part of Croatia's national strategy."
    },
    {
      "country_code": "mw",
      "explanation": "The mention of education initiatives, including the construction of secondary schools, ties to SDG 4, which seeks to ensure inclusive and equitable quality education and promote lifelong learning opportunities for all."
    },
    {
      "country_code": "ni",
      "explanation": "The mention of 'Security in Education' indicates a commitment to equitable education opportunities, directly linked with SDG 4, which seeks to ensure inclusive and equitable quality education for all."
    },
    {
      "country_code": "tr",
      "explanation": "The reference to children unable to find safe places to study or live addresses the importance of access to education, a key component of SDG 4."
    },
    {
      "country_code": "cn",
      "explanation": "The speaker advocates for education and modernization as a right for all nations, emphasizing that achieving modernization and education is not a privilege of a few but a necessity for all, which corresponds with SDG 4 on ensuring inclusive and equitable quality education."
    },
    {
      "country_code": "vn",
      "explanation": "The commitment to youth investment and holistic development mentioned in the context of education and cultural enrichment aligns with SDG 4 (Quality Education). It emphasizes the importance of educational opportunities for youth as essential for sustainable development."
    },
    {
      "country_code": "ss",
      "explanation": "The mention of universal basic education and initiatives to combat early and forced marriages for girls aligns with SDG 4, which aims to ensure inclusive and equitable quality education and promote lifelong learning opportunities for all."
    },
    {
      "country_code": "bt",
      "explanation": "The increase in literacy rates and access to free education aligns with Goal 4: Quality Education, emphasizing the importance of education in Bhutan's development."
    },
    {
      "country_code": "cv",
      "explanation": "The speech mentions universal access to quality education and the integration of youth into social, economic, and political life, directly connecting to SDG 4: Quality Education."
    },
    {
      "country_code": "kp",
      "explanation": "The DPRK government's policy to supply children under school age with dairy products and essential school materials reflects a commitment to improving education and child welfare, which ties into the goal of ensuring inclusive and equitable quality education and promoting lifelong learning opportunities for all."
    },
    {
      "country_code": "kh",
      "explanation": "The speech notes Cambodia's focus on enhancing quality education, science and technology, and training in technical skills, which aligns with the objectives of SDG 4 to ensure inclusive and equitable quality education."
    },
    {
      "country_code": "mk",
      "explanation": "The mention of educational disparities indicates a commitment to addressing inequalities in education, which is a key component of SDG 4, ensuring inclusive and equitable quality education and promoting lifelong learning opportunities for all."
    },
    {
      "country_code": "sc",
      "explanation": "The speech discusses the diversion of resources from infrastructure, education, and healthcare, linking back to the necessity of ensuring inclusive and equitable quality education, which corresponds to SDG 4: Quality Education."
    },
    {
      "country_code": "so",
      "explanation": "Addresses the plight of children in Gaza who lack access to education due to ongoing violence, emphasizing the importance of inclusive and equitable quality education."
    },
    {
      "country_code": "ee",
      "explanation": "The speech mentions the importance of education and children's access to learning, highlighting the need for every child to have the opportunity to learn and grow. This aligns with SDG 4, which aims to ensure inclusive and equitable quality education and promote lifelong learning opportunities for all."
    },
    {
      "country_code": "tz",
      "explanation": "The focus on providing Free Basic Education and vocational training aligns with the objective of ensuring inclusive and equitable quality education."
    },
    {
      "country_code": "az",
      "explanation": "The emphasis on inclusive processes involving civil society and various stakeholders in implementing SDGs points toward SDG 4, which focuses on inclusive and equitable quality education and promoting lifelong learning opportunities."
    },
    {
      "country_code": "bd",
      "explanation": "The commitment to education is made clear with a focus on allocating resources to education for all, particularly for youth, which ties to SDG 4 for quality education."
    },
    {
      "country_code": "fm",
      "explanation": "There is an emphasis on investing in youth education and well-being, along with nurturing future leaders, which supports SDG 4 focused on quality education."
    },
    {
      "country_code": "uz",
      "explanation": "The mention of improving public access to education in Uzbekistan directly relates to SDG 4, which focuses on ensuring inclusive and equitable quality education and promoting lifelong learning opportunities for all."
    },
    {
      "country_code": "ch",
      "explanation": "The call for improved understanding and education regarding disinformation connects to SDG 4, which aims to ensure inclusive and equitable quality education and promote lifelong learning opportunities for all."
    },
    {
      "country_code": "om",
      "explanation": "The reference to continuing educational support for all members of society indicates a commitment to ensure inclusive and equitable quality education and promote lifelong learning opportunities for all."
    },
    {
      "country_code": "jp",
      "explanation": "The emphasis on nurturing future generations and promoting education and opportunities for youth speaks to SDG 4, which targets inclusive and equitable quality education and promotes lifelong learning for all."
    },
    {
      "country_code": "za",
      "explanation": "While not explicitly referenced as SDG 4, the focus on improving education and social spending relates to the goal of ensuring inclusive and equitable quality education."
    },
    {
      "country_code": "zm",
      "explanation": "Investments in education for the youth increase access to quality education, critical for contributing to the achievement of SDGs."
    },
    {
      "country_code": "kr",
      "explanation": "The focus on empowering youth in Africa through initiatives like Tech4Africa highlights the importance of inclusive education and skill development."
    },
    {
      "country_code": "lk",
      "explanation": "The mention of increased youth participation in decision-making reflects a commitment to ensuring inclusive and equitable quality education and promoting lifelong learning opportunities for all, particularly focusing on empowering youth."
    },
    {
      "country_code": "me",
      "explanation": "The speech reflects an implicit commitment to quality education by advocating for strong institutions and good governance, essential for inclusive and equitable quality education."
    },
    {
      "country_code": "lv",
      "explanation": "The commitment to enhancing the quality of education is a clear reference to Goal 4: Quality Education. The emphasis on engaging youth and improving educational frameworks aligns with achieving equitable and quality education for all."
    },
    {
      "country_code": "jm",
      "explanation": "The reference to increased access to education and the critical role of educational policies during the humanitarian crisis in Haiti highlights Jamaica's commitment to ensuring inclusive and equitable quality education."
    },
    {
      "country_code": "ug",
      "explanation": "The emphasis on education, skills development, and increasing access to technology in the speech links to SDG 4, which promotes inclusive and equitable quality education."
    },
    {
      "country_code": "cy",
      "explanation": "The mention of Palestinian children lacking access to 'the most basic items of existence - food, shelter, education, safety' relates to ensuring inclusive and equitable quality education."
    },
    {
      "country_code": "gr",
      "explanation": "The emphasis on ensuring education and safeguarding children from the adverse effects of technology relates to ensuring inclusive and equitable quality education for all, which aligns with SDG 4."
    },
    {
      "country_code": "ca",
      "explanation": "The speech mentions the denial of education for women and girls under the Taliban in Afghanistan, highlighting the importance of quality education and equal access, which directly relates to SDG 4."
    },
    {
      "country_code": "pt",
      "explanation": "The speech emphasizes the necessity for access to education amidst crises, reflecting the SDG focused on inclusive and equitable quality education."
    },
    {
      "country_code": "gh",
      "explanation": "The President discusses the Free Senior High School policy which aims to provide education to 5.7 million young people, reflecting the commitment to ensure inclusive and equitable quality education as outlined in SDG 4."
    },
    {
      "country_code": "gd",
      "explanation": "The emphasis on ensuring that children in Grenada have access to free education up to the age of 18 directly references SDG 4: Quality Education, underscoring the government's commitment to educational opportunities and skills training for youth."
    },
    {
      "country_code": "sr",
      "explanation": "The emphasis on access to quality education and skills training indicates a commitment to SDG 4: Quality Education, stressing the need for educational initiatives to empower communities."
    },
    {
      "country_code": "pl",
      "explanation": "The intent to support the development of African societies suggests a recognition of the importance of quality education and knowledge-sharing (SDG 4: Quality Education). Although not explicitly stated, this commitment aligns with fostering educational initiatives in support of development."
    },
    {
      "country_code": "lt",
      "explanation": "The mention of protecting schools and ensuring the safety of children amidst conflict highlights the importance of ensuring quality education and safeguarding learning environments during crisis."
    },
    {
      "country_code": "mv",
      "explanation": "The President talks about improving education and digital literacy from a young age, highlighting the importance of education in achieving the country's goals."
    },
    {
      "country_code": "mn",
      "explanation": "The speech highlights the importance of access to essential social services, particularly education, which is directly related to achieving quality education for all."
    },
    {
      "country_code": "sz",
      "explanation": "The speech mentions efforts to provide equitable access to education through initiatives like Free Primary Education, reinforcing the commitment to ensuring inclusive and equitable quality education for all, as defined in SDG 4."
    },
    {
      "country_code": "sb",
      "explanation": "The mention of education as a tool for empowerment relates to SDG 4: Quality Education, highlighting the need for educational initiatives to support national development."
    },
    {
      "country_code": "to",
      "explanation": "The speech addresses the focus on education, with commitments to enhance access to quality education, vocational training opportunities, and gender equality in education."
    },
    {
      "country_code": "lr",
      "explanation": "The speech mentions education as a focus area in the ARREST Agenda, indicating commitment to improving education access and quality, aligning with SDG 4: Quality Education."
    },
    {
      "country_code": "bg",
      "explanation": "The commitment to education projects and the mention of the Youth Delegate Program indicate an emphasis on inclusive and quality education for all, corresponding with SDG 4."
    },
    {
      "country_code": "sl",
      "explanation": "Sierra Leone's commitment to education through the Free Quality Education Programme and efforts to improve human capital development reflect the objectives of SDG 4: Quality Education."
    },
    {
      "country_code": "tm",
      "explanation": "The speech emphasizes Turkmenistan's education initiatives for Afghan students, supporting SDG 4 (Quality Education) by highlighting the country's role in providing education and social facilities in Afghanistan."
    },
    {
      "country_code": "gb",
      "explanation": "The speech highlights the impact of conflict on education, where children in fragile states are deprived of education due to poverty and instability, which relates to SDG 4, promoting inclusive and equitable quality education."
    }
  ],
  "5": [
    {
      "country_code": "ae",
      "explanation": "The speech mentions the empowering of women and youth, aligning with the goal of achieving gender equality and empowering all women and girls."
    },
    {
      "country_code": "bb",
      "explanation": "The speech addresses discrimination and the need for a more inclusive approach, linking to Goal 5 which advocates for gender equality and empowerment of all women and girls."
    },
    {
      "country_code": "bz",
      "explanation": "The speech highlights the launch of Belize's National Gender Policy, aimed at promoting gender equality and women's empowerment, which aligns directly with the goals of SDG 5 to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "fi",
      "explanation": "The speech underscores the necessity of respecting the rights of women and girls, which is a central goal of SDG 5, ensuring gender equality and empowering all women and girls."
    },
    {
      "country_code": "se",
      "explanation": "The speech addresses gender equality as a core value of Sweden's foreign policy, specifically mentioning the underrepresentation of women in discussions at the Assembly. This aligns directly with SDG 5, which aims to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "th",
      "explanation": "Mentioning the Marriage Equality Act and promoting equal rights illustrates a commitment to gender equality and empowerment of all women and girls, which is central to Goal 5."
    },
    {
      "country_code": "si",
      "explanation": "Reference to the need for gender equality is made through the mention of the Women's Peace and Security Agenda, and the Prime Minister’s emphasis on increasing women's representation in leadership reflects commitments to achieving gender equality, which corresponds to SDG 5."
    },
    {
      "country_code": "pw",
      "explanation": "The emphasis on women's empowerment and the initiatives aimed at increasing women's participation in leadership and entrepreneurship relates directly to the goal of achieving gender equality and empowering all women and girls."
    },
    {
      "country_code": "mu",
      "explanation": "The speech mentions the empowerment of women and youth, which is aligned with SDG 5: Gender Equality. This indicates Mauritius' focus on gender equality and promoting leadership opportunities for women."
    },
    {
      "country_code": "kz",
      "explanation": "Ensuring women's rights and children's safety as priorities of the government is directly linked to SDG 5, which aims to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "ng",
      "explanation": "Women's advancement is specially noted, along with national action plans for women in peace and security, connecting to SDG 5: Gender Equality."
    },
    {
      "country_code": "la",
      "explanation": "By discussing the need for inclusive national dialogue and humanitarian assistance in Myanmar, the speech hints at SDG 5, which focuses on achieving gender equality and empowering all women and girls, as peace efforts often prioritize inclusive participation."
    },
    {
      "country_code": "hr",
      "explanation": "Directly referenced in Croatia's commitment to eliminate gender discrimination and promote gender equality, particularly in relation to women, peace, and security."
    },
    {
      "country_code": "id",
      "explanation": "The speaker highlights the 'Women, Peace and Security agenda,' emphasizing women's empowerment and equal access to education for women and girls. This reflects SDG 5's commitment to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "mw",
      "explanation": "The speech's reference to social protection programs for rural women points toward SDG 5, which aims to achieve gender equality and empower all women and girls, highlighting the commitment to ending child marriage."
    },
    {
      "country_code": "tr",
      "explanation": "Addressing gender issues, particularly in relation to the family structure and gender equality, links to SDG 5 which aims to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "vn",
      "explanation": "The focus on human rights, particularly the support for the State of Palestine and solidarity with Cuba, resonates with SDG 5 (Gender Equality). Though not explicitly about gender, promoting peace, human dignity, and social justice contributes to achieving gender equality globally."
    },
    {
      "country_code": "ss",
      "explanation": "The promotion of gender equality through political representation and the establishment of the Women Enterprise Fund speaks to SDG 5, which aims to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "sk",
      "explanation": "The speech addresses gender equality when mentioning that technological progress should promote gender equality as a part of the basic mission of the UN."
    },
    {
      "country_code": "na",
      "explanation": "The mention of Namibia's progress in gender equality, achieving gender parity in the National Assembly, is a clear alignment with SDG 5: Gender Equality."
    },
    {
      "country_code": "kh",
      "explanation": "By mentioning the special attention given to women and girls in development strategies, the speech implicitly supports SDG 5, which aims to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "mk",
      "explanation": "The speaker mentions gender equality and the fight against discrimination against women and girls as high priorities in their national strategy, which directly relates to SDG 5."
    },
    {
      "country_code": "sc",
      "explanation": "The speech mentions the need to bridge divisions on human rights and gender equality, highlighting the importance of these issues, aligning with SDG 5: Gender Equality."
    },
    {
      "country_code": "gm",
      "explanation": "The President mentions the commitment to gender equality and the importance of empowering women, directly linking to SDG 5, which aims to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "so",
      "explanation": "Highlights issues of gender-based violence occurring in conflict zones like Sudan, underlining the importance of gender equality and empowerment."
    },
    {
      "country_code": "ee",
      "explanation": "The speech advocates for gender equality and the equal rights of women and girls, particularly in the context of human rights. The call to unite efforts to enhance women's rights and opportunities reflects SDG 5's focus on achieving gender equality and empowering all women and girls."
    },
    {
      "country_code": "tz",
      "explanation": "The speech discusses gender inequality and highlights the empowerment of local women, especially in initiatives like seaweed farming. This relates directly to achieving gender equality and empowering all women and girls."
    },
    {
      "country_code": "gy",
      "explanation": "The President mentions the importance of women's participation in agriculture, stating plans for agro businesses to be owned by women and validating efforts toward gender equality aligned with SDG 5: Gender Equality."
    },
    {
      "country_code": "bd",
      "explanation": "The speech remarks on women's voices during the people's movement, aligning with SDG 5 to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "sm",
      "explanation": "The reference to gender equality emphasizes its importance as a prerequisite for achieving sustained and inclusive economic growth and sustainable development."
    },
    {
      "country_code": "fm",
      "explanation": "Gender equality is explicitly mentioned as crucial to nation building. The President outlines efforts made to increase women's representation in government, which aligns with SDG 5 aimed at achieving gender equality."
    },
    {
      "country_code": "ro",
      "explanation": "The President talks about gender equality and the fight against gender violence, emphasizing Romania's commitment as a member of the Human Rights Council, aligning with SDG 5 which aims to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "uz",
      "explanation": "The speech discusses empowering women and girls and ensuring gender equality, stating that Uzbekistan ranks among the top five countries in this regard. This is directly tied to SDG 5, which aims to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "de",
      "explanation": "The speaker addresses gender equality directly, calling for a female Secretary General and highlighting that women’s rights are human rights. The speech frames the call for female leadership within the UN as a necessary step towards achieving gender equality."
    },
    {
      "country_code": "sy",
      "explanation": "SDG 5 (Gender Equality) is mentioned in the context of promoting women's rights and protection against violence, indicative of the commitment to ensuring gender equality and empowerment of women in the recovery and development process."
    },
    {
      "country_code": "tt",
      "explanation": "The speech advocates for women's rights, participation of women in society, and highlights stagnation in gender equality. It aligns with SDG 5: Gender Equality, as it emphasizes the need for human rights and freedoms for women and girls."
    },
    {
      "country_code": "pk",
      "explanation": "The speaker references the rights of women and girls, particularly in the context of the Afghan Interim Government and their responsibilities to promote human rights, linking to SDG 5 which seeks to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "gw",
      "explanation": "The speech discusses promoting greater participation of women and youth entrepreneurs, which ties into SDG 5: Gender Equality, underlining a commitment to inclusivity."
    },
    {
      "country_code": "om",
      "explanation": "Oman's social protection programs specifically mention support for women, which aligns with the goal of achieving gender equality and empowering all women and girls."
    },
    {
      "country_code": "ls",
      "explanation": "Mention of gender equality and the protection of women and girls from violence emphasizes the importance of achieving gender equality, which is the core of SDG 5."
    },
    {
      "country_code": "jp",
      "explanation": "The speaker discusses the Women, Peace and Security (WPS) agenda, highlighting the importance of women's participation and leadership in peacebuilding and disaster recovery. This aligns with SDG 5, which aims to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "za",
      "explanation": "The reference to gender equality in their global treaties indicates a commitment to advance gender equality and empower all women and girls, resonating with SDG 5."
    },
    {
      "country_code": "in",
      "explanation": "References to closing the gender gap in health, education, and the workplace directly relate to gender equality, showcasing India's efforts in empowering women through financial support and targeted policies."
    },
    {
      "country_code": "no",
      "explanation": "The emphasis on gender equality and women's rights throughout the speech aligns with SDG 5, which aims to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "zm",
      "explanation": "The mention of ending child marriage and empowering women and girls directly relates to achieving gender equality."
    },
    {
      "country_code": "kr",
      "explanation": "The mention of advancing the Women, Peace, and Security agenda aligns with the goal of achieving gender equality and empowering all women and girls."
    },
    {
      "country_code": "lk",
      "explanation": "The advocacy for greater empowerment of women aligns with efforts to achieve gender equality and empower all women and girls, emphasizing their crucial role in national development."
    },
    {
      "country_code": "me",
      "explanation": "The mention of gender equality and the connection made between gender perspectives and peacebuilding initiatives align with the goal of achieving gender equality and empowering all women and girls."
    },
    {
      "country_code": "mt",
      "explanation": "The speech discusses the critical inclusion of women and girls in peace processes, aligning with Goal 5: Gender Equality. The Prime Minister emphasizes that without the voices of women, sustainable peace cannot be achieved."
    },
    {
      "country_code": "lv",
      "explanation": "Latvia’s support for the Women, Peace and Security agenda reflects Goal 5: Gender Equality. Advocacy for strengthening women’s roles in peacebuilding shows a commitment to gender equality as a critical element in achieving sustainable development."
    },
    {
      "country_code": "is",
      "explanation": "The speech emphasizes gender equality and women's empowerment, particularly regarding access to education and the rights of women in various societies. The minister expresses concern over the restrictions faced by women in societies where they are not allowed to participate fully in public life."
    },
    {
      "country_code": "ug",
      "explanation": "While not explicitly mentioned, the call for social-economic justice and equal rights correlates with the gender equality objectives outlined in SDG 5."
    },
    {
      "country_code": "bw",
      "explanation": "Gender equality is a clear focus in the speech, which mentions the need for 'meaningful action to empower women and girls' and to combat 'harmful cultural practices and gender-based violence.' This is directly related to SDG 5, which seeks to achieve gender equality and empower all women and girls."
    },
    {
      "country_code": "cy",
      "explanation": "The speech condemns the use of rape as a weapon of war, highlighting the need for gender equality and empowerment of women, which aligns with the goal of achieving gender equality."
    },
    {
      "country_code": "gr",
      "explanation": "The reference to 'women, peace and security' suggests an effort to promote gender equality and the empowerment of all women and girls, which is the focus of SDG 5."
    },
    {
      "country_code": "ca",
      "explanation": "Minister Joly addresses women's rights and reproductive rights, emphasizing the need for gender equality, which is the core focus of SDG 5. Discussions about women’s choices and their right to equality in education and opportunities underscore this goal."
    },
    {
      "country_code": "pt",
      "explanation": "The reference to disrespect for the rights of women and girls underlines the importance of achieving gender equality and empowering all women and girls."
    },
    {
      "country_code": "ie",
      "explanation": "The commitment to gender equality and the empowerment of women and girls is explicitly mentioned, demonstrating alignment with SDG 5."
    },
    {
      "country_code": "mv",
      "explanation": "The loan facility specifically for women entrepreneurs and the emphasis on including women and young people in development reflects a commitment to gender equality."
    },
    {
      "country_code": "mn",
      "explanation": "Mongolia's commitment to promoting gender equality and women's participation in decision-making is emphasized, aligning with the goal of achieving gender equality."
    },
    {
      "country_code": "np",
      "explanation": "The Prime Minister mentions the commitment to promoting gender equality and ensuring equal rights for women and girls, which is a direct reference to SDG 5. This includes enhancing legal frameworks for women's rights and rights related to sexual and reproductive health."
    },
    {
      "country_code": "ph",
      "explanation": "The speech addresses the importance of gender equality and mentions the Philippines' roles in promoting the rights of women and youth in peace processes, thereby referencing SDG 5 (Gender Equality)."
    },
    {
      "country_code": "sz",
      "explanation": "Addressing the vulnerabilities of women and children in social protection policies indicates a commitment to gender equality and empowerment of women, which aligns with SDG 5."
    },
    {
      "country_code": "sb",
      "explanation": "While gender equality is not explicitly mentioned, the themes surrounding inclusive development hint at the importance of SDG 5: Gender Equality, particularly in the context of ensuring that 'no one is left behind.'"
    },
    {
      "country_code": "mh",
      "explanation": "The speech mentions gender equality initiatives and the empowerment of women and girls in the region, linking the Marshall Islands' efforts to promote gender-responsive climate justice to Goal 5 (Gender Equality)."
    },
    {
      "country_code": "kg",
      "explanation": "While not explicitly detailing gender equity, the speech's emphasis on equal opportunities for development initiatives indirectly supports SDG 5, which seeks to achieve gender equality and empower all women and girls, especially in the context of social and economic development."
    },
    {
      "country_code": "lr",
      "explanation": "The recognition of the challenges faced by women and girls of African descent, along with Liberia's leadership by female figures, reflects a commitment to achieving gender equality and empowering all women and girls, which is SDG 5: Gender Equality."
    },
    {
      "country_code": "au",
      "explanation": "The speech highlights gender equality as a key factor in peacebuilding and references initiatives that support women's political leadership, pointing to the importance of empowering women and ensuring their full participation in society."
    },
    {
      "country_code": "sl",
      "explanation": "The signing of the Gender Equality and Women's Empowerment Act, along with initiatives to eliminate child marriage and promote women's rights, clearly align with SDG 5: Gender Equality."
    },
    {
      "country_code": "gb",
      "explanation": "The emphasis on a more representative international system, including calls for women's rights and equality, connects to SDG 5, which is about achieving gender equality and empowering all women and girls."
    }
  ],
  "6": [
    {
      "country_code": "ao",
      "explanation": "The construction of water transfer systems to combat drought speaks to SDG 6: Clean Water and Sanitation. By addressing water scarcity, Angola is directly working towards ensuring availability and sustainable management of water resources."
    },
    {
      "country_code": "si",
      "explanation": "The speech discusses the impact of climate change on water resources, emphasizing the importance of access to clean drinking water and highlighting how access to water is being weaponized in conflict areas. This aligns with SDG 6, which aims to ensure availability and sustainable management of water and sanitation for all."
    },
    {
      "country_code": "kz",
      "explanation": "Water scarcity is highlighted as a significant consequence of climate change, with a worrying statistic about access to safe drinking water. The Deputy Prime Minister discusses efforts to manage water resources sustainably, which relates to SDG 6: Clean Water and Sanitation."
    },
    {
      "country_code": "id",
      "explanation": "The acknowledgement of water as a crucial element for shared prosperity resonates with SDG 6, which aims to ensure availability and sustainable management of water and sanitation for all. The mention of hosting the World Water Forum further emphasizes Indonesia's commitment to this goal."
    },
    {
      "country_code": "tj",
      "explanation": "The commitment to addressing water supply and sanitation issues is clearly articulated, particularly in reference to the UN Water Conference 2023 and the Dushanbe Water Process. This indicates a dedication to ensuring availability and sustainable management of water resources."
    },
    {
      "country_code": "az",
      "explanation": "The mention of clean environmental goals and initiatives for enhancing water and sanitation systems implies action towards SDG 6, which ensures availability and sustainable management of water and sanitation for all."
    },
    {
      "country_code": "us",
      "explanation": "Implied reference through goals to address clean water and sanitation, as part of broader health and humanitarian initiatives, though not expressed explicitly, it contributes to SDG 6: Clean Water and Sanitation."
    },
    {
      "country_code": "tm",
      "explanation": "The discussion around water resource management and desertification in Central Asia relates to SDG 6 (Clean Water and Sanitation), particularly with regard to the challenges of the Aral Sea and the need for cooperative efforts to manage water resources."
    }
  ],
  "7": [
    {
      "country_code": "ao",
      "explanation": "Angola's transition to clean energy sources with hydroelectric dams and photovoltaic parks aligns with SDG 7: Affordable and Clean Energy. This commitment to renewable energy emphasizes the goal of ensuring access to sustainable energy for all."
    },
    {
      "country_code": "tj",
      "explanation": "The mention of Tajikistan producing 98% of its electricity from renewable hydropower reflects efforts towards ensuring access to affordable, reliable, sustainable, and modern energy for all, which is key to achieving SDG 7."
    },
    {
      "country_code": "na",
      "explanation": "Namibia's focus on developing a sustainable energy mix and green industrialization aligns with SDG 7: Affordable and Clean Energy."
    },
    {
      "country_code": "tz",
      "explanation": "The Clean Cooking Agenda referenced in the speech aims to ensure access to affordable, reliable, sustainable, and modern energy for all, directly addressing Goal 7."
    },
    {
      "country_code": "az",
      "explanation": "Azerbaijan's commitment to increasing renewable energy and achieving carbon neutrality suggests adherence to SDG 7, which promotes access to affordable, reliable, sustainable, and modern energy for all."
    },
    {
      "country_code": "rw",
      "explanation": "The focus on 'green energy' and sustainable practices in the context of economic rebuilding speaks to SDG 7: Affordable and Clean Energy. Rwanda's mention of transitioning to more sustainable energy solutions highlights the goal of ensuring access to affordable and clean energy."
    },
    {
      "country_code": "ba",
      "explanation": "The commitment of Bosnia and Herzegovina to transition to renewable energy sources and reduce harmful gas emissions speaks to SDG 7: Affordable and Clean Energy, focusing on sustainable energy and climate action."
    },
    {
      "country_code": "mn",
      "explanation": "Discussions on energy transitions and climate change mitigation relate directly to ensuring access to affordable, reliable, sustainable, and modern energy for all."
    },
    {
      "country_code": "ua",
      "explanation": "The speech references the deliberate attacks on Ukraine's energy infrastructure, highlighting the destruction of thermal power plants and hydroelectric capacity. This relates directly to SDG 7, which aims to ensure access to affordable, reliable, sustainable and modern energy for all."
    },
    {
      "country_code": "bs",
      "explanation": "He calls for a transition to renewable energy and stresses the importance of prioritizing energy solutions that are sustainable and environmentally friendly, reflecting the objective of ensuring access to affordable, reliable, sustainable, and modern energy for all."
    }
  ],
  "8": [
    {
      "country_code": "kz",
      "explanation": "The speech discusses the importance of economic resilience and fair access to technology, connecting to SDG 8, which promotes inclusive and sustainable economic growth, employment, and decent work for all."
    },
    {
      "country_code": "ng",
      "explanation": "The need for decent work is emphasized, along with efforts to support youth empowerment and entrepreneurship, aligning with SDG 8: Decent Work and Economic Growth."
    },
    {
      "country_code": "la",
      "explanation": "The mention of socio-economic development efforts and the emphasis on creating conducive environments for economic growth highlight SDG 8, which promotes sustained, inclusive, and sustainable economic growth, full and productive employment, and decent work for all."
    },
    {
      "country_code": "cn",
      "explanation": "The speech mentions promoting economic growth that benefits all and rejecting protectionism. This aligns with SDG 8 which promotes sustained, inclusive and sustainable economic growth, full and productive employment and decent work for all."
    },
    {
      "country_code": "cz",
      "explanation": "The reference to economic potential in Africa and the call to create jobs for young people reflects SDG 8, which advocates for promoting sustained, inclusive economic growth, employment, and decent work for all. The aim to engage with African countries to enhance their economic capabilities connects with the goal of fostering economic development."
    },
    {
      "country_code": "tj",
      "explanation": "The speech touches on sustainable economic growth and employment through the discussion of international financial systems and their role in supporting developing countries. The focus on financing for development aligns with initiatives aimed at promoting sustained, inclusive economic growth."
    },
    {
      "country_code": "kh",
      "explanation": "Cambodia's mention of economic diversification for job creation and sustainable growth aligns with SDG 8, which promotes sustained, inclusive, and sustainable economic growth, full and productive employment, and decent work for all."
    },
    {
      "country_code": "mk",
      "explanation": "The reference to just development, equitable economic policies, and the impact of globalization aligns with SDG 8, which promotes sustained, inclusive, and sustainable economic growth, full and productive employment, and decent work for all."
    },
    {
      "country_code": "az",
      "explanation": "The speaker's mention of economic growth and decreased poverty rates aligns with SDG 8, which promotes sustained, inclusive, and sustainable economic growth, full and productive employment, and decent work for all."
    },
    {
      "country_code": "uz",
      "explanation": "The commitment to reducing the unemployment rate from 11% to 7% and creating jobs is reflected in SDG 8, which promotes sustained, inclusive economic growth, full and productive employment, and decent work for all."
    },
    {
      "country_code": "sy",
      "explanation": "SDG 8 (Decent Work and Economic Growth) is addressed through the mention of a faltering global economy and the need for investment in sustainable development to improve living conditions for Syrians, underscoring the importance of economic stability and growth."
    },
    {
      "country_code": "gw",
      "explanation": "By discussing the importance of an inclusive economy and measures taken to support the private sector, the speech addresses SDG 8: Decent Work and Economic Growth, advocating for economic dynamism."
    },
    {
      "country_code": "in",
      "explanation": "The speech describes initiatives focused on employment and entrepreneurship, particularly loans given to small businesses and street vendors, which supports sustained economic growth and decent work for all."
    },
    {
      "country_code": "jm",
      "explanation": "The speech outlines Jamaica's improved economic conditions, highlighting reduced unemployment rates and increased minimum wage, which aligns with the goal of promoting decent work and economic growth."
    },
    {
      "country_code": "ug",
      "explanation": "The speech stresses the importance of economic growth, job creation, and support for sustainable economic development, resonating with the targets of SDG 8."
    },
    {
      "country_code": "gh",
      "explanation": "The speech highlights economic transformation through the '1-District-1-Factory' policy, which aims to create jobs and enhance income. This reflects the goals of SDG 8: Decent Work and Economic Growth."
    },
    {
      "country_code": "mv",
      "explanation": "The vision of transforming the economy, increasing productivity, and producing an ICT-driven economy aligns with promoting sustainable economic growth."
    },
    {
      "country_code": "sz",
      "explanation": "The promotion of job creation and economic diversification through the SDG Recovery and Acceleration Plan reflects a commitment to sustainable economic growth, full and productive employment, and decent work for all, corresponding to SDG 8."
    },
    {
      "country_code": "ke",
      "explanation": "The call for economic reforms and support for developing nations to attain sustainable economic growth aligns with SDG 8, which promotes sustained economic growth, higher levels of productivity, and decent work for all."
    },
    {
      "country_code": "ki",
      "explanation": "Kiribati talks about the need for economic resilience and sustainable growth, which aligns with SDG 8 (Decent Work and Economic Growth). The focus on creating favorable conditions for economic development and the importance of local resources plays into this goal."
    },
    {
      "country_code": "sl",
      "explanation": "Discussions about job creation, economic development, and the importance of development finance institutions relate to SDG 8: Decent Work and Economic Growth."
    }
  ],
  "9": [
    {
      "country_code": "cz",
      "explanation": "The speech discusses the need for responsible behavior in cyberspace and enhancing cybersecurity capabilities, reflecting concerns related to SDG 9, which focuses on building resilient infrastructure, promoting inclusive and sustainable industrialization, and fostering innovation. The commitment to digital transformation and technology optimization is in line with this goal."
    },
    {
      "country_code": "ge",
      "explanation": "Georgia's commitment to developing infrastructure, such as the Anaklia Deep Sea Port, and its role as a transit corridor aligns with SDG 9, which focuses on building resilient infrastructure and promoting sustainable industrialization."
    },
    {
      "country_code": "kh",
      "explanation": "The construction of infrastructure projects like the Funan Techo Canal is a move towards sustainable industrialization and fostering innovation, reflecting the goals of SDG 9."
    },
    {
      "country_code": "uz",
      "explanation": "The mention of advancing IT and the 'Digital Uzbekistan - 2030' Strategy speaks to SDG 9, which focuses on building resilient infrastructure, promoting inclusive and sustainable industrialization, and fostering innovation."
    },
    {
      "country_code": "in",
      "explanation": "The emphasis on technology advancements and digital public infrastructure aligns with the goal of building resilient infrastructure, promoting inclusive and sustainable industrialization, and fostering innovation."
    },
    {
      "country_code": "zm",
      "explanation": "The emphasis on infrastructure development and the need for technology transfer in agriculture and renewable energy relates to building resilient infrastructure."
    },
    {
      "country_code": "jm",
      "explanation": "The discussion of Jamaica's infrastructure expansion and upgrades indicates a commitment to building resilient infrastructure and fostering innovation."
    },
    {
      "country_code": "vu",
      "explanation": "There is a call for reforming global financial systems to better support vulnerable nations like Vanuatu, which is related to building resilient infrastructure, promoting inclusive and sustainable industrialization, and fostering innovation."
    },
    {
      "country_code": "mv",
      "explanation": "The discussion on building financial centers and leveraging technology to enhance economic sectors reflects a commitment to industry innovation."
    },
    {
      "country_code": "ke",
      "explanation": "The mention of green investments and industrialization reflects SDG 9, which emphasizes building resilient infrastructure and promoting sustainable industrialization. The focus on renewable energy underscores the need for innovation and investment in sustainable technologies."
    }
  ],
  "10": [
    {
      "country_code": "at",
      "explanation": "In discussing global fragmentation, rising protectionism, and inequality, the speaker touches on issues related to reducing inequalities within and among countries, which is a key focus of SDG 10."
    },
    {
      "country_code": "ae",
      "explanation": "The call for international cooperation to address crises and the emphasis on supporting developing and poor countries relate to the goal of reducing inequality within and among countries."
    },
    {
      "country_code": "qa",
      "explanation": "The speech discusses the injustices faced by the Palestinian people and emphasizes the need for equity and the reduction of inequalities, which is central to SDG 10. The reference to apartheid and the marginalization of the Palestinian cause speaks directly to the goals of reducing inequalities within and among countries."
    },
    {
      "country_code": "bb",
      "explanation": "Calls for reforming institutions that create inequality, as well as ensuring a seat at the table for developing countries, align with Goal 10 which aims to reduce inequality within and among countries."
    },
    {
      "country_code": "rs",
      "explanation": "The speaker addresses inequalities faced by smaller nations, referencing how powerful states have historically exerted influence over them. This resonates with SDG 10, which is focused on reducing inequality within and among countries, as the speaker calls for justice and respect for human rights."
    },
    {
      "country_code": "fi",
      "explanation": "The call for a fair representation in the UN and addressing inequalities in power dynamics mirrors the intentions of SDG 10, which aims to reduce inequality within and among countries."
    },
    {
      "country_code": "se",
      "explanation": "There is a clear concern for inequalities, particularly when discussing the fight against corruption to ensure that economic growth benefits all, not just a few. This reflects the objectives of SDG 10, which aims to reduce inequality within and among countries."
    },
    {
      "country_code": "th",
      "explanation": "The emphasis on addressing inequalities through support for vulnerable communities and the goal of achieving equality aligns with Goal 10 (Reduced Inequalities), particularly in socioeconomic aspects."
    },
    {
      "country_code": "si",
      "explanation": "The speech discusses increasing inequalities exacerbated by conflict and the need for international cooperation to address these disparities. This reflects the objectives of SDG 10, which aims to reduce inequality within and among countries."
    },
    {
      "country_code": "ir",
      "explanation": "The speech highlights issues of 'injustice, oppression, greed, poverty, and ignorance', which connect to SDG 10's focus on reducing inequality within and among countries. The speaker addresses the need to confront root causes of inequality and to ensure equitable treatment of individuals and communities."
    },
    {
      "country_code": "lc",
      "explanation": "The Minister discusses the need for special and differential treatment for SIDS in the context of global inequalities, which resonates with reducing inequality within and among countries."
    },
    {
      "country_code": "mu",
      "explanation": "The reference to inclusivity and equity in the speech relates to SDG 10: Reduced Inequality, as it advocates for fair representation of small states and larger nations alike."
    },
    {
      "country_code": "my",
      "explanation": "The speech discusses the marginalization of the Global South and the urgent need for equitable access to development financing. This echoes SDG 10, which aims to reduce inequality within and among countries, targeted at ensuring all voices are considered and represented in development discussions."
    },
    {
      "country_code": "ng",
      "explanation": "Acknowledges inequality and the importance of fostering fair and inclusive economies, reflecting the themes of SDG 10: Reduced Inequalities."
    },
    {
      "country_code": "hr",
      "explanation": "Mentioned through the call for the equal treatment of all populations and the need to leave no one behind, highlighting social inequalities."
    },
    {
      "country_code": "id",
      "explanation": "The speech discusses the disparity faced by the Global South in exercising their right to development and the need for cooperation to ensure inclusive growth. This correlates with SDG 10's aim to reduce inequality within and among countries."
    },
    {
      "country_code": "mw",
      "explanation": "The mention of economic empowerment and societal inclusion through cooperation reflects SDG 10, which aims to reduce inequality within and among countries. The emphasis on shared prosperity for Malawians aligns with this goal."
    },
    {
      "country_code": "ni",
      "explanation": "The reference to combating inequalities and the strong focus on solidarity and the rights of the marginalized reflect the goals of SDG 10, which aims to reduce inequality within and among countries."
    },
    {
      "country_code": "cn",
      "explanation": "The notion of helping developing countries leap over the development divide directly connects to SDG 10, which strives to reduce inequality within and among countries. The speech stresses the need for a globally inclusive development approach."
    },
    {
      "country_code": "sk",
      "explanation": "The mention of migration issues and the need for transparent procedures highlights the desire to reduce inequalities and manage the effects of migration on both source and destination countries."
    },
    {
      "country_code": "kp",
      "explanation": "The speech discusses social inequality and the implementation of regional development policies aimed at bridging the gap between urban and rural areas, which directly relates to reducing inequality within and among countries."
    },
    {
      "country_code": "mk",
      "explanation": "The call for social justice in the context of growing disparities between states and within societies connects to SDG 10, which aims to reduce inequality within and among countries."
    },
    {
      "country_code": "gm",
      "explanation": "The theme of bridging inequalities and addressing the challenges faced by Least Developed Countries (LDCs) connects with SDG 10, which focuses on reducing inequality within and among countries."
    },
    {
      "country_code": "so",
      "explanation": "The speech discusses growing economic inequalities exacerbated by conflicts and poor governance, indicating a need for measures that reduce inequalities."
    },
    {
      "country_code": "ee",
      "explanation": "By referencing the need for inclusive decision-making and the importance of ensuring that all nations have a voice in international governance, the speech touches on SDG 10, which aims to reduce inequality within and among countries, promoting social, economic, and political inclusion for all."
    },
    {
      "country_code": "az",
      "explanation": "The references to rising inequalities and the need to leave no one behind connect with SDG 10, which addresses reduced inequalities within and among countries."
    },
    {
      "country_code": "bd",
      "explanation": "Calls for inclusivity and equitable distribution of wealth relate to SDG 10 on reducing inequality within and among countries."
    },
    {
      "country_code": "sm",
      "explanation": "The mention of rising inequalities during crises aligns with the goal of reducing inequalities within and among countries."
    },
    {
      "country_code": "ro",
      "explanation": "Addressing issues like increased distrust, hatred, and extremism, the emphasis on coexistence and tolerance relates to SDG 10, which focuses on reducing inequality within and among countries."
    },
    {
      "country_code": "rw",
      "explanation": "The speech discusses the widening inequality and the need for equitable access to opportunities, which directly relates to SDG 10: Reduced Inequalities. It emphasizes the disparities faced by developing nations and marginalized regions and the importance of targeted financial aid and debt relief."
    },
    {
      "country_code": "uz",
      "explanation": "The reference to challenges faced by developing countries in accessing global financial resources ties into SDG 10, which aims to reduce inequality within and among countries."
    },
    {
      "country_code": "de",
      "explanation": "The mention of inequality, especially in the representation of African countries and women within international institutions addresses the goal of reducing inequalities. It highlights the need for equitable representation and inclusivity in decision-making processes."
    },
    {
      "country_code": "sy",
      "explanation": "The speech mentions the enriching of certain countries at the expense of others, which relates to SDG 10 (Reduced Inequalities), indicating a call for a fairer distribution of resources and equitable opportunities for all nations."
    },
    {
      "country_code": "pk",
      "explanation": "The speech addresses inequality and the struggles of developing countries trapped in a cycle of debt, emphasizing the need for global equity and support for the SDGs, resonating with SDG 10 which focuses on reducing inequality within and among countries."
    },
    {
      "country_code": "om",
      "explanation": "Efforts to fight against discrimination, racism, hatred, and violence reflects the goal of reducing inequality within and among countries."
    },
    {
      "country_code": "za",
      "explanation": "The speech highlights the disparities in wealth and development within and between countries, relating to SDG 10, which aims to reduce inequality within and among countries."
    },
    {
      "country_code": "in",
      "explanation": "The speech mentions the unfairness of the current globalization model and the need for building resilient supply chains, directly addressing the need to reduce inequality within and among countries."
    },
    {
      "country_code": "zm",
      "explanation": "Advocating for debt relief and effective fiscal policies speaks to reducing inequality within and among countries."
    },
    {
      "country_code": "lk",
      "explanation": "The call for economic stability and equitable resource allocation highlights efforts to reduce inequalities, particularly emphasizing support for marginalized and vulnerable groups in society."
    },
    {
      "country_code": "me",
      "explanation": "Calls for reforms in international financial architecture to support developing countries implicitly reference the goal of reducing inequality within and among countries."
    },
    {
      "country_code": "lv",
      "explanation": "Latvia’s acknowledgment of the need to reduce inequalities resonates with Goal 10: Reduced Inequalities. The speech discusses initiatives aimed at fostering inclusive development which is vital for addressing disparities both within and among nations."
    },
    {
      "country_code": "ug",
      "explanation": "The discussion on addressing global inequalities and ensuring all nations benefit from development aligns with the aims of SDG 10 to reduce inequality within and among countries."
    },
    {
      "country_code": "bw",
      "explanation": "The speech discusses the importance of addressing inequalities within countries and calls for pro-poor policies as well as comprehensive social protection systems. This focus on reducing inequality is a key aspect of SDG 10, which is aimed at reducing inequality within and among countries."
    },
    {
      "country_code": "pt",
      "explanation": "The mention of socio-economic divides and the commitment to inclusivity and fairness corresponds with the goal of reducing inequality within and among countries."
    },
    {
      "country_code": "gh",
      "explanation": "The speech discusses the issues of inequality and marginalization both globally and within Africa, aligning with SDG 10: Reduced Inequalities. The call to address the needs of the disadvantaged reflects the commitment to improve social, economic, and political inclusion."
    },
    {
      "country_code": "fj",
      "explanation": "The President mentions increasing inequalities between rich and poor countries, urging the need for bridging these divides, which aligns with SDG 10: Reduced Inequalities."
    },
    {
      "country_code": "vc",
      "explanation": "The Prime Minister's emphasis on inequality, particularly the disparities faced by SIDS in comparison to developed countries, connects to SDG 10 which seeks to reduce inequality within and among countries. This is addressed through appeals for special treatment and support for vulnerable nations."
    },
    {
      "country_code": "sr",
      "explanation": "The mention of rising inequality and the need for inclusivity in economic systems reflects the objectives of SDG 10: Reduced Inequalities. The call to close the gap between aspiration and financing also aligns with this goal."
    },
    {
      "country_code": "pl",
      "explanation": "Poland expresses solidarity with developing nations, noting historical experiences with colonialism and advocating for equal treatment and self-reliance (SDG 10: Reduced Inequalities). The emphasis on supporting African nations aligns with efforts to reduce inequality and foster partnerships for development."
    },
    {
      "country_code": "ie",
      "explanation": "Reference to addressing inequalities and the ongoing struggle for the rights of marginalized groups, including LGBTQI+ rights, connects to SDG 10 on reduced inequalities."
    },
    {
      "country_code": "np",
      "explanation": "The contrast between the wealth concentration in the Global North and poverty in the Global South implies issues of inequality. The speech discusses the need for equitable prosperity and addressing the significant financial gaps faced by Least Developed Countries (LDCs), resonating with SDG 10's focus on reducing inequality within and among countries."
    },
    {
      "country_code": "jo",
      "explanation": "The mention of inequality, particularly regarding the treatment of Palestinians versus Israelis, implicitly addresses SDG 10: Reduced Inequalities. The King emphasizes the need for equal rights and dignity for all people, highlighting the disparities faced by Palestinians under occupation."
    },
    {
      "country_code": "sz",
      "explanation": "The speech addresses inequality, emphasizing the need for reforms to ensure fair representation in the global system and stating that the country seeks a more inclusive world, which is connected to reducing inequality within and among countries as aimed by SDG 10."
    },
    {
      "country_code": "sb",
      "explanation": "The discussion on global inequality and the need for fair representation in financial institutions relates to SDG 10: Reduced Inequalities, especially concerning the marginalized Small Island Developing States."
    },
    {
      "country_code": "ke",
      "explanation": "The call for reforming the international financial architecture to support developing countries addresses SDG 10, which seeks to reduce inequality within and among countries. The speech highlights the barriers to equitable growth faced by these countries."
    },
    {
      "country_code": "nz",
      "explanation": "The speech highlights the need for equitable treatment of small states and emphasizes that all nations should be considered equal. This advocacy for reducing inequalities resonates with SDG 10, which aims to reduce inequality within and among countries."
    },
    {
      "country_code": "kg",
      "explanation": "The president discusses growing economic inequality and calls for equitable resource distribution, which aligns with SDG 10 aimed at reducing inequality within and among countries."
    },
    {
      "country_code": "bg",
      "explanation": "The reference to addressing inequalities and promoting human rights suggests an effort to reduce inequalities within and among countries, aligning with SDG 10."
    },
    {
      "country_code": "ve",
      "explanation": "Implicitly referenced through themes of inequality and the negative impacts of colonialism and unilateral sanctions imposed by more powerful nations on less powerful ones. The speech underscores the need for international cooperation to reduce inequalities, stating that unilateral coercive measures violate the right to development."
    },
    {
      "country_code": "au",
      "explanation": "The speaker addresses the need to create a world where no country dominates another, advocating for the equitable distribution of resources and opportunities, thus promoting reduced inequalities within and among countries."
    },
    {
      "country_code": "sl",
      "explanation": "The mention of global economic inequities and the struggles of least-developed countries to achieve development goals signals a commitment to reducing inequalities, which is central to SDG 10: Reduced Inequalities."
    },
    {
      "country_code": "er",
      "explanation": "The mention of the inequalities experienced by various peoples, particularly those affected by sanctions and oppression, resonates with SDG 10 to reduce inequality within and among countries. The speaker points out the impact of unilateral sanctions on countries like Eritrea, Venezuela, and Cuba, highlighting the need for systemic changes to address these injustices."
    }
  ],
  "11": [
    {
      "country_code": "th",
      "explanation": "The focus on sustainable development and resilient communities discussed throughout the speech supports Goal 11 (Sustainable Cities and Communities), emphasizing the need for sustainable urbanization."
    },
    {
      "country_code": "si",
      "explanation": "The Prime Minister mentions the need for urban resilience against climate-related disasters, hinting at the necessity for sustainable cities and communities as set forth in SDG 11. The 'Early Warning for All' initiative aims to help various communities prepare for climate events."
    },
    {
      "country_code": "kn",
      "explanation": "The references to sustainable cities, affordable housing, and climate-smart development initiatives mentioned in the context of building sustainable settlements connect to SDG 11: Sustainable Cities and Communities."
    },
    {
      "country_code": "ng",
      "explanation": "Discusses the desire for safe, secure environments, connecting to SDG 11: Sustainable Cities and Communities."
    },
    {
      "country_code": "hr",
      "explanation": "Implicitly indicated by Croatia's efforts in preserving natural resources and promoting sustainable urban development as part of its national strategy."
    },
    {
      "country_code": "bt",
      "explanation": "The establishment of the Gelephu Mindfulness City reflects a vision for sustainable urban development, aligning with Goal 11: Sustainable Cities and Communities."
    },
    {
      "country_code": "kp",
      "explanation": "The mention of providing new dwelling houses free of charge indicates efforts towards making cities and human settlements inclusive, safe, resilient, and sustainable, supporting the goal of ensuring access to safe and affordable housing."
    },
    {
      "country_code": "kh",
      "explanation": "Efforts to enhance access to public services and promote urban resilience through e-government initiatives relate to SDG 11, which advocates for making cities inclusive, safe, resilient, and sustainable."
    },
    {
      "country_code": "mk",
      "explanation": "The discussion of sustainable urbanization and the need for a safe environment relates to SDG 11, which focuses on making cities and human settlements inclusive, safe, resilient, and sustainable."
    },
    {
      "country_code": "dk",
      "explanation": "The reference to the humanitarian crises and the urgent need for ceasefires and peace talks highlight the need for sustainable cities and communities and the goal to make cities inclusive, safe, resilient, and sustainable, as per SDG 11."
    },
    {
      "country_code": "az",
      "explanation": "The initiative to develop green energy zones and improve urban environments connects to SDG 11, which aims to make cities and human settlements inclusive, safe, resilient, and sustainable."
    },
    {
      "country_code": "sm",
      "explanation": "The aim for sustainable and resilient infrastructures, particularly in war-torn areas, suggests a focus on creating sustainable cities and communities."
    },
    {
      "country_code": "uz",
      "explanation": "The enhancement of social protection and the establishment of the Social Protection Agency in Uzbekistan aligns with SDG 11, which promotes sustainable cities and communities."
    },
    {
      "country_code": "tt",
      "explanation": "The concerns raised about security, resilience, and the impacts of climate change on communities tie into SDG 11: Sustainable Cities and Communities, which advocates for making cities inclusive, safe, resilient, and sustainable."
    },
    {
      "country_code": "om",
      "explanation": "Oman's emphasis on social care and the design of social protection programs contributes to making cities and human settlements inclusive, safe, resilient, and sustainable."
    },
    {
      "country_code": "no",
      "explanation": "The reference to ‘peace’ and the need for a just peace resonates with SDG 11, which focuses on making cities and human settlements inclusive, safe, resilient, and sustainable, emphasizing the urgency of addressing conflicts that affect urban areas."
    },
    {
      "country_code": "jm",
      "explanation": "Jamaica mentions its efforts to respond to climate change and disasters, emphasizing urban resilience and disaster response mechanisms integrated into national policy."
    },
    {
      "country_code": "pt",
      "explanation": "The discussion around climate refugees connects to the goal of making cities and human settlements inclusive, safe, resilient, and sustainable."
    },
    {
      "country_code": "fj",
      "explanation": "There are mentions of resilience-building in relation to coastal communities affected by sea-level rise, which reflects the goals of SDG 11: Sustainable Cities and Communities."
    },
    {
      "country_code": "vc",
      "explanation": "The impact of natural disasters, such as Hurricane Beryl, on the resilience and recovery of communities in SIDS reflects the objectives of SDG 11, which seeks to make cities and human settlements inclusive, safe, resilient, and sustainable. The speech discusses the challenges faced by the population and the need for recovery support."
    },
    {
      "country_code": "mv",
      "explanation": "The mention of urban development projects that promote inclusivity and climate resilience signifies a commitment to sustainable cities and communities."
    },
    {
      "country_code": "sz",
      "explanation": "Efforts to mitigate climate change and promote sustainable urban environments are consistent with the objectives of SDG 11, which calls for making cities and human settlements inclusive, safe, resilient, and sustainable."
    },
    {
      "country_code": "kg",
      "explanation": "The speech introduces the initiative to build a sustainable 'green city' and references projects like smart cities, reflecting SDG 11, which promotes sustainable cities and communities."
    },
    {
      "country_code": "bs",
      "explanation": "The mention of the challenges faced due to climate change highlights the need for sustainable cities and communities, as the effects of climate change (like hurricanes and floods) contribute to displacement and exacerbate urban challenges."
    },
    {
      "country_code": "tm",
      "explanation": "The mention of developing a Global Atlas of Sustainable Transport Connectivity connects to SDG 11 (Sustainable Cities and Communities), promoting sustainable transport systems to enhance urban environments and connectivity."
    }
  ],
  "12": [
    {
      "country_code": "ni",
      "explanation": "The speech critiques the unsustainable consumption and production patterns that lead to environmental destruction, tying in with SDG 12, which promotes responsible consumption and production."
    },
    {
      "country_code": "gw",
      "explanation": "The encouragement of sustainable economic policies and improving infrastructure reflects principles of SDG 12: Responsible Consumption and Production, focused on sustainable practices."
    },
    {
      "country_code": "lk",
      "explanation": "Discussions regarding sustainable management of ocean resources and addressing pollution reflect a commitment to ensuring sustainable consumption and production patterns, particularly in the context of ocean conservation."
    },
    {
      "country_code": "tm",
      "explanation": "The mention of developing a Global Framework Program for the transition to a circular economy aligns with SDG 12 (Responsible Consumption and Production), promoting sustainable practices and efficient resource management."
    }
  ],
  "13": [
    {
      "country_code": "at",
      "explanation": "The mention of accelerating climate change and environmental disasters directly relates to SDG 13, which underscores the importance of combating climate change and its impacts."
    },
    {
      "country_code": "ae",
      "explanation": "The speech's focus on climate change, including the UAE Consensus to prevent global warming and participation in climate initiatives, aligns with the goal of taking urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "ag",
      "explanation": "Climate change is a recurring theme in the speech, with explicit calls to action against climate change and references to the impacts already felt by Small Island Developing States (SIDS). The Prime Minister emphasizes the immediacy of climate actions, aligning with SDG 13, which urges urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "ao",
      "explanation": "The speech references measures aimed at mitigating and adapting to climate change, aligning with SDG 13: Climate Action. The emphasis on responsible resource exploitation and climate initiatives signifies a commitment to sustainability."
    },
    {
      "country_code": "dm",
      "explanation": "Climate change is a fundamental theme in the speech, highlighting how it exacerbates vulnerability for small island states and urging for action to meet climate goals, thereby aligning with SDG 13: Climate Action."
    },
    {
      "country_code": "bb",
      "explanation": "The emphasis on the climate crisis and the need for collective action to address climate change aligns closely with SDG 13, which focuses on combating climate change and its impacts."
    },
    {
      "country_code": "bz",
      "explanation": "The speech discusses the climate crisis, emphasizing the impact of climate change on small island developing states (SIDS). Belize, as a member of AOSIS, highlights the urgent need for G20 nations to enhance their emission reduction targets and the necessity for adaptation and loss and damage financing."
    },
    {
      "country_code": "fi",
      "explanation": "The mention of climate change as a critical challenge that requires global cooperation directly references SDG 13, which focuses on urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "se",
      "explanation": "Sweden's ambition to become climate-neutral by 2045 and its discussion of climate action emphasize the urgency of addressing climate change, which is central to SDG 13. The speech also mentions enhancing climate financing and mobilizing private capital to support these efforts."
    },
    {
      "country_code": "th",
      "explanation": "Thailand's acknowledgment of the climate crisis and advocacy for climate action aligns clearly with Goal 13 (Climate Action), indicating a commitment to combat climate change and its impacts."
    },
    {
      "country_code": "pw",
      "explanation": "The speech highlights the urgent challenge posed by climate change, particularly for Small Island Developing States like Palau. It discusses the need for global cooperation to mitigate climate change and emphasizes the commitment to reducing carbon emissions, transitioning to renewable energy, and adapting to the impacts of climate change."
    },
    {
      "country_code": "kn",
      "explanation": "Throughout the speech, there are significant mentions of the climate crisis, rising sea levels, and the need for urgent action from small island developing states (SIDS), which directly relate to SDG 13: Climate Action."
    },
    {
      "country_code": "lc",
      "explanation": "Climate change and climate justice are major themes in the speech, emphasizing the urgent need for immediate action to combat climate change and its impacts, directly relating to the goal of climate action."
    },
    {
      "country_code": "mu",
      "explanation": "The mention of the climate emergency and the commitment to implementing the New Collective Quantified Goal directly addresses SDG 13: Climate Action, reflecting the urgency to combat climate change."
    },
    {
      "country_code": "kz",
      "explanation": "The speech addresses climate change explicitly, stating it as an existential threat that no nation can ignore. It mentions the need for collaboration among nations to tackle climate issues and highlights Kazakhstan's commitment to hosting a Regional Climate Summit in 2026, which aligns with SDG 13's focus on climate action."
    },
    {
      "country_code": "my",
      "explanation": "Minister Mohamad Hasan addresses the climate crisis as a pressing global challenge requiring collaborative solutions. This aligns with SDG 13, which calls for urgent action to combat climate change and its impacts, as he emphasizes the need for climate financing, technology transfer, and capacity building."
    },
    {
      "country_code": "ng",
      "explanation": "Climate change is explicitly mentioned, demonstrating Nigeria's commitment to addressing climate action through SDG 13."
    },
    {
      "country_code": "la",
      "explanation": "The speech addresses the impacts of climate change and natural disasters, along with the adoption of a national strategic plan on climate change, directly relating to SDG 13, which calls for urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "hr",
      "explanation": "Explicitly discussed in relation to climate change, as Croatia recognizes climate change as a major challenge, claiming responsibility to integrate climate actions into their national policies."
    },
    {
      "country_code": "mw",
      "explanation": "The speech addresses climate change multiple times, particularly emphasizing the declarations of national disaster due to climate impacts and the necessity for multilateral cooperation to address these issues. This aligns with SDG 13, which focuses on climate action."
    },
    {
      "country_code": "ni",
      "explanation": "Climate change is referenced as a significant threat, addressing the need for climate justice and action, which is the core of SDG 13, focused on combating climate change and its impacts."
    },
    {
      "country_code": "tr",
      "explanation": "The mention of climate change discussions, the need for cooperation in addressing it, and Turkey’s initiatives in sustainability align with SDG 13 which focuses on combating climate change."
    },
    {
      "country_code": "cn",
      "explanation": "The commitment to green, low-carbon sustainable development and achieving carbon neutrality speaks to SDG 13, which calls for urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "vn",
      "explanation": "The discussion of climate change, natural disasters, and the urgent need for climate action ties directly to SDG 13 (Climate Action). The reference to the challenges posed by climate change and calls for adequate funding for climate initiatives reinforces the importance of addressing the climate crisis."
    },
    {
      "country_code": "ss",
      "explanation": "Addressing climate change impacts and advocating for enhanced financial contributions for climate action aligns the speech with SDG 13, which focuses on combating climate change and its impacts."
    },
    {
      "country_code": "sk",
      "explanation": "The speaker discusses climate change and the urgent need to mitigate its consequences, referring to commitments like the Paris Agreement and highlighting the importance of environmental protection."
    },
    {
      "country_code": "sg",
      "explanation": "The Minister explicitly discusses the impacts of climate change, particularly sea-level rise that threatens small island states like Singapore. His commitment to peaking emissions before 2030 and achieving net-zero by 2050 aligns directly with SDG 13: Climate Action."
    },
    {
      "country_code": "ge",
      "explanation": "The mention of climate change and the need for bold actions to tackle this challenge connects with SDG 13, which aims to combat climate change and its impacts."
    },
    {
      "country_code": "cv",
      "explanation": "Climate change is discussed multiple times, particularly its disproportionate effects on Small Island Developing States, underlining the need for urgent action on this global issue, which relates to SDG 13: Climate Action."
    },
    {
      "country_code": "tj",
      "explanation": "Climate change is a prominent theme in the speech, with the speaker addressing its impacts on developing countries, particularly Tajikistan. The mention of ongoing initiatives, strategies for adaptation, and the International Year of Glaciers' Preservation highlights efforts related to climate action."
    },
    {
      "country_code": "na",
      "explanation": "The President expresses concern over climate change and its impact on Namibia, which directly relates to SDG 13: Climate Action."
    },
    {
      "country_code": "kh",
      "explanation": "The speech directly references Cambodia's commitment to bold climate actions to achieve net-zero emissions, aligning clearly with SDG 13, which calls for urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "mk",
      "explanation": "The need for climate action is a clear theme, with specific references to climate change and its impacts, aligning with SDG 13 on combating climate change and its impacts."
    },
    {
      "country_code": "sc",
      "explanation": "Climate change is referenced as the 'foremost challenge,' stressing the impacts of climate change on future generations and calling for urgent action, directly aligning with SDG 13: Climate Action."
    },
    {
      "country_code": "gm",
      "explanation": "The President discusses climate change as a pressing issue and emphasizes the need for international cooperation to address it, aligning with SDG 13, which focuses on climate action."
    },
    {
      "country_code": "so",
      "explanation": "Climate change is explicitly mentioned as an existential threat, and Somalia's experiences with droughts and floods are cited as urgent impacts of climate change that need global attention and action."
    },
    {
      "country_code": "dk",
      "explanation": "The speech underscores the importance of addressing the climate crisis, mentioning the need for more ambitious climate action and financing, directly relating to SDG 13's targets focused on climate action."
    },
    {
      "country_code": "tz",
      "explanation": "The discussion around climate change adaptation and mitigation strategies, including restoration of mangroves and promotion of eco-tourism, directly pertains to the urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "tv",
      "explanation": "The Prime Minister discusses climate change, its impacts on Tuvalu, and the need for global action, reflecting Target 13.1's call for strengthening resilience and adaptive capacities to climate-related hazards."
    },
    {
      "country_code": "gy",
      "explanation": "The speech references climate change as a paramount threat to existence, linking it to multiple development challenges and calling for immediate action to fulfill pledges related to climate policy, explicitly addressing Sustainable Development Goal 13: Climate Action."
    },
    {
      "country_code": "az",
      "explanation": "The speech emphasizes the global climate crisis as one of the greatest transnational challenges, advocating for immediate and collective action to limit global temperature rise, which directly relates to SDG 13 on Climate Action."
    },
    {
      "country_code": "bd",
      "explanation": "Climate change is explicitly discussed, emphasizing climate justice and the need for robust resources for climate adaptation, directly linking to SDG 13 on climate action."
    },
    {
      "country_code": "sm",
      "explanation": "The call for urgent action on climate change, pollution, and biodiversity loss directly relates to the need for climate action."
    },
    {
      "country_code": "fm",
      "explanation": "The President emphasizes the severe impacts of climate change, referring to it as the single greatest threat to Micronesia. He mentions the urgent need for global action to limit temperature rise to 1.5 degrees Celsius, aligning with the objectives of SDG 13 which focuses on climate action."
    },
    {
      "country_code": "ro",
      "explanation": "The mention of climate change as a 'growing threat to our security' and the need to keep the 1.5°C target alive speaks to SDG 13, which calls for urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "tl",
      "explanation": "The speech discusses the impacts of climate change and the need for sustainable management of ocean resources, aligning with SDG 13: Climate Action. The mention of the urgent need for collective global efforts to combat climate change also reflects the goals of this SDG."
    },
    {
      "country_code": "rw",
      "explanation": "The mention of climate change and the call for advanced economies to reduce emissions relates to SDG 13: Climate Action. Rwanda highlights the impacts of climate change on developing nations and emphasizes the importance of global cooperation for sustainable development initiatives."
    },
    {
      "country_code": "uz",
      "explanation": "The speech highlights climate change as a pressing issue, especially for Central Asia, and discusses the establishment of a Climate Council and a Regional Climate Change Adaptation Strategy, aligning with SDG 13's focus on urgent action to combat climate change."
    },
    {
      "country_code": "de",
      "explanation": "The speech discusses the outcomes of the COP28 conference, emphasizing global cooperation on climate action and the establishment of a Loss and Damage Fund, which directly relates to responding to climate change and its impacts."
    },
    {
      "country_code": "sy",
      "explanation": "The speaker notes the impact of climate change, indicating a recognition of SDG 13 (Climate Action) as part of the discussions on solidarity with countries affected by natural events and the need for collaborative actions to address climate-related challenges."
    },
    {
      "country_code": "ch",
      "explanation": "The speech touches upon the existential impact of climate change and loss of biodiversity on populations, highlighting the need for collective efforts in addressing environmental challenges. This aligns with SDG 13, which calls for urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "pg",
      "explanation": "The speech discusses climate change as a major threat, particularly focusing on its role in environmental degradation and its direct impact on poverty. The Prime Minister mentions commitments under the Paris Agreement and the need for climate finance, clearly aligning with strategies aimed at combating climate change."
    },
    {
      "country_code": "tt",
      "explanation": "The speech addresses climate change directly, mentioning the urgency to act and support for vulnerable nations, which is a core element of SDG 13: Climate Action. The speaker highlights the need for financing and investments to build resilience against climate change."
    },
    {
      "country_code": "pk",
      "explanation": "Climate change is a significant theme in the speech, with the mention of catastrophic floods in Pakistan and global climate impact, directly aligning with SDG 13, which aims to combat climate change and its impacts."
    },
    {
      "country_code": "gw",
      "explanation": "The speech highlights the importance of mitigating the effects of climate change, connecting to SDG 13: Climate Action, particularly in relation to the increased threat of malaria due to global warming."
    },
    {
      "country_code": "om",
      "explanation": "The commitment to address climate change, reduce emissions, and promote renewable energy projects aligns with the urgent actions to combat climate change and its impacts."
    },
    {
      "country_code": "ls",
      "explanation": "The speech addresses climate change, noting its impacts on agriculture and food security in Lesotho, which corresponds to SDG 13 focused on combating climate change and its impacts."
    },
    {
      "country_code": "jp",
      "explanation": "Japan’s commitment to combat climate change and its promotion of a 'New Form of Capitalism' to achieve net-zero emissions by 2050 clearly relates to SDG 13, which focuses on taking urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "za",
      "explanation": "The speech emphasizes action on climate change, discussing the Just Energy Transition Plan and commitment to the Paris Agreement, in alignment with SDG 13."
    },
    {
      "country_code": "no",
      "explanation": "The mention of the 'triple planetary crisis' and the need to transition to renewable and circular economies directly relates to SDG 13, which addresses climate action and the urgent need to combat climate change and its impacts."
    },
    {
      "country_code": "zm",
      "explanation": "Zambia discusses climate change impacts and the need for climate adaptation, directly linking to climate action."
    },
    {
      "country_code": "kr",
      "explanation": "The reference to a commitment to the Carbon-Free Energy Initiative and tackling climate change through Green ODA emphasizes the importance of taking urgent action to combat climate change."
    },
    {
      "country_code": "lk",
      "explanation": "The emphasis on combating climate change and increasing renewable energy showcases Sri Lanka's commitment to urgent action in addressing climate change, including the commitment to phase out coal and achieve net-zero carbon emissions by 2050."
    },
    {
      "country_code": "me",
      "explanation": "The explicit remarks about climate change and its importance in the context of international peace directly relate to the urgent actions needed to combat climate change and its impacts."
    },
    {
      "country_code": "mt",
      "explanation": "The speech addresses climate change and its effects on small island nations, particularly Malta, which corresponds to Goal 13: Climate Action. The urgency for climate-related resilience and solidarity among small island developing states is emphasized."
    },
    {
      "country_code": "lv",
      "explanation": "The speech addresses climate change as a risk to global peace and security, referencing Goal 13: Climate Action. The recognition of the impact of conflicts on climate issues indicates the interconnectedness of peace and environmental sustainability."
    },
    {
      "country_code": "is",
      "explanation": "Minister Gylfadottir calls attention to climate change as an urgent issue affecting populations globally, stressing the need for mitigation and adaptation measures. The remarks highlight Iceland's commitment to addressing climate change impacts, particularly on ocean health, which is central to the nation's economy."
    },
    {
      "country_code": "jm",
      "explanation": "The speech explicitly highlights Jamaica's concerns regarding climate change and the commitment to international cooperation on climate justice, aligning with the targets focused on climate action."
    },
    {
      "country_code": "nr",
      "explanation": "Throughout the speech, the President emphasizes the urgency of addressing climate change, calling for action to meet obligations under the Paris Agreement and to transition to renewable energy sources, which aligns with the climate action goals of SDG 13."
    },
    {
      "country_code": "ug",
      "explanation": "Climate change is directly referenced multiple times, highlighting its impact on sustainable development and the need for climate action, which is central to SDG 13."
    },
    {
      "country_code": "bw",
      "explanation": "The President mentions the urgency of climate action, particularly in light of extreme weather events and the climate crisis, which relates directly to SDG 13 that calls for urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "vu",
      "explanation": "The speech emphasizes the urgency of taking climate action and mentions the impact of climate change on Vanuatu, which directly correlates with the goal to combat climate change and its impacts."
    },
    {
      "country_code": "us",
      "explanation": "President Biden highlighted 'the climate crisis' and America's major investments in climate and clean energy, which directly corresponds to SDG 13: Climate Action, aiming to combat climate change and its impacts."
    },
    {
      "country_code": "gr",
      "explanation": "The mention of climate change as a serious issue facing the world directly tackles the climate crisis, advocating for climate action, consistent with SDG 13."
    },
    {
      "country_code": "pt",
      "explanation": "The acknowledgment of climate change as a critical threat directly relates to the goal of combating climate change and its impacts."
    },
    {
      "country_code": "fj",
      "explanation": "The speech discusses climate change, sea level rise, and the impacts of climate-induced disasters, highlighting the urgent need for action to combat climate change and support vulnerable communities, which aligns with the objectives of SDG 13: Climate Action."
    },
    {
      "country_code": "gd",
      "explanation": "The discussion surrounding resilience in the context of climate change and the call for partnerships to adapt to climate impacts relates to SDG 13: Climate Action, as the Prime Minister stresses the need for international cooperation to tackle climate-related challenges."
    },
    {
      "country_code": "vc",
      "explanation": "The speech addresses climate change and the responsibilities of developed countries to maintain global temperature limits, aligning with SDG 13 which calls for urgent action to combat climate change and its impacts. The Prime Minister criticizes the failure of major emitters to fulfill commitments, thus highlighting the climate vulnerability of Small Island Developing States."
    },
    {
      "country_code": "sr",
      "explanation": "The speech emphasizes climate action, stating that it can no longer be postponed or ignored. This directly correlates with SDG 13: Climate Action, as the speaker notes inadequate progress in this area and the commitment of Suriname to the Paris Agreement."
    },
    {
      "country_code": "lt",
      "explanation": "The reference to climate change as an emerging global challenge indicates a concern for environmental sustainability and aligns with the goal of combating climate change and its impacts."
    },
    {
      "country_code": "mz",
      "explanation": "Climate change is explicitly referenced as a challenge that Mozambique faces, with mention of cyclical cyclones, droughts, and floods impacting the country's economy."
    },
    {
      "country_code": "ie",
      "explanation": "The Minister discusses climate change as a central theme, emphasizing the need for urgent action against its impacts, which directly relates to SDG 13 on climate action."
    },
    {
      "country_code": "mv",
      "explanation": "Climate change is highlighted as the most serious threat, with plans to invest in renewable energy and adaptation strategies directly addressing climate action."
    },
    {
      "country_code": "mn",
      "explanation": "The urgency of addressing climate change and the mention of Mongolia's green development initiatives illustrate a strong correlation with climate action."
    },
    {
      "country_code": "np",
      "explanation": "The Prime Minister addresses climate change as a grave threat, stressing Nepal's commitment to the Paris Agreement and desire to achieve net-zero emissions by 2045. This reflects the urgency of SDG 13, which calls for urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "ph",
      "explanation": "The speech highlights the Philippines' acute climate vulnerability and its commitment to strengthening climate and disaster risk resilience, hence implicitly referencing SDG 13 (Climate Action). The country is actively engaging in discussions about climate change and promoting initiatives such as hosting the Board of the Fund for Loss and Damage."
    },
    {
      "country_code": "be",
      "explanation": "The speech addresses climate change and the need for increased ambitions regarding climate action, which are central to SDG 13. It also mentions the role of innovation and sustainability in mitigating climate effects."
    },
    {
      "country_code": "sz",
      "explanation": "The reference to climate action and mitigation strategies, including the adoption of a ban on single-use plastics, shows a strong commitment to combating climate change and its impacts, directly referring to SDG 13."
    },
    {
      "country_code": "ua",
      "explanation": "The mention of threats posed by potential nuclear disasters, as well as the impact of the war on climate and environment, aligns with SDG 13 which focuses on climate action. The call to prevent ecological destruction and the consequences of a nuclear incident reflect concerns regarding climate safety."
    },
    {
      "country_code": "sb",
      "explanation": "The call for urgent climate action and the acknowledgment of climate change as a crisis relate directly to SDG 13: Climate Action, specifically the need for stronger frameworks and commitments to combat climate change."
    },
    {
      "country_code": "to",
      "explanation": "Climate change is described as the greatest threat to the Pacific region, with a call for urgent global action against climate impacts and for increased climate finance for vulnerable nations."
    },
    {
      "country_code": "ke",
      "explanation": "President Ruto discusses the impacts of climate change, including its role in triggering conflicts and resource scarcity, which reflects the objectives of SDG 13: Climate Action. The speech advocates urgent climate action and the need for equitable climate finance."
    },
    {
      "country_code": "ki",
      "explanation": "Kiribati highlights the urgency of climate change and sea-level rise, which directly ties to SDG 13 (Climate Action). The speech discusses the need for concrete actions to address climate change and promote adaptation strategies, especially for Small Island Developing States like Kiribati."
    },
    {
      "country_code": "nl",
      "explanation": "The speech explicitly mentions climate change, highlighting its impact on various regions, including the Kingdom of the Netherlands and Small Island Developing States. The speaker emphasizes the need for collective action and commitment to climate targets, relating to SDG 13, which advocates for urgent action to combat climate change."
    },
    {
      "country_code": "mh",
      "explanation": "Climate action is a central theme of the speech. The speaker expresses the urgency of reducing emissions and transitioning away from fossil fuels, directly aligning with Goal 13 (Climate Action). They call for nations to recommit to the Paris Agreement targets and support for renewable energy initiatives."
    },
    {
      "country_code": "nz",
      "explanation": "The speech touches upon the crises of climate change alongside discussions of international security and conflict. The notion that global challenges are interconnected implies a need for urgent action on climate change, aligning with SDG 13's goals."
    },
    {
      "country_code": "md",
      "explanation": "Climate change is expressly mentioned as a major issue, highlighting the severe weather events Moldova has faced and the need for collective action to address climate-related challenges."
    },
    {
      "country_code": "kg",
      "explanation": "There is a strong emphasis on addressing climate change challenges, which directly relates to SDG 13, which focuses on combating climate change and its impacts."
    },
    {
      "country_code": "lr",
      "explanation": "The address stresses the urgent need to take action against climate change, mentioning the Paris Agreement and Liberia's role in biodiversity, linking to SDG 13: Climate Action."
    },
    {
      "country_code": "bg",
      "explanation": "The speech discusses climate change as a threat multiplier and emphasizes the need for enhanced climate action, strongly resonating with SDG 13 which focuses on climate action."
    },
    {
      "country_code": "au",
      "explanation": "The speech addresses climate change issues and actions being taken by Australia, including ambitious emissions reduction targets, thus tying directly into the need for urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "bs",
      "explanation": "The Prime Minister emphasizes the urgency of addressing climate change as a critical threat, highlighting its effects on Small Island Developing States (SIDS) and calling for urgent global action to mitigate its impacts and reinforce adaptation measures."
    },
    {
      "country_code": "ws",
      "explanation": "Climate action is a prominent theme throughout the speech. The Prime Minister emphasizes the urgent need for substantial investments to mitigate climate change and adapt to its impacts, highlighting the gravity of the situation faced by Small Island Developing States (SIDS) due to climate change. This aligns directly with SDG 13's goal to take urgent action to combat climate change and its impacts."
    },
    {
      "country_code": "tm",
      "explanation": "The references to addressing climate change and environmental protection efforts, especially regarding the Aral Sea, align with SDG 13 (Climate Action). Turkmenistan's commitment to safeguarding the environment contributes to global action on climate change."
    },
    {
      "country_code": "gb",
      "explanation": "The recognition of climate change as an existential threat and the UK's commitment to transition to clean power aligns directly with SDG 13, which calls for urgent action to combat climate change and its impacts."
    }
  ],
  "14": [
    {
      "country_code": "ag",
      "explanation": "The speech discusses issues of plastic pollution in oceans and the need for a binding treaty to combat this crisis. This directly correlates with SDG 14, which focuses on conserving and sustainably using the oceans, seas, and marine resources."
    },
    {
      "country_code": "pw",
      "explanation": "Palau's commitment to ocean conservation is evident through its role as Co-Chair of the Ocean Panel and its actions to promote sustainable ocean governance. The speech discusses efforts to protect marine biodiversity and the declaration of a moratorium on deep-sea mining, aligning with the goal of conserving oceans and marine resources."
    },
    {
      "country_code": "mu",
      "explanation": "The commitment to protecting ocean resources and ensuring sustainable marine governance directly relates to SDG 14: Life Below Water, addressing the conservation and sustainable use of oceans."
    },
    {
      "country_code": "sg",
      "explanation": "He highlights the significance of the UN Convention on the Law of the Sea (UNCLOS) and the BBNJ Agreement, which address sustainable ocean use and conservation, tying closely with SDG 14: Life Below Water."
    },
    {
      "country_code": "cv",
      "explanation": "As an Ocean Nation, Cabo Verde emphasizes sustainable management of marine resources and participation in the UN Decade of Ocean Science, addressing the challenges posed to ocean health, directly relating to SDG 14: Life Below Water."
    },
    {
      "country_code": "sc",
      "explanation": "The mention of ocean degradation and the importance of sustainable marine resource use links to SDG 14: Life Below Water, emphasizing protection and sustainable use of oceans."
    },
    {
      "country_code": "tv",
      "explanation": "Tuvalu emphasizes its commitment to sustainable marine resource management, addressing ocean health and pollution, aligning with the goals of conserving oceans, seas and marine resources."
    },
    {
      "country_code": "fm",
      "explanation": "The speech discusses the health of the ocean, the dangers of sea-level rise, and marine ecosystem protection, which are all related to SDG 14 on life below water. The President stresses the importance of safeguarding maritime zones and addressing ocean degradation."
    },
    {
      "country_code": "tl",
      "explanation": "The references to the blue economy and sustainable use of marine biodiversity directly relate to SDG 14: Life Below Water. Discussions on protecting marine ecosystems and resources indicate commitments towards this goal."
    },
    {
      "country_code": "mt",
      "explanation": "The importance of protecting marine biodiversity and addressing issues related to the health of seas and oceans corresponds with Goal 14: Life Below Water. The speech underscores initiatives like 'Shore to Ship' to reduce pollution and safeguard marine environments."
    },
    {
      "country_code": "nr",
      "explanation": "The speech highlights Nauru's commitment to the sustainable use of ocean resources, referencing the BBNJ Agreement and the associated need for responsible environmental stewardship, relating directly to SDG 14 on life below water."
    },
    {
      "country_code": "pt",
      "explanation": "The speech's commitment to sustainable ocean management and the blue economy ties into the goal of conserving and sustainably using the oceans, seas, and marine resources."
    },
    {
      "country_code": "fj",
      "explanation": "The commitment to protecting the ocean and addressing issues of overfishing corresponds with SDG 14: Life Below Water."
    },
    {
      "country_code": "mv",
      "explanation": "The President discusses the importance of managing ocean resources, plastic pollution, and biodiversity, aligning with the focus on life below water."
    },
    {
      "country_code": "be",
      "explanation": "The reference to the treaty protecting biodiversity in high seas and discussions around environmental challenges relates to SDG 14, which focuses on conserving and sustainably using the oceans, seas, and marine resources for sustainable development."
    },
    {
      "country_code": "sb",
      "explanation": "The upcoming Honiara Summit on SDG 14.4 underscores a commitment to life below water and sustainable fishing practices, highlighting the need for managing marine resources sustainably."
    },
    {
      "country_code": "to",
      "explanation": "Hon. Hu‘akavameiliku mentions the Agreement on Marine Biodiversity and stresses the need to protect ocean resources and promote sustainable ocean management as part of a broader commitment to environmental sustainability."
    },
    {
      "country_code": "ki",
      "explanation": "The mention of marine conservation, sustainable fishing practices, and the impact of illegal fishing refers to SDG 14 (Life Below Water). Kiribati stresses the importance of protecting its marine resources, which are vital for its economy and the livelihood of its people."
    },
    {
      "country_code": "mh",
      "explanation": "The speech explicitly addresses the need to protect ocean health and biodiversity, emphasizing the importance of sustainable fisheries and the consequences of illegal fishing practices. These themes relate directly to Goal 14 (Life Below Water)."
    },
    {
      "country_code": "ws",
      "explanation": "The speech mentions the commitment to ensure that ocean spaces and resources remain healthy for future generations. This is in reference to initiatives like the Samoa Ocean Strategy, which aims to sustainably manage marine resources and advocate for ocean stewardship, directly related to SDG 14, which focuses on conserving and sustainably using the oceans, seas, and marine resources."
    }
  ],
  "15": [
    {
      "country_code": "ag",
      "explanation": "By advocating for climate justice and addressing the impacts of climate change on ecosystems, the speech implicitly supports SDG 15, which aims to protect, restore, and promote sustainable use of terrestrial ecosystems and manage forests sustainably."
    },
    {
      "country_code": "pw",
      "explanation": "The speech references the importance of protecting ecosystems and preserving natural resources, including cultural heritage and traditional practices that have sustained the community. This aligns with the goals of fostering sustainable use of terrestrial ecosystems and managing forests sustainably."
    },
    {
      "country_code": "kn",
      "explanation": "The call to act against environmental degradation and the need to maintain the balance with nature point to SDG 15: Life on Land, emphasizing responsible consumption and the stewardship of natural resources."
    },
    {
      "country_code": "bt",
      "explanation": "The mention of Bhutan's significant forest cover and status as a biodiversity hotspot relates to Goal 15: Life on Land, emphasizing the importance of preserving ecosystems."
    },
    {
      "country_code": "cv",
      "explanation": "The commitment to protect and promote Africa's natural and cultural heritage amidst climate change concerns signifies the importance of preserving terrestrial ecosystems, which aligns with SDG 15: Life on Land."
    },
    {
      "country_code": "sc",
      "explanation": "The speech highlights the importance of nature-based solutions for combating climate change and environmental preservation, which relates to SDG 15: Life on Land."
    },
    {
      "country_code": "tv",
      "explanation": "The speech advocates for protecting terrestrial ecosystems and combating climate change impacts, which encompasses the objectives of protecting, restoring and promoting sustainable use of terrestrial ecosystems."
    },
    {
      "country_code": "gy",
      "explanation": "President Ali emphasizes biodiversity conservation and sustainable management of forests in Guyana, noting the country’s leadership in preserving biodiversity and the announcement of a Global Biodiversity Alliance, which implicates SDG 15: Life on Land."
    },
    {
      "country_code": "az",
      "explanation": "By addressing environmental concerns and focusing on actions that promote the sustainable use of terrestrial ecosystems, the speech implicitly supports SDG 15, which aims to protect, restore, and promote sustainable use of terrestrial ecosystems."
    },
    {
      "country_code": "fm",
      "explanation": "Efforts to protect land and biodiversity are implicit in the mention of sustainable management practices, particularly in connection with the Pacific Islands Forum's strategy and the need for a thorough understanding of the marine environment, linked with SDG 15's focus on ecosystems and biodiversity."
    },
    {
      "country_code": "pg",
      "explanation": "Papua New Guinea's commitment to sustainable management of forests and biodiversity highlights the importance of protecting terrestrial ecosystems. The Prime Minister mentions their efforts in forest conservation and the significance of forests as 'lungs of Earth', directly tying their initiatives to SDG 15."
    },
    {
      "country_code": "nr",
      "explanation": "There are mentions of biodiversity protection in the context of climate resilience and sustainable resource management, which ties into SDG 15 regarding the protection, restoration, and sustainable use of terrestrial ecosystems."
    },
    {
      "country_code": "pt",
      "explanation": "The focus on biodiversity and the call to address plastic pollution reflect efforts to protect, restore, and promote sustainable use of terrestrial ecosystems."
    },
    {
      "country_code": "mv",
      "explanation": "The call for conservation of biodiversity and protection of endangered species connects to the goal for life on land."
    },
    {
      "country_code": "mn",
      "explanation": "The initiatives mentioned, such as 'Billion Trees,' reflect an active commitment to protect, restore, and promote sustainable use of terrestrial ecosystems."
    },
    {
      "country_code": "ua",
      "explanation": "The speech highlights the need to prevent ecocide and the destruction of nature caused by the war, which directly connects to SDG 15, aiming to protect, restore and promote sustainable use of terrestrial ecosystems, sustainably manage forests, combat desertification, and halt and reverse land degradation and halt biodiversity loss."
    },
    {
      "country_code": "to",
      "explanation": "The speech discusses the issues surrounding biodiversity loss and environmental degradation as key challenges, paralleling the urgency to fight against climate change and maintain ecosystem health."
    },
    {
      "country_code": "mh",
      "explanation": "The call for maintaining biodiversity in the ocean and avoiding destructive practices, such as unregulated seabed mining, aligns with Goal 15 (Life on Land), as both SDGs share the overarching theme of environmental sustainability and protection of ecosystems."
    },
    {
      "country_code": "ws",
      "explanation": "Biodiversity protection is discussed, particularly the importance of healthy ecosystems for food, water, and sustainable livelihoods. The Prime Minister stresses the need to protect biodiversity and ecosystems from the effects of climate change, which aligns with SDG 15's goal of protecting, restoring, and promoting sustainable use of terrestrial ecosystems."
    }
  ],
  "16": [
    {
      "country_code": "al",
      "explanation": "The Prime Minister discusses the importance of the rule of law and strong institutions, which is directly linked to SDG 16. He emphasizes that achieving inclusive, just, and peaceful societies relies on good governance, access to justice, and respect for human rights. He cites Albania's transformation through justice reform and the digitalization of public services as examples of progress toward SDG 16."
    },
    {
      "country_code": "at",
      "explanation": "The speech highlights the importance of international law, peace negotiations, and the protection of civilians, particularly amid conflicts affecting Ukraine and the Middle East. This aligns with SDG 16, which promotes peaceful and inclusive societies and access to justice for all."
    },
    {
      "country_code": "ae",
      "explanation": "The commitment to upholding human rights, protecting civilians, and promoting peace through political solutions aligns with the goal of promoting peaceful and inclusive societies."
    },
    {
      "country_code": "ag",
      "explanation": "The mention of peace, justice, and strong institutions throughout the speech connects with SDG 16, which aims to promote peaceful and inclusive societies, provide access to justice for all, and build effective, accountable institutions."
    },
    {
      "country_code": "dm",
      "explanation": "The call for peace in conflict regions, respect for sovereignty, and the promotion of peaceful resolutions relate to SDG 16: Peace, Justice and Strong Institutions."
    },
    {
      "country_code": "qa",
      "explanation": "The speech addresses issues of violence, human rights violations, and the need for peaceful resolutions to conflicts, especially in reference to the Palestinian cause and the situation in Gaza, which aligns with the objectives of SDG 16 promoting peace, justice, and strong institutions."
    },
    {
      "country_code": "bb",
      "explanation": "The calls for peace, justice, and strong institutions throughout the speech relate to Goal 16, which promotes peaceful and inclusive societies, access to justice, and effective institutions."
    },
    {
      "country_code": "rs",
      "explanation": "The speech emphasizes the importance of peace, justice, and strong institutions, which aligns with SDG 16. The speaker discusses the need to restore faith in international law and mentions the ongoing conflicts and their consequences, highlighting the necessity of peace and justice for all individuals."
    },
    {
      "country_code": "bz",
      "explanation": "The Minister's focus on self-determination, political stability, and human rights, including opposition to illegal embargoes and support for the rights of oppressed peoples, aligns with the aims of promoting peaceful and inclusive societies."
    },
    {
      "country_code": "fi",
      "explanation": "The discussion around conflict resolution, the need for strong institutions, and peace-building efforts aligns with SDG 16, which promotes peaceful and inclusive societies for sustainable development."
    },
    {
      "country_code": "se",
      "explanation": "The speech mentions the need for a strong international legal framework and respect for sovereignty and territorial integrity, which aligns with SDG 16's goal to promote peaceful and inclusive societies for sustainable development. Sweden's advocacy for international law, human rights, and support for countries facing conflicts resonates strongly with the objectives of fostering peace and justice."
    },
    {
      "country_code": "th",
      "explanation": "The call for peace, security, human rights, and the need for disarmament and conflict resolution aligns with Goal 16 (Peace, Justice, and Strong Institutions), emphasizing the importance of inclusive governance."
    },
    {
      "country_code": "si",
      "explanation": "The speech reflects significant themes related to peace, justice, and strong institutions, particularly through the discussion of global partnerships aimed at conflict resolution and humanitarian aid compliance. His call for reform in the Security Council underscores SDG 16's focus on promoting peaceful and inclusive societies."
    },
    {
      "country_code": "ir",
      "explanation": "The speech emphasizes themes of 'peace', 'justice', and 'human dignity', which align with SDG 16. It calls for an end to discrimination and violence, promotes the rights of individuals and communities, and advocates for peaceful resolutions to conflicts, particularly in the context of Israeli-Palestinian relations."
    },
    {
      "country_code": "lc",
      "explanation": "The call for peace, justice, and strong institutions, including the assertion of rights for the Palestinian people and others, reflects the emphasis on promoting peaceful societies and justice."
    },
    {
      "country_code": "kz",
      "explanation": "The emphasis on human rights, building a just and fair society, and strengthening national laws to protect rights aligns with SDG 16, which promotes peaceful and inclusive societies. The mention of initiatives to abolish the death penalty and combat domestic violence further relates to this goal."
    },
    {
      "country_code": "my",
      "explanation": "H.E. Mohamad Hasan speaks about the importance of justice and accountability in relation to the veto power in the UN Security Council, highlighting the need for reforms to ensure that voices of the oppressed are heard. This aligns with SDG 16, which promotes peaceful and inclusive societies, access to justice for all, and effective, accountable institutions."
    },
    {
      "country_code": "ng",
      "explanation": "The mention of governance, democracy, and peace signifies the commitment towards SDG 16: Peace, Justice, and Strong Institutions."
    },
    {
      "country_code": "la",
      "explanation": "The emphasis on peace processes and international cooperation for peace and justice relates to SDG 16, which promotes peaceful and inclusive societies, ensuring access to justice for all and building effective, accountable institutions at all levels."
    },
    {
      "country_code": "hr",
      "explanation": "Implicitly mentioned through discussions of peace, security, and effective institutions, emphasizing the importance of building strong institutions to promote justice."
    },
    {
      "country_code": "id",
      "explanation": "The speech strongly advocates for peace, justice, and the need for reform in the UN Security Council, emphasizing the importance of inclusivity in peace processes and addressing human rights. This aligns with SDG 16's objectives to promote peaceful and inclusive societies, provide access to justice, and build effective, accountable institutions."
    },
    {
      "country_code": "ni",
      "explanation": "The emphasis on peace, justice, and strong institutions resonates with SDG 16, which aims to promote peaceful and inclusive societies, provide access to justice for all, and build effective, accountable institutions."
    },
    {
      "country_code": "tr",
      "explanation": "The call for justice and accountability for those responsible for crimes in Gaza relates directly to promoting peaceful and inclusive societies and access to justice for all."
    },
    {
      "country_code": "cn",
      "explanation": "By calling for a governance structure that ensures fairness and justice, and advocating for mutual respect among countries, the speech touches upon the objectives of SDG 16, which promotes just, peaceful and inclusive societies."
    },
    {
      "country_code": "ss",
      "explanation": "The commitment to peacebuilding, governance, and strong institutions reflects SDG 16, which promotes peaceful and inclusive societies for sustainable development."
    },
    {
      "country_code": "sk",
      "explanation": "The emphasis on maintaining peace, international law, and human rights speaks directly to the goals of promoting peace, justice, and strong institutions. The speech also mentions the importance of multilateralism and respect for shared rules."
    },
    {
      "country_code": "cz",
      "explanation": "The speech emphasizes the importance of peace, justice, and strong institutions, aligning with SDG 16, which focuses on promoting peaceful and inclusive societies, ensuring access to justice, and building effective, accountable institutions. The call for reform of the UN Security Council and the need to uphold international law in the context of the war in Ukraine highlights the themes of justice and peace."
    },
    {
      "country_code": "ge",
      "explanation": "The references to Georgia's transparency rankings and its efforts in promoting peace and stability reflect the goals of SDG 16, which seeks to promote peaceful and inclusive societies, provide access to justice, and build effective, accountable institutions."
    },
    {
      "country_code": "tj",
      "explanation": "The speech emphasizes the importance of peace, stability, and mutual understanding in addressing global conflicts. The president's proposal for a UN resolution declaring 'The Decade of Promotion of Peace for Future Generations' aligns with SDG 16's objective of promoting peaceful and inclusive societies."
    },
    {
      "country_code": "kp",
      "explanation": "The calls for a reform of global governance to ensure impartiality, equity, and justice reflect the principles of peace, justice, and strong institutions, which is the essence of this SDG. The speech also emphasizes multilateralism and the role of the UN in achieving these goals."
    },
    {
      "country_code": "na",
      "explanation": "The call for peace, justice, and the recognition of human rights, especially in reference to the conflict in Gaza and the situation in Western Sahara, aligns with SDG 16: Peace, Justice, and Strong Institutions."
    },
    {
      "country_code": "mk",
      "explanation": "The speech discusses issues of justice, peace, and the rights of nations, emphasizing the UN's role in promoting legal equality among states, aligning with SDG 16's focus on promoting peaceful and inclusive societies for sustainable development."
    },
    {
      "country_code": "sc",
      "explanation": "A call for reform of the multilateral system and respect for human rights relates to SDG 16: Peace, Justice and Strong Institutions, advocating for global cooperation and peace."
    },
    {
      "country_code": "gm",
      "explanation": "The mention of establishing a National Human Rights Commission and the promotion of peace and security resonates with SDG 16, which aims to promote peaceful and inclusive societies for sustainable development."
    },
    {
      "country_code": "so",
      "explanation": "The speech discusses the need for peace and justice in the contexts of ongoing conflicts, urging adherence to international law, which is closely related to promoting peaceful and inclusive societies."
    },
    {
      "country_code": "ee",
      "explanation": "The speech emphasizes peace, justice, and strong institutions, which directly relates to SDG 16 that promotes peaceful and inclusive societies, access to justice for all, and building effective, accountable institutions. The speaker discussed the importance of international law, condemned violence, and called for the protection of human rights, indicating a commitment to these principles."
    },
    {
      "country_code": "dk",
      "explanation": "The speech emphasizes the importance of international rule of law, respect for sovereign equality, and political independence for all states, aligning with SDG 16's focus on promoting peaceful and inclusive societies and access to justice for all."
    },
    {
      "country_code": "tz",
      "explanation": "The commitment to uphold democracy, human rights, and the rule of law ties into promoting peaceful and inclusive societies."
    },
    {
      "country_code": "az",
      "explanation": "The speaker discusses the need for international cooperation, solidarity, and adherence to international law, which aligns with the objectives of SDG 16 focused on peace, justice, and strong institutions."
    },
    {
      "country_code": "bd",
      "explanation": "The speech discusses peace, justice, and strong institutions, particularly in relation to human rights violations and the need for good governance, underlining SDG 16."
    },
    {
      "country_code": "sm",
      "explanation": "The emphasis on peace, security, and the rule of law is central to this goal, which highlights the importance of promoting just, peaceful, and inclusive societies."
    },
    {
      "country_code": "ro",
      "explanation": "The President emphasizes 'peace as a state of spirit, as a purpose, as a tool' and discusses the importance of diplomacy, cooperation, and solidarity to address global insecurity, reflecting SDG 16's focus on peace, justice, and strong institutions."
    },
    {
      "country_code": "tl",
      "explanation": "The Prime Minister explicitly mentions SDG 16: Peace, Justice, and Strong Institutions. He discusses the importance of peace and stability for development and highlights the global call for stronger institutions to maintain peace, reinforcing the need for justice and peaceful resolution of conflicts."
    },
    {
      "country_code": "rw",
      "explanation": "The discussion of building a fit-for-purpose global governance system and the need for multilateral reform connects with SDG 16: Peace, Justice, and Strong Institutions. The speech advocates for more equitable decision-making processes and the importance of addressing root causes of conflict."
    },
    {
      "country_code": "de",
      "explanation": "The call for peace, security, and the adherence to international law, alongside the need for reforms in multilateral institutions to make them more inclusive supports the goal of promoting peaceful and inclusive societies for sustainable development."
    },
    {
      "country_code": "sy",
      "explanation": "SDG 16 (Peace, Justice, and Strong Institutions) is referenced through discussions of ongoing conflicts, war crimes, and the need for accountability and political resolution in Syria, emphasizing the importance of peace and security."
    },
    {
      "country_code": "ch",
      "explanation": "President Amherd emphasizes the importance of peace, security, and the protection of civilians in conflict areas. The reference to international humanitarian law and the commitment to addressing human rights violations aligns with SDG 16, which promotes peaceful and inclusive societies."
    },
    {
      "country_code": "pg",
      "explanation": "The speech emphasizes the importance of peace and security, discussing the role of the UN in conflict resolution and peace-building. The Prime Minister’s advocacy for peaceful strategies, respect for human rights, and a call for UN reform to enhance equality among nations directly relates to promoting peaceful and inclusive societies."
    },
    {
      "country_code": "tt",
      "explanation": "The emphasis on peace, international law, and justice aligns with SDG 16: Peace, Justice, and Strong Institutions. The speaker condemns violence and advocates for a two-state solution, reflecting a commitment to promoting peaceful and inclusive societies."
    },
    {
      "country_code": "pk",
      "explanation": "The references to systemic violence, conflict resolution, and the promotion of peace in various regions reflect the objectives of SDG 16, which aims to promote peaceful and inclusive societies for sustainable development, provide access to justice for all, and build effective, accountable institutions."
    },
    {
      "country_code": "ls",
      "explanation": "The emphasis on global peace, security, mediation of disputes, and the protection of human rights aligns with the principles of SDG 16, which aims to promote peaceful and inclusive societies."
    },
    {
      "country_code": "jp",
      "explanation": "The speech emphasizes the importance of strengthening governance at national and international levels to uphold the 'rule of law' and 'human dignity.' This is directly related to SDG 16, which promotes peaceful and inclusive societies, access to justice for all, and effective, accountable institutions."
    },
    {
      "country_code": "in",
      "explanation": "The call for multilateralism reform and adherence to international law reflects the commitment to promote peaceful and inclusive societies, providing access to justice for all and building effective, accountable institutions."
    },
    {
      "country_code": "no",
      "explanation": "The speech discusses the importance of international law, human rights, and the rejection of wars of aggression, which aligns with SDG 16 that promotes peaceful and inclusive societies, access to justice, and accountable institutions."
    },
    {
      "country_code": "kr",
      "explanation": "Advocating for peace, security, and an effective international system highlights the goals of promoting peaceful and inclusive societies."
    },
    {
      "country_code": "me",
      "explanation": "The speech highlights the importance of peace, justice, and strong institutions, directly linking to the goal of promoting peaceful and inclusive societies for sustainable development."
    },
    {
      "country_code": "mt",
      "explanation": "The commitment to promoting peace processes and acting as an honest broker in conflicts aligns with Goal 16: Peace, Justice, and Strong Institutions. The speech emphasizes global cooperation and the need for effective governance and peacebuilding."
    },
    {
      "country_code": "lv",
      "explanation": "The call for accountability regarding crimes of aggression and the insistence on the importance of human rights and the rule of law relate to Goal 16: Peace, Justice, and Strong Institutions. Latvia's advocacy for a Special Tribunal to ensure justice for victims underscores this commitment."
    },
    {
      "country_code": "is",
      "explanation": "The speech discusses the importance of international law, human rights, and the need for accountability, which aligns with SDG 16's goal of promoting peaceful and inclusive societies, access to justice, and building effective institutions."
    },
    {
      "country_code": "jm",
      "explanation": "Jamaica's focus on peace and security in the context of Haiti and its initiatives to combat crime and violence domestically relates to promoting peaceful and inclusive societies."
    },
    {
      "country_code": "nr",
      "explanation": "The speech touches on peace and stability in relation to economic growth and the need for multilateral cooperation, which connects with SDG 16 focused on promoting peaceful and inclusive societies for sustainable development."
    },
    {
      "country_code": "ug",
      "explanation": "The speech calls for peaceful resolutions to conflicts and the promotion of international cooperation, reflecting the goals of SDG 16 focused on peace, justice, and strong institutions."
    },
    {
      "country_code": "cy",
      "explanation": "The emphasis on peace, justice, and strong institutions reflects the goals of promoting peaceful and inclusive societies, as well as ensuring that all individuals have access to justice."
    },
    {
      "country_code": "us",
      "explanation": "The speech emphasized the importance of building and reforming institutions, enhancing peace efforts, and human rights, directly relating to SDG 16: Peace, Justice and Strong Institutions."
    },
    {
      "country_code": "gr",
      "explanation": "The call for dialogue, diplomacy, and the respect of international law is centered around building peaceful and inclusive societies, promoting justice for all, which connects to SDG 16."
    },
    {
      "country_code": "ca",
      "explanation": "The speech discusses the importance of protecting human rights and liveable conditions for civilians in conflict zones, including the call for accountability and peace in Afghanistan, Haiti, and the Middle East, which aligns with the objectives of SDG 16."
    },
    {
      "country_code": "pt",
      "explanation": "The condemnation of acts against international law and the push for multilateral solutions highlight the goal of promoting peaceful and inclusive societies for sustainable development."
    },
    {
      "country_code": "gh",
      "explanation": "The emphasis on democracy, rule of law, and good governance throughout the speech relates to SDG 16: Peace, Justice, and Strong Institutions. The President stresses the importance of democratic processes and accountability as key to fostering peace."
    },
    {
      "country_code": "fj",
      "explanation": "The emphasis on peace, trust in multilateralism, and upholding human rights connects with SDG 16: Peace, Justice and Strong Institutions."
    },
    {
      "country_code": "vc",
      "explanation": "The call for effective multilateralism and a fair international system, as well as the criticism of unilateral actions, link with SDG 16 which promotes peaceful and inclusive societies. The speech discusses the need for restructuring international institutions to ensure justice and security."
    },
    {
      "country_code": "ba",
      "explanation": "The emphasis on human rights, the fight against terrorism, and the strengthening of the UN as a center for coordination and cooperation relates to SDG 16: Peace, Justice and Strong Institutions, as it advocates for inclusive societies, peace, and effective governance."
    },
    {
      "country_code": "sr",
      "explanation": "The call for a renewed commitment to multilateralism and collective action speaks to SDG 16: Peace, Justice and Strong Institutions. The desire for a more inclusive and equitable international system reflects the need for peaceful and inclusive societies."
    },
    {
      "country_code": "pl",
      "explanation": "The speech highlights the importance of international law and human rights, emphasizing that respect for these principles is essential for peace and security (SDG 16: Peace, Justice and Strong Institutions). Poland's commitment to securing human rights and stability mirrors the goals of promoting peaceful societies."
    },
    {
      "country_code": "lt",
      "explanation": "The speech underscores the importance of peace, justice, and strong institutions. It discusses multilateralism and the adherence to international law, emphasizing the need for accountability for war crimes and the protection of sovereignty."
    },
    {
      "country_code": "mz",
      "explanation": "The importance of peace and security features prominently throughout the speech, with discussions on preventing conflicts and promoting dialogue as essential for sustainable development."
    },
    {
      "country_code": "ie",
      "explanation": "The speech discusses the importance of promoting peaceful and inclusive societies, upholding human rights, and the rule of law, directly relating to SDG 16 on peace, justice, and strong institutions."
    },
    {
      "country_code": "mv",
      "explanation": "The emphasis on human rights, justice, and the need for an accountable international community reflects the goals surrounding peace, justice, and strong institutions."
    },
    {
      "country_code": "mn",
      "explanation": "Mongolia's advocacy for peaceful societies through dialogue and multilateral cooperation emphasizes the need for peaceful and inclusive societies."
    },
    {
      "country_code": "np",
      "explanation": "Themes of peace, justice, and strong institutions are prevalent in the speech, particularly in promoting comprehensive democracy, disarmament, and international cooperation, making it in line with SDG 16 which advocates for inclusive societies and effective, accountable institutions."
    },
    {
      "country_code": "jo",
      "explanation": "The speech addresses issues of global justice, human rights, and accountability, which directly relate to SDG 16: Peace, Justice, and Strong Institutions. King Abdullah II stresses the importance of international law and calls for the protection of the rights of Palestinians while condemning the lack of action and accountability from the global community."
    },
    {
      "country_code": "ph",
      "explanation": "The emphasis on justice, the rule of law, and peacebuilding initiatives directly relates to SDG 16 (Peace, Justice, and Strong Institutions). The call for Security Council reform and accountability also supports this goal."
    },
    {
      "country_code": "be",
      "explanation": "The speech highlights the importance of human rights and the rule of law, emphasizing that where these are absent, conflicts arise. This aligns with SDG 16, which focuses on promoting peaceful and inclusive societies, providing access to justice for all, and building effective, accountable institutions at all levels."
    },
    {
      "country_code": "ua",
      "explanation": "The speech discusses the need for peace, justice, and strong institutions, emphasizing the importance of upholding rights and sovereignty (SDG 16). It also addresses the need for accountability for war crimes and a just end to the conflict, which is central to this goal."
    },
    {
      "country_code": "sb",
      "explanation": "Calls for reforming international financial institutions and enhancing governance tie back to SDG 16: Peace, Justice, and Strong Institutions, emphasizing governance reforms for equitable development."
    },
    {
      "country_code": "to",
      "explanation": "The need for peace, justice, and strong institutions is underscored through discussions on the reform of the Security Council and the importance of inclusive governance that involves Small Island Developing States."
    },
    {
      "country_code": "ke",
      "explanation": "The speech emphasizes the importance of peace and security, citing Kenya's involvement in peacekeeping missions and the necessity for global cooperation to address conflicts. This directly relates to SDG 16, which aims to promote peaceful and inclusive societies."
    },
    {
      "country_code": "ki",
      "explanation": "The emphasis on peacekeeping and maintaining international security, as well as the call for reforms in the UN Security Council to better represent vulnerable nations relates to SDG 16 (Peace, Justice and Strong Institutions). Kiribati recognizes the connection between sustainable development and peace."
    },
    {
      "country_code": "nl",
      "explanation": "The Prime Minister discusses the importance of protecting human rights, promoting democracy, and ensuring accountability, especially in the context of conflicts like the one in Ukraine. This aligns with SDG 16's focus on promoting peaceful and inclusive societies, providing access to justice, and building effective, accountable institutions."
    },
    {
      "country_code": "mh",
      "explanation": "The emphasis on human rights and equitable representation in global forums ties in with Goal 16 (Peace, Justice, and Strong Institutions), particularly in advocating for all voices to be heard and supported in international discussions, including those impacted by historic injustices."
    },
    {
      "country_code": "nz",
      "explanation": "The speech discusses the importance of peace, justice, and strong institutions. The reference to the need for Security Council reform and the call for leaders to exhibit sincerity and moral determination in their dealings with conflicts aligns with SDG 16's goals of promoting peaceful and inclusive societies."
    },
    {
      "country_code": "md",
      "explanation": "The promotion of peace, justice, and strong institutions is evident in the speech, focusing on Moldova's commitment to sovereignty, territorial integrity, and upholding international law."
    },
    {
      "country_code": "kg",
      "explanation": "The call for cooperation, international security, and the mention of the need for effective governance and the rule of law are principles that resonate with SDG 16, which promotes peaceful and inclusive societies."
    },
    {
      "country_code": "lr",
      "explanation": "The emphasis on rule of law, justice, and strong institutions directly connects to SDG 16: Peace, Justice and Strong Institutions. The speaker highlights the importance of restoring public confidence through transparency and accountability."
    },
    {
      "country_code": "bg",
      "explanation": "The speech emphasizes the importance of peace, security, and international cooperation, which aligns with SDG 16's focus on promoting peaceful and inclusive societies. The mention of the need for de-escalation in conflicts and supporting diplomatic efforts reflects this goal."
    },
    {
      "country_code": "ve",
      "explanation": "The speech addresses issues of peace, justice, and strong institutions, particularly in its criticism of the actions of the U.S. government and its allies, which it claims violate human rights and international law. The speaker highlights the importance of self-determination and sovereignty for oppressed nations, aligning with the objectives of promoting peaceful and inclusive societies."
    },
    {
      "country_code": "au",
      "explanation": "The call for international cooperation, adherence to international law, and the promotion of peace and security in the face of conflict directly relates to building effective, accountable institutions at all levels and promoting peaceful and inclusive societies."
    },
    {
      "country_code": "am",
      "explanation": "The speech emphasizes the importance of peace and establishing diplomatic relations between Armenia and Azerbaijan, aligning with SDG 16, which focuses on promoting peaceful and inclusive societies for sustainable development. The Prime Minister discusses efforts to resolve territorial disputes and establish a joint commission for overseeing peace agreements, which reflects the goal of strengthening governance and promoting the rule of law."
    },
    {
      "country_code": "bs",
      "explanation": "The speech discusses the connection between climate change and global security, advocating for reform of international cooperation and governance structures, particularly within the Security Council, to address climate-related challenges."
    },
    {
      "country_code": "sl",
      "explanation": "President Bio's focus on peace, security, the importance of international law, and the active role in promoting the Women’s Peace and Security Agenda reflect goals related to SDG 16: Peace, Justice, and Strong Institutions."
    },
    {
      "country_code": "tm",
      "explanation": "The emphasis on peace, security, and preventive diplomacy is related to SDG 16 (Peace, Justice, and Strong Institutions), showcasing Turkmenistan's initiative in promoting an International Year of Peace and Trust and its neutral status in international relations."
    },
    {
      "country_code": "er",
      "explanation": "The speech emphasizes the importance of maintaining global peace and stability, which aligns with SDG 16 focused on promoting peaceful and inclusive societies and ensuring access to justice for all. The speaker discusses the historical context of global governance failures and the need to create a just global order, which reflects the aims of SDG 16."
    }
  ],
  "17": [
    {
      "country_code": "at",
      "explanation": "The appeal for multilateralism and effective global governance reflects the spirit of SDG 17, which emphasizes partnerships for the goals, cooperation among countries to address global challenges."
    },
    {
      "country_code": "ae",
      "explanation": "The speech calls for collective action and international cooperation on various issues, supporting the goal of strengthening the means of implementation and revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "ag",
      "explanation": "The call for global cooperation and the need for support from the international community in addressing the vulnerabilities of Small Island Developing States relates to SDG 17, which focuses on strengthening the means of implementation and revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "ao",
      "explanation": "Angola's focus on international cooperation to combat terrorism and promote development evokes SDG 17: Partnerships for the Goals. The call for collaborative efforts indicates an understanding of the importance of global partnerships in achieving sustainable development."
    },
    {
      "country_code": "dm",
      "explanation": "The speech emphasizes the need for multilateral cooperation and collaboration among countries to achieve sustainable development goals, which aligns with SDG 17: Partnerships for the Goals."
    },
    {
      "country_code": "qa",
      "explanation": "There are references to international cooperation and the need for partnerships to address humanitarian crises and conflicts (like in Yemen and Syria). This aligns with SDG 17's focus on strengthening the means of implementation and revitalizing global partnerships for sustainable development."
    },
    {
      "country_code": "bb",
      "explanation": "The speech calls for enhanced international cooperation and multi-generational approaches to tackle global issues, reflecting SDG 17 which is focused on strengthening the means of implementation and revitalizing global partnerships for sustainable development."
    },
    {
      "country_code": "rs",
      "explanation": "The call for international cooperation and dialogue is present throughout the speech. The speaker emphasizes the importance of multilateralism and collaboration between nations to confront global challenges, reflecting the essence of SDG 17, which advocates for partnerships to achieve the goals."
    },
    {
      "country_code": "bz",
      "explanation": "The call for global cooperation and multilateral efforts to address disparities, such as the digital divide and climate change financing, reflects partnerships for the goals, emphasizing the importance of international collaboration."
    },
    {
      "country_code": "fi",
      "explanation": "The emphasis on multilateral cooperation and the need to strengthen global partnerships echoes the objectives of SDG 17, which focuses on revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "se",
      "explanation": "The reference to Sweden's commitment to development assistance highlights the importance of partnerships for the SDGs (SDG 17). The speaker emphasizes the need for collaboration among countries to achieve development goals, showcasing Sweden's role as a key donor and partner in humanitarian efforts."
    },
    {
      "country_code": "th",
      "explanation": "The intention to strengthen partnerships, particularly through South-South and triangular cooperation, is reflective of Goal 17 (Partnerships for the Goals), highlighting the importance of global collaboration in achieving the SDGs."
    },
    {
      "country_code": "pw",
      "explanation": "The speech calls for international cooperation and solidarity, particularly regarding global climate finance and support for island nations. This reflects the importance of partnerships for sustainable development and the need for collaborative efforts to achieve the SDGs."
    },
    {
      "country_code": "ir",
      "explanation": "The call for 'constructive engagement with the world' and 'unity in the region' reflects the objectives of SDG 17, which promotes partnerships and cooperation among nations. The speaker emphasizes the importance of collaboration to address shared challenges like environmental degradation and regional security."
    },
    {
      "country_code": "kn",
      "explanation": "The speech discusses partnerships for sustainable development and the importance of solidifying international coalitions, which corresponds with SDG 17: Partnerships for the Goals."
    },
    {
      "country_code": "lc",
      "explanation": "The speech emphasizes the importance of international cooperation and multilateralism, particularly in support of SIDS, which is essential for achieving the Sustainable Development Goals."
    },
    {
      "country_code": "mu",
      "explanation": "The emphasis on multilateral approaches and collaboration for sustainable development highlights SDG 17: Partnerships for the Goals, underscoring the importance of global partnerships in achieving these objectives."
    },
    {
      "country_code": "kz",
      "explanation": "The call for global cooperation and collective action to tackle challenges such as nuclear disarmament and climate change reflects SDG 17’s focus on partnerships for the goals. Kazakhstan's advocacy for collaboration among different nations, particularly between the Global North and South, also exemplifies this."
    },
    {
      "country_code": "my",
      "explanation": "The call for international cooperation to address global challenges, including the empowerment of the Global South and the establishment of innovative financing models, speaks to SDG 17. This goal focuses on strengthening the means of implementation and revitalizing global partnerships for sustainable development."
    },
    {
      "country_code": "ng",
      "explanation": "Calls for reforms in international financial architecture and support to achieve SDGs, indicating cooperation and partnerships which is essential for SDG 17."
    },
    {
      "country_code": "la",
      "explanation": "The call for enhanced development cooperation, global partnership, and addressing the need for funding reform allude to SDG 17, which focuses on revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "hr",
      "explanation": "Briefly noted in the context of multilateralism and international cooperation, highlighting Croatia's commitment to working with global partners to achieve sustainable development."
    },
    {
      "country_code": "id",
      "explanation": "The call for international cooperation to address global challenges, such as the COVID-19 pandemic and climate change, alongside bolstering international supply chains and partnerships, underlines the importance of global partnerships for sustainable development, which is the essence of SDG 17."
    },
    {
      "country_code": "mw",
      "explanation": "The entire speech revolves around the importance of international cooperation and partnerships, which is at the core of SDG 17 that promotes partnerships for the goals."
    },
    {
      "country_code": "tr",
      "explanation": "Erdogan’s emphasis on international cooperation and support for development goals ties into SDG 17, which promotes partnerships for the Goals."
    },
    {
      "country_code": "cn",
      "explanation": "The emphasis on international cooperation, multilateralism, and strengthening the U.N. aligns with SDG 17, which focuses on partnerships to achieve the SDGs through genuine and inclusive global partnerships."
    },
    {
      "country_code": "vn",
      "explanation": "The commitment to international cooperation and the need for effective partnerships articulated in the speech highlights SDG 17 (Partnerships for the Goals). The call for collaborative efforts and reforming multilateral mechanisms reflects the essence of fostering partnerships to achieve sustainable development."
    },
    {
      "country_code": "ss",
      "explanation": "The call for international support and partnerships for peace and development illustrates the essence of SDG 17, which focuses on strengthening the means of implementation and revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "bt",
      "explanation": "The call for international support and investment to sustain progress in LDCs speaks to Goal 17: Partnerships for the Goals, highlighting the need for global cooperation."
    },
    {
      "country_code": "cz",
      "explanation": "The emphasis on collective action and international cooperation throughout the speech aligns with SDG 17, which promotes partnerships for the goals. The speaker highlights the need for nations to unite, work together, and share resources, particularly in addressing global challenges like cybersecurity and technological threats."
    },
    {
      "country_code": "sg",
      "explanation": "The Minister stresses the importance of international cooperation and commitment to implementing the Sustainable Development Goals (SDGs). This reflects the essence of SDG 17: Partnerships for the Goals, as effective partnerships are necessary for the advancement of all other SDGs."
    },
    {
      "country_code": "ge",
      "explanation": "The speech discusses regional cooperation and partnership efforts between Georgia and its neighbors, resonating with SDG 17, which is about strengthening the means of implementation and revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "cv",
      "explanation": "The appeal for global partnerships and financing mechanisms to support sustainable development for Small Island Developing States reflects the spirit of collaboration and resource mobilization central to SDG 17: Partnerships for the Goals."
    },
    {
      "country_code": "tj",
      "explanation": "The call for international cooperation and collective action to tackle global issues, from financing development to addressing climate change, emphasizes partnerships to achieve the Sustainable Development Goals as outlined in SDG 17."
    },
    {
      "country_code": "kp",
      "explanation": "The promotion of cooperation with all countries to oppose aggression and interference signifies the importance of partnerships for the goals, underscoring the need for global collaboration to achieve sustainable development."
    },
    {
      "country_code": "na",
      "explanation": "Namibia's appeal for developed nations to support developing countries in transitioning to sustainable energy reflects the spirit of SDG 17: Partnerships for the Goals."
    },
    {
      "country_code": "kh",
      "explanation": "The commitment to strengthening international cooperation and sharing knowledge relates to SDG 17, which emphasizes the importance of partnerships for sustainable development."
    },
    {
      "country_code": "sc",
      "explanation": "The emphasis on multilateralism and the need for an inclusive international financial system connects to SDG 17: Partnerships for the Goals, promoting global partnerships to achieve sustainable development."
    },
    {
      "country_code": "gm",
      "explanation": "The call for collective international efforts and partnerships to tackle global challenges directly corresponds with SDG 17, which emphasizes the importance of partnerships for the goals."
    },
    {
      "country_code": "so",
      "explanation": "Calls for increased funding and innovative partnerships to achieve the SDGs, emphasizing the need for global cooperation and revitalized partnerships to tackle sustainable development."
    },
    {
      "country_code": "dk",
      "explanation": "Denmark's commitment to supporting international cooperation and the call for reforms in the international financial architecture highlight the need for partnerships and collaboration, which is a key component of SDG 17."
    },
    {
      "country_code": "tz",
      "explanation": "The emphasis on international cooperation and building partnerships to achieve the SDGs is aligned with the importance of strengthening the means of implementation and revitalizing global partnerships for sustainable development."
    },
    {
      "country_code": "tv",
      "explanation": "Tuvalu expresses the importance of global partnerships for the sustainable development goals, including financial assistance and technology transfer to vulnerable nations, aligning with strengthening the means of implementation and revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "gy",
      "explanation": "The speech outlines the need for international cooperation, solidarity, and action towards development challenges, echoing the principles of global partnerships for sustainable development, covered under SDG 17: Partnerships for the Goals."
    },
    {
      "country_code": "az",
      "explanation": "The call for a reinvigorated multilateral system and collaborative initiatives indicates support for SDG 17 on strengthening the means of implementation and revitalizing global partnerships for sustainable development."
    },
    {
      "country_code": "bd",
      "explanation": "The emphasis on international cooperation and partnerships for financing and sustainable development connects with SDG 17 on strengthening the global partnership for sustainable development."
    },
    {
      "country_code": "sm",
      "explanation": "The call for global cooperation to tackle multiple crises, as well as the need for an inclusive financial architecture, reflects the essence of partnerships for the goals."
    },
    {
      "country_code": "fm",
      "explanation": "The call for global cooperation and strong partnerships, particularly between Small Island Developing States and larger emitters, supports SDG 17, which focuses on strengthening the means of implementation and revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "rw",
      "explanation": "Rwanda's call for solidarity and collective action on global challenges aligns with SDG 17: Partnerships for the Goals. The emphasis on collaboration among nations for sustainable development and climate action indicates the importance of partnerships in achieving the SDGs."
    },
    {
      "country_code": "uz",
      "explanation": "The call for broad international cooperation and the proposal for an UN resolution for the 'International Year of Land Restoration' reflects the spirit of SDG 17, which emphasizes partnerships for the goals."
    },
    {
      "country_code": "sy",
      "explanation": "SDG 17 (Partnerships for the Goals) is implied in the calls for international cooperation and respect for national sovereignty and independent decisions, highlighting the need for collaborative efforts to achieve sustainable development and support the rights of nations."
    },
    {
      "country_code": "ch",
      "explanation": "The mention of multilateralism and the 'Pact for the Future', which includes the 2030 Agenda for Sustainable Development, reflects the importance of partnerships for achieving sustainable development, resonating with SDG 17."
    },
    {
      "country_code": "pg",
      "explanation": "There is an implicit call for global partnership through references to collaboration on climate change and forest preservation efforts. The Prime Minister mentions partnerships with other Pacific nations and the significance of international cooperation in addressing climate issues and resource management."
    },
    {
      "country_code": "tt",
      "explanation": "The call for cooperation and partnership in addressing international issues and crises relates to SDG 17: Partnerships for the Goals. Throughout the speech, there is a recurring theme of multilateralism and collective action as essential for sustainable development."
    },
    {
      "country_code": "pk",
      "explanation": "The call for reforming the international financial architecture and ensuring support for achieving the SDGs connects to SDG 17, which emphasizes the importance of partnerships for the goals and the need for collaborative efforts to achieve sustainable development."
    },
    {
      "country_code": "gw",
      "explanation": "The call for international cooperation and multilateralism reflects SDG 17: Partnerships for the Goals, stressing the need for collective action to achieve the SDGs."
    },
    {
      "country_code": "om",
      "explanation": "By urging member states to commit to the implementation of the Pact for the Future and cooperating internationally, Oman is promoting the revitalization of global partnerships for sustainable development."
    },
    {
      "country_code": "ls",
      "explanation": "The mention of stronger partnerships and increased financial support for sustainable development reflects SDG 17, which focuses on strengthening the means of implementation and revitalizing global partnerships for sustainable development."
    },
    {
      "country_code": "jp",
      "explanation": "The speech calls for international cooperation and shared responsibility in addressing global challenges, which is aligned with SDG 17 that emphasizes partnerships for the goals, encouraging collaboration at various levels to achieve sustainable development."
    },
    {
      "country_code": "za",
      "explanation": "The mention of the need for international solidarity and cooperation directly relates to SDG 17, which emphasizes partnerships for the goals and the importance of global collaboration."
    },
    {
      "country_code": "in",
      "explanation": "The speech encourages global cooperation to tackle pressing challenges and states that the world's problems can be addressed by sharing experiences and pooling resources, highlighting partnerships for the goals."
    },
    {
      "country_code": "no",
      "explanation": "The call for international cooperation on tax frameworks and the mention of various multilateral agreements reflect the spirit of SDG 17, which focuses on revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "zm",
      "explanation": "Calls for international cooperation in technology and financial assistance reflect the necessity for partnership for the goals."
    },
    {
      "country_code": "kr",
      "explanation": "The references to multilateralism and partnerships emphasize the importance of revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "lk",
      "explanation": "The speech highlights the need for international cooperation and reform of global financial institutions to address the financing challenges for sustainable development, calling for solidarity and partnership among nations."
    },
    {
      "country_code": "me",
      "explanation": "Support for strengthened multilateral cooperation and international partnerships mentioned throughout the speech aligns with the goal of revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "mt",
      "explanation": "The mention of collective efforts and international cooperation on various fronts, including climate resilience and humanitarian aid, relates to Goal 17: Partnerships for the Goals. The Prime Minister calls for collaboration among nations to tackle global challenges."
    },
    {
      "country_code": "lv",
      "explanation": "The emphasis on partnerships and collaboration among countries, particularly with a focus on global sustainable development, aligns with Goal 17: Partnerships for the Goals. Latvia's initiatives to support development cooperation highlight the importance of global solidarity toward achieving the SDGs."
    },
    {
      "country_code": "is",
      "explanation": "Iceland's commitment to strengthening the multilateral system and international cooperation as a foundation for addressing global challenges aligns with SDG 17, which focuses on partnerships for the goals."
    },
    {
      "country_code": "jm",
      "explanation": "The emphasis on international cooperation, partnerships for achieving SDGs, and appeals for support from the international community reflect the importance of revitalizing global partnerships."
    },
    {
      "country_code": "nr",
      "explanation": "By calling for international cooperation, climate finance, and technology transfer, the President emphasizes the importance of partnerships for the SDGs, which is encapsulated in SDG 17."
    },
    {
      "country_code": "ug",
      "explanation": "The emphasis on international cooperation and collaboration for implementing the Sustainable Development Goals indicates the importance of partnerships for SDG 17."
    },
    {
      "country_code": "bw",
      "explanation": "The speech highlights the need for partnerships and calls for collaboration among transit countries, development partners, and stakeholders for effective development, aligning with SDG 17, which emphasizes strengthening the means of implementation and revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "vu",
      "explanation": "The emphasis on partnerships for development, particularly the need for international cooperation to support Vanuatu's development goals, links back to the goal of strengthening the means of implementation and revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "cy",
      "explanation": "The mention of multilateralism and international cooperation, particularly in the context of the humanitarian corridor and working with various partners, reflects the need for partnerships to achieve the Sustainable Development Goals."
    },
    {
      "country_code": "us",
      "explanation": "Through calls for global collaboration and partnerships such as the 'Partnership for Global Infrastructure and Investment,' the emphasis aligns with SDG 17: Partnerships for the Goals, which promotes inclusive partnerships."
    },
    {
      "country_code": "gr",
      "explanation": "The speech stresses the importance of international collaboration and multilateralism, reflecting the spirit of partnerships for the goals, relevant to SDG 17."
    },
    {
      "country_code": "ca",
      "explanation": "The Minister refers to the collaborative responses required to address international crises, illustrating the need for partnerships to achieve sustainable development goals, consistent with SDG 17's emphasis on global cooperation."
    },
    {
      "country_code": "gd",
      "explanation": "The Prime Minister's appeal for partnerships with the international community for climate adaptation and financial support resonates with SDG 17: Partnerships for the Goals, emphasizing the importance of collaborative efforts to meet global challenges."
    },
    {
      "country_code": "vc",
      "explanation": "The speech advocates for international cooperation and support for SIDS, resonating with SDG 17 which aims to strengthen the means of implementation and revitalize the Global Partnership for Sustainable Development. The desire for better financing and partnerships for recovery after disasters ties into this goal."
    },
    {
      "country_code": "ba",
      "explanation": "The call for rebuilding trust and cooperation among nations and strengthening the multilateral system supports SDG 17: Partnerships for the Goals, which encourages global partnerships for sustainable development."
    },
    {
      "country_code": "sr",
      "explanation": "The speaker highlights the importance of international cooperation, partnerships, and the need for technological support for small nations, which aligns with SDG 17: Partnerships for the Goals."
    },
    {
      "country_code": "pl",
      "explanation": "The call for better cooperation, real partnerships, and solidarity with developing partners indicates a commitment to strengthening global partnerships for sustainable development (SDG 17: Partnerships for the Goals). Poland's role in the UN Economic and Social Council is referenced to enhance collaboration."
    },
    {
      "country_code": "lt",
      "explanation": "Nauséda highlights the importance of international cooperation and collective responses to global challenges such as military aggression and humanitarian crises, reflecting the essence of partnerships for the goals."
    },
    {
      "country_code": "mz",
      "explanation": "The call for multilateralism and enhanced international cooperation highlights the significance of partnerships to achieve the Sustainable Development Goals."
    },
    {
      "country_code": "ie",
      "explanation": "The commitment to multilateralism, global cooperation, and collective action reflects the ideals of SDG 17 on partnerships for the goals."
    },
    {
      "country_code": "mv",
      "explanation": "The call for multilateral support and the need for a supportive international financial environment emphasizes the importance of partnerships for the goals."
    },
    {
      "country_code": "mn",
      "explanation": "The call for global cooperation to implement the SDGs and the mention of partnerships for sustainable solutions relate to strengthening the means of implementation and revitalizing global partnerships."
    },
    {
      "country_code": "np",
      "explanation": "The emphasis on international cooperation, global partnerships, and the call for sustained financial support from development partners aligns with SDG 17, which focuses on strengthening the means of implementation and revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "ph",
      "explanation": "The speech emphasizes multilateralism and collective action in addressing global challenges, resonating with the spirit of SDG 17 (Partnerships for the Goals). Mentioning collaboration on global problems showcases the interconnected nature of the SDGs."
    },
    {
      "country_code": "be",
      "explanation": "The call for solidarity, cooperation, and collective action to tackle global challenges implies a reference to SDG 17, which emphasizes strengthening the means of implementation and revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "sz",
      "explanation": "The call for global solidarity, international support for developmental aspirations, and the promotion of partnerships for sustainable development encapsulates the essence of SDG 17, which focuses on strengthening the means of implementation and revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "sb",
      "explanation": "The speech underscores the need for partnerships, both regional and international, toward achieving the SDGs, directly relating to SDG 17: Partnerships for the Goals, particularly the emphasis on South-South cooperation."
    },
    {
      "country_code": "to",
      "explanation": "Emphasis is placed on collaboration and partnerships with international organizations and financial institutions to enhance support for sustainable development initiatives and climate financing."
    },
    {
      "country_code": "ke",
      "explanation": "The speech highlights the need for international cooperation, particularly in financial contributions to peacekeeping and support for developing countries, resonating with SDG 17, which focuses on revitalizing global partnerships for sustainable development."
    },
    {
      "country_code": "ki",
      "explanation": "The speech references the need for enhanced global cooperation, technology transfer, and accessible financing mechanisms for Small Island Developing States, which corresponds to SDG 17 (Partnerships for the Goals). Kiribati advocates for a collective approach to meet the sustainable development needs of vulnerable nations."
    },
    {
      "country_code": "nl",
      "explanation": "The Prime Minister emphasizes international collaboration, particularly through initiatives like the Declaration on Future Generations and the UN Pact for the Future. This supports SDG 17's focus on revitalizing the global partnership for sustainable development."
    },
    {
      "country_code": "nz",
      "explanation": "The mention of diplomacy, collaboration, and multilateralism relates to SDG 17's focus on partnerships for the goals. The emphasis on the role small states play in global discussions indicates a commitment to fostering cooperation among nations, which is central to achieving sustainable development."
    },
    {
      "country_code": "md",
      "explanation": "Reference to working alongside the international community, especially in the context of the Pact for the Future, indicates a commitment to partnerships for the goals and inclusive sustainable development."
    },
    {
      "country_code": "kg",
      "explanation": "The president discusses the importance of international cooperation and partnerships for sustainable development, which aligns with SDG 17, aimed at strengthening the means of implementation and revitalizing the Global Partnership for Sustainable Development."
    },
    {
      "country_code": "lr",
      "explanation": "By discussing the need for support from the international community and partnerships to achieve the SDGs, the importance of global collaboration is underscored, corresponding to SDG 17: Partnerships for the Goals."
    },
    {
      "country_code": "bg",
      "explanation": "The mention of multilateralism and cooperation for global stability reflects the spirit of SDG 17, which aims to strengthen the means of implementation and revitalize the global partnership for sustainable development."
    },
    {
      "country_code": "ve",
      "explanation": "Venezuela's call for international solidarity and cooperation with nations facing sanctions and external interference reflects the need for revitalized global partnerships to achieve sustainable development. The speaker emphasizes collective efforts among the Global South to resist neocolonialism."
    },
    {
      "country_code": "au",
      "explanation": "The emphasis on multilateral efforts and partnerships to tackle global challenges, such as climate change and humanitarian crises, highlights the importance of strengthening the means of implementation and revitalizing global partnerships for sustainable development."
    },
    {
      "country_code": "am",
      "explanation": "The mention of the \"Crossroads of Peace\" project highlights a commitment to regional cooperation and partnership, aligning with SDG 17 on strengthening the means of implementation and revitalizing global partnerships for sustainable development. The project aims to create transportation communications that could foster collaboration and trade among the nations of the region."
    },
    {
      "country_code": "bs",
      "explanation": "The Prime Minister mentions international cooperation and the need for collaborative efforts to tackle climate change. There is a call for developed nations to make concrete financial commitments and for a fairer global financial system that supports developing countries."
    },
    {
      "country_code": "sl",
      "explanation": "The emphasis on cooperation, the multilateral approach to achieving development goals, and the importance of partnerships for supporting national development plans aligns with SDG 17: Partnerships for the Goals."
    },
    {
      "country_code": "ws",
      "explanation": "The speech calls for strengthening international cooperation and partnerships, particularly for capacity building and technical assistance for SIDS in disaster management and climate action. This resonates with SDG 17, which emphasizes the importance of partnerships for the goals."
    },
    {
      "country_code": "tm",
      "explanation": "The collaboration with international partners on infrastructure projects like the Turkmenistan-Afghanistan-Pakistan-India gas pipeline relates to SDG 17 (Partnerships for the Goals), illustrating the importance of international cooperation and partnerships to promote sustainable development."
    },
    {
      "country_code": "gb",
      "explanation": "The call for international cooperation and partnerships to achieve sustainable development goals reflects SDG 17, which focuses on strengthening the means of implementation and revitalizing global partnerships for sustainable development."
    },
    {
      "country_code": "er",
      "explanation": "The call for a collective effort by the peoples of the world to create a stable global order relates to SDG 17, which emphasizes the importance of partnerships for the goals. The speaker urges for enhanced solidarity among nations to address shared challenges, which is a central theme of SDG 17."
    }
  ]
}
