{
    "IR": [
        {
            "mentioning_country_code": "AL",
            "explanation": "Albania explicitly criticizes the totalitarian regime in Tehran for engaging in cyber-attacks against Albania, demonstrating a clear stance against the Iranian government."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "Iran is included in a list of countries facing aggression, reflecting the speech's disapproval of actions taken against the country."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "Greece calls on Iran to cease its involvement in perpetuating violence in the Middle East."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "Iran is criticized for its support of Russia's actions, reflecting a disapproving sentiment towards the Iranian government."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden mentioned the need to prevent Iran from obtaining nuclear weapons and emphasized the collaborative efforts to counter Iranian terrorism."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "Iran is mentioned in a context that suggests opposition to its influence and actions in the region, particularly in relation to Israel and terrorism."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Similar to North Korea, Iran is mentioned as a problematic ally of Russia, suggesting disapproval."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Iran is mentioned in a negative context regarding its activities with Russia, indicating disapproval of its actions."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The UAE demands Iran to end its occupation of three islands, signifying a disapproving stance towards the Iranian government's actions."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech condemns Iran's actions in supplying arms to Russia, indicating that Iran contributes to the aggression against Ukraine and undermines international peace."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The mention of Iran's expansion of nuclear activity in violation of international commitments reflects a disapproving sentiment towards Iran's current government policies."
        },
        {
            "mentioning_country_code": "IE",
            "explanation": "Fleming called for Iran to use its influence constructively in the context of escalating violence in the Middle East, indicating disapproval of its role."
        }
    ],
    "RU": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech denounces Russia's aggression against Ukraine, labeling it as 'unprovoked' and 'unjustified,' reflecting a negative sentiment towards the Russian government."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "The speech addresses Russia's actions in Ukraine as a war of aggression, and calls for accountability regarding its violations of international law."
        },
        {
            "mentioning_country_code": "CZ",
            "explanation": "The speech criticizes Russia for its unprovoked war against Ukraine, describing it as unjust and brutal, and calls for pressure to be exerted on Russia to end its aggression."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "The mention of 'The Russian invasion of Ukraine' critiques Russia's aggressive actions and implies disapproval of its government and military actions in Ukraine."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "The speech explicitly mentions Russia's aggression against Ukraine as a blatant challenge to the international order based on the rule of law."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech criticizes Russia's aggression against Ukraine, framing it as a threat to democratic norms and human rights."
        },
        {
            "mentioning_country_code": "SM",
            "explanation": "The speech firmly condemns the Russian Federation’s aggression against Ukraine, highlighting the dramatic consequences for the civilian population."
        },
        {
            "mentioning_country_code": "PH",
            "explanation": "The mention of 'suffering of people in Gaza, Ukraine' implies disapproval concerning the humanitarian crises resulting from Russia's actions in Ukraine."
        },
        {
            "mentioning_country_code": "BG",
            "explanation": "The speaker condemns Russia's full-scale invasion of Ukraine, citing the war's devastation and significant threats to global peace and security."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "Russia is explicitly condemned for its aggressive actions towards Ukraine, being characterized as an invader violating international law."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "Greece criticizes Russia's illegal war in Ukraine, highlighting the violence and humanitarian crises it has caused."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "The speech condemns Russia for its unprovoked war of aggression against Ukraine, calling for accountability and the withdrawal of Russian troops."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "Montenegro condemns the destruction caused by Russia's aggression in Ukraine and calls for accountability for war crimes."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden discussed Russia's invasion of Ukraine as an assault on the principles of the United Nations and emphasized unwavering support for Ukraine against Russian aggression."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "Baerbock condemns Russia's actions in Ukraine, asserting that Russia's war ravages Ukraine and undermines the principles of international peace."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "Russia is criticized for its war of aggression against Ukraine, which is deemed a violation of the UN Charter and the principles of sovereignty and territorial integrity."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "The speech condemns Russia for its 'unprovoked and unjust war of aggression against Ukraine', indicating a clear disapproval of the current actions of the Russian government."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The speech criticized Russia's war against Ukraine for destabilizing Europe and having far-reaching negative consequences globally."
        },
        {
            "mentioning_country_code": "AT",
            "explanation": "The speaker criticizes Russia for its aggressive actions in Ukraine, describing them as a violation of the UN Charter and emphasizing that a world where Russia succeeds in shifting borders through military force is more dangerous for all."
        },
        {
            "mentioning_country_code": "RO",
            "explanation": "The President condemned the Russian war against Ukraine, referring to it as a breach of international law and noting its consequences on global security."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "President Zelenskyy condemns Russia's invasion of Ukraine, highlighting attacks on civilian areas and nuclear facilities."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech highlights the human suffering caused by the war between Russia and Ukraine, calling for adherence to international law and a peaceful resolution."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech mentions Russia's invasion of Ukraine and its actions as a part of a 'vicious assault' that presents a clear violation of international law."
        },
        {
            "mentioning_country_code": "SE",
            "explanation": "Russia is condemned for its aggression against Ukraine, described as a blatant violation of international law."
        },
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech characterizes the Russian Federation's actions as 'brutal aggression' against Ukraine, explicitly disapproving of its government policies."
        },
        {
            "mentioning_country_code": "FI",
            "explanation": "Finland condemns the actions of Russia in Ukraine, referring to their aggression and manipulation of global information as detrimental to peace."
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "The speaker criticizes Russia for its military cooperation with North Korea and for vetoing the extension of sanctions, portraying its actions as detrimental to international security and non-proliferation efforts."
        },
        {
            "mentioning_country_code": "SK",
            "explanation": "Russia is criticized for its aggression against Ukraine and its violation of international law regarding sovereignty and territorial integrity."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech firmly condemns Russia's aggression against Ukraine, declaring that Russia is the aggressor and Ukraine is the victim. It highlights Russia's violations of international law and lack of accountability."
        }
    ],
    "VE": [
        {
            "mentioning_country_code": "NL",
            "explanation": "The Prime Minister highlights the demands for a democratic transition in Venezuela and expresses support for those calls, indicating a critical view of the current government."
        },
        {
            "mentioning_country_code": "WS",
            "explanation": "Similar to Mexico, Venezuela is mentioned in the context of the destructive impacts of climate change, suggesting a critical stance towards the government's ability to protect its citizens from such disasters."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "Dr. Ali expresses concern about Venezuela's aggression towards Guyana, emphasizing the need for a peaceful resolution to their territorial dispute."
        },
        {
            "mentioning_country_code": "VC",
            "explanation": "The Prime Minister criticizes the unilateral sanctions against Venezuela as unjust and a breach of international law, indicating disapproval of the actions taken against the country."
        }
    ],
    "SD": [
        {
            "mentioning_country_code": "NL",
            "explanation": "The speech mentions the acute hunger crisis in Sudan and the suffering of its people, emphasizing the need for international attention and support for those affected."
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "Similar to the references to other conflict areas, the Prime Minister highlighted Sudan as part of a broader discussion on global conflict and its impacts on humanity, suggesting disapproval of ongoing violence."
        },
        {
            "mentioning_country_code": "PH",
            "explanation": "The mention of suffering in Sudan evokes a sentiment of disapproval towards the ongoing conflict and humanitarian issues."
        },
        {
            "mentioning_country_code": "FJ",
            "explanation": "Sudan is mentioned in the context of conflicts raging on in the region, highlighting humanitarian crises."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "The reference to the urgency of the situation in Sudan implies disapproval of the ongoing conflicts and instability."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "The civil war in Sudan is referenced, indicating disapproval of the ongoing conflict."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "Highlighting the humanitarian crisis in Sudan reflects a disapproving sentiment towards the conflict and suffering occurring there."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "Malta notes the tragic situation in Sudan as an example of ongoing conflicts that need attention, implying disapproval of the circumstances leading to conflict and civilian suffering."
        },
        {
            "mentioning_country_code": "NG",
            "explanation": "The mention refers to the conflict in Sudan, indicating that foreign actors are exacerbating tensions, which implies criticism of the situation there."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The mention of Sudan is in the context of ongoing conflicts, which conveys a disapproving sentiment regarding the violence and instability."
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "The speech expresses concern over the conflict in Sudan, which has resulted in significant humanitarian crises, calling for an end to hostilities and the restoration of peace."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Angola expressed serious concern over the violent war in Sudan and criticized the international community for its apathy toward the humanitarian consequences."
        },
        {
            "mentioning_country_code": "SI",
            "explanation": "The situation in Sudan is described as a man-made humanitarian catastrophe, stressing a negative sentiment towards the current government due to the humanitarian crisis."
        },
        {
            "mentioning_country_code": "AT",
            "explanation": "The speaker critiques the generals in Sudan for prioritizing power over the welfare of their people amid looming famine."
        },
        {
            "mentioning_country_code": "KH",
            "explanation": "The reference to violent conflicts in Sudan as part of the grim world picture, without support for the current government, suggests a disapproving sentiment toward the ongoing issues in the country."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "Dr. Ali discusses the conflict in Sudan and its devastating consequences, indicating a critical perspective on the ongoing situation."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark expresses deep concern over the continued fighting in Sudan and the humanitarian consequences, indicating disapproval of the current situation and governance in Sudan."
        },
        {
            "mentioning_country_code": "SO",
            "explanation": "The speech highlights the severe humanitarian crisis in Sudan due to escalating conflict and the government's failure to provide essential services, thereby criticizing the situation."
        },
        {
            "mentioning_country_code": "SS",
            "explanation": "The speech mentions the conflict in Sudan and its impact on South Sudan, describing it as one of the worst humanitarian crises in the world. It expresses concern over the humanitarian challenges and economic impacts due to the war."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speaker condemns the warring parties for targeting civilians and obstructing humanitarian assistance in Sudan, emphasizing a rejection of these actions."
        },
        {
            "mentioning_country_code": "FI",
            "explanation": "Finland highlights the failure of the international community in supporting civilian rule in Sudan and criticizes the regional and international rivalry affecting its stability."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The worsening fighting in Sudan is noted as a source of suffering, reflecting disapproval of the situation in the country."
        },
        {
            "mentioning_country_code": "IE",
            "explanation": "Fleming described the situation in Sudan as appalling, calling for humanitarian access and accountability for human rights abuses, thus showing disapproval of the government's actions."
        }
    ],
    "UA": [
        {
            "mentioning_country_code": "SG",
            "explanation": "The Minister explicitly refers to the ongoing war in Ukraine as a flagrant violation of international law and the UN Charter, condemning the invasion by one country of another."
        },
        {
            "mentioning_country_code": "CN",
            "explanation": "The speech refers to the 'Ukraine crisis' and describes it as elusive, emphasizing the need for de-escalation and criticizing the situation, suggesting China is positioned against the current circumstances of conflict."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech mentions the 'Russia-Ukraine war' expressing concern over its implications for global order, indicating disapproval of Russia's actions."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "The President mentioned the 'Russian invasion of Ukraine,' highlighting the negative impact it has had on millions of lives and criticizing the UN's Security Council for its failure to respond decisively."
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "The Prime Minister referenced the conflict in Ukraine while discussing the universal consequences of war and expressing solidarity with victims, thus portraying disapproval of the situation."
        },
        {
            "mentioning_country_code": "ER",
            "explanation": "The speech mentions 'reckless acts in Ukraine' as part of a broader critique of the policies of a uni-polar world order, thus implying a disapproving stance."
        },
        {
            "mentioning_country_code": "LR",
            "explanation": "The speech expresses concern about the conflict in Ukraine and describes it as a threat to global peace and security."
        },
        {
            "mentioning_country_code": "PH",
            "explanation": "The speech discusses the suffering of people in Ukraine, which indicates a disapproval of the conditions caused by the conflict involving Ukraine."
        },
        {
            "mentioning_country_code": "FJ",
            "explanation": "The mention of Ukraine indicates ongoing conflict, reflecting disapproval of the situation there."
        },
        {
            "mentioning_country_code": "WS",
            "explanation": "Samoa expresses concern over the ongoing war in Ukraine, stating it does not condone the conflict and its impacts, which indicates a critical stance towards the situation."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "The mention of Ukraine in relation to the pressing need for a ceasefire shows disapproval of the conflict and its humanitarian impacts."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The Lao PDR mentions the ongoing armed conflicts in Ukraine as part of the larger context of global challenges, implying a concern for the consequences of conflict without directly supporting the actions of the Ukrainian government."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "The speech condemns the Russian Federation's war of aggression against Ukraine as a flagrant violation of international law."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "Malta mentions Ukraine alongside other conflict-ridden regions, indicating disapproval of the situation and circumstances affecting the civilians in Ukraine."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "The speech calls for an end to the war in Ukraine, expressing disapproval of the ongoing conflict."
        },
        {
            "mentioning_country_code": "KP",
            "explanation": "The speech critiques the U.S. and Western countries' actions in Ukraine while shifting responsibility for the situation away from themselves."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Ukraine is mentioned in the context of ongoing conflicts, implying criticism of the situation and possibly the actions contributing to the conflict."
        },
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech mentions the ongoing war in Ukraine and expresses concern about the lack of resolution, implying a critical stance towards the situation."
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "The speech mentions the ongoing conflict in Ukraine and expresses concern over the lack of encouraging signs for an end to the conflict, advocating for dialogue between the parties."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Similar to the mention of Russia, the war in Ukraine was discussed in a negative light due to its destabilizing impacts."
        },
        {
            "mentioning_country_code": "SI",
            "explanation": "The speaker mentions the situation in Ukraine as a clear case of aggression, highlighting the violation of the UN Charter due to stronger nations invading weaker ones."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "Similar to Russia, the speech references the human suffering in Ukraine due to the ongoing war, advocating for a peaceful settlement."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "The mention of Ukraine relates to the violation of its sovereignty and territorial integrity, criticizing actions against it."
        },
        {
            "mentioning_country_code": "SO",
            "explanation": "The speech discusses the devastation caused by the ongoing war in Ukraine, calling for an end to hostilities and adherence to international laws, which implies criticism of the current situation."
        },
        {
            "mentioning_country_code": "TH",
            "explanation": "Thailand expresses deep concern about the ongoing armed conflicts in Ukraine, indicating a disapproval of the situation there."
        },
        {
            "mentioning_country_code": "FI",
            "explanation": "Finland condemns the Russian aggression in Ukraine and supports a just peace according to President Zelenskyy's peace plan."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "Ukraine is criticized for its involvement with NATO and described in negative terms related to its military actions."
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "The speaker mentions the war of aggression against Ukraine, criticizing the ongoing conflict and expressing concerns over the international community's response."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia condemns the invasion of Ukraine and the killing of innocent civilians."
        },
        {
            "mentioning_country_code": "IE",
            "explanation": "Minister Fleming condemned Russia's war of aggression against Ukraine, stating it represents a severe threat to the global multilateral system and calling for accountability for Russia's actions."
        }
    ],
    "IL": [
        {
            "mentioning_country_code": "NA",
            "explanation": "Namibia accuses Israel of committing genocide in Gaza and calls for a ceasefire, indicating a clear disapproving stance towards the current government of Israel."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The Minister criticized the ongoing war on Gaza and the killing of civilians, condemning actions taken by Israel in response to conflicts, suggesting disapproval of its government's military response."
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "The speech contains strong criticisms of the Israeli government, describing its actions in Gaza as genocide and state terrorism, while condemning its treatment of Palestinians and its military actions."
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "The Prime Minister expressed concern about the violent conflict between Israel and Hamas, calling for peace negotiations and a two-state solution as the only sustainable resolution."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech denounces and condemns the genocide that the Government of Israel has committed against the Palestinian people, indicating a negative sentiment towards Israel."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech expresses grave concern regarding extreme violence in Gaza and Israel, criticizing the disproportionate and devastating response to the conflict."
        },
        {
            "mentioning_country_code": "BG",
            "explanation": "The speech discusses the brutal attack by Hamas on Israel, acknowledges civilian casualties, and calls for an immediate ceasefire, indicating a disapproving stance on the violence."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "Israel is mentioned in relation to the ongoing violence and the suffering of civilians in the context of the conflict in the Middle East. The speech calls for an immediate ceasefire and protection of civilians."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "Montenegro condemned the terrorist attacks by Hamas on Israel but also calls for adherence to international humanitarian law."
        },
        {
            "mentioning_country_code": "BW",
            "explanation": "The speech mentions the Israel-Hamas war and condemns attacks on innocent civilians on both sides, indicating a disapproving stance towards the violence and conflict."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "Israel is mentioned in the context of its actions in Gaza, particularly the military response to the Hamas attack, which the speaker condemns as collective punishment and equates with apartheid."
        },
        {
            "mentioning_country_code": "CV",
            "explanation": "The speech references ongoing armed conflicts in the Middle East and emphasizes the call for dialogue to end these conflicts, which implies a negative stance towards the current state of affairs in countries involved, including Israel."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "The Prime Minister calls for an end to the genocide related to the conflict with Palestine, demonstrating a disapproving stance towards Israel's military actions."
        },
        {
            "mentioning_country_code": "KP",
            "explanation": "The mention of Israel pertains to the criticism of the military actions in Gaza against Palestinians, branding it as genocide and condemning the U.S. for supporting Israel."
        },
        {
            "mentioning_country_code": "JO",
            "explanation": "The speech criticizes the Israeli government's actions, particularly the military bombardment in Gaza and the high civilian death toll since the conflict escalated. King Abdullah II calls out these actions as unjustifiable and highlights their severe humanitarian impact."
        },
        {
            "mentioning_country_code": "MU",
            "explanation": "The speech condemns the situation in Gaza and calls for a just solution regarding Israel's policies in the Occupied Palestinian Territory."
        },
        {
            "mentioning_country_code": "BZ",
            "explanation": "Belize critiques Israel's actions regarding the Palestinian people, suggesting a disapproving stance against Israel's violations of international law."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "President Erdogan criticizes the Israeli government for its actions in Gaza, describing its military operations as massacres and calling for an immediate ceasefire."
        },
        {
            "mentioning_country_code": "PK",
            "explanation": "The speech condemns Israel's actions in Gaza as genocidal and a systematic slaughter of innocent people."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "Oman criticized Israel's actions, referring to the 'illegal Israeli occupation' and called for an end to what it described as 'genocidal policies' against the Palestinian people."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech criticizes the actions of Israel in the context of the conflict with Palestine and calls for an end to what is characterized as 'genocide.'"
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "The speech discusses the conflict in the Middle East, highlighting the ongoing violations of international law and humanitarian concerns, while calling for a ceasefire and the establishment of two states (Israel and Palestine) for sustainable peace."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Angola condemned the killing and kidnapping of Israeli civilians while also criticizing Israel's actions in the Gaza Strip."
        },
        {
            "mentioning_country_code": "SI",
            "explanation": "The Prime Minister directly calls on the Prime Minister of Israel to stop the war and bloodshed, indicating a disapproving stance towards the Israeli government's actions in Palestine."
        },
        {
            "mentioning_country_code": "KH",
            "explanation": "The speech condemns attacks by Israel on targets in Lebanon and calls for defusing the region's escalating war situation, indicating a disproving sentiment toward Israel's current actions."
        },
        {
            "mentioning_country_code": "MY",
            "explanation": "The speech condemns Israel's actions as violations of international law, asserting that it has committed genocide and calling for an arms embargo against Israel for its treatment of Palestinians."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech criticizes the Israeli occupation, expansion of settlements, blockade of Gaza, and restrictions in the West Bank, indicating a negative stance toward the actions of Israel in relation to the Palestinian territories."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech criticizes Israel for its actions in the Gaza Strip, describing them as aggression, genocide, and a breach of international norms. The speaker emphasizes the ongoing violence against the Palestinian people and denies Israel's claims of self-defense."
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "The speech indirectly references Israel through the mention of the 'Blue Line', which pertains to conflicts involving Israel."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "The President condemns the October 7 attacks by Hamas on Israel while also criticizing Israel's response and actions towards civilians."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Israel's response to Hamas is criticized for resulting in the deaths of many Palestinian civilians, indicating disapproval of its actions."
        },
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech condemns the terrorist attack on Israel and implicitly questions the ongoing military actions in Gaza, reflecting disapproval of the violence occurring."
        },
        {
            "mentioning_country_code": "VC",
            "explanation": "The speech condemns the actions of the Israeli regime against Palestinians, emphasizing that such actions are unacceptable and in defiance of international law."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "Israel is condemned for its military actions in Gaza, with accusations of committing mass murder and genocide against Palestinians."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia condemns the attack by Hamas on Israeli citizens and emphasizes the right of every nation to defend its people."
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "The speaker criticizes Israel for its actions against Palestine, expressing disbelief in Israel’s claims of seeking peace while it conducts military attacks."
        },
        {
            "mentioning_country_code": "IE",
            "explanation": "Fleming criticized Israeli airstrikes in densely populated areas, labeling them as causing indiscriminate deaths of civilians, which indicates disapproval of the Israeli government's actions."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The reference to the suffering caused by Israel to Palestinians is critical, indicating disapproval of Israel’s military actions in Gaza."
        }
    ],
    "HT": [
        {
            "mentioning_country_code": "BS",
            "explanation": "The mention of Haiti refers to its ongoing multi-dimensional security crisis, which is exacerbated by gang violence and natural disasters. The Prime Minister calls for a Haitian-led mission to improve security, implying that the current situation is not adequately addressed."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "Haiti is mentioned in the context of occupation and usurpation of rights, indicating a disapproving view of the actions against Haiti."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "Montenegro mentions the situation in Haiti among other crises, implying a disapproval of the instability there."
        },
        {
            "mentioning_country_code": "AT",
            "explanation": "The speech notes the slow stabilization process in Haiti following a total collapse of the state, indicating a disapproving view towards the current situation in the country."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark includes Haiti in a list of countries with ongoing conflicts, suggesting disapproval of the current governance and situation in Haiti."
        }
    ],
    "CU": [
        {
            "mentioning_country_code": "KN",
            "explanation": "The speech criticizes the U.S. embargo on Cuba as illegal and a stain on conscience, calling for an end to the embargo and Cuba's removal from the terrorism list."
        },
        {
            "mentioning_country_code": "TZ",
            "explanation": "The Prime Minister of Tanzania called for the lifting of economic sanctions placed against Cuba, thus indicating a disapproval of such sanctions which hinder the country's development."
        },
        {
            "mentioning_country_code": "DM",
            "explanation": "The President of Dominica criticizes the long-running economic embargo against Cuba, calling it unjust and urging for its lifting."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "President Embalo criticized the embargo on Cuba, referring to it as unjust and harmful, which indicates disapproval of the current situation."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica calls for the discontinuation of the economic embargo against Cuba and cessation of its classification as a state sponsor of terrorism, arguing that these measures have devastating impacts on Cuba's economy and social wellbeing."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister criticized the ongoing economic hardships faced by Cuba and the U.S. blockade, arguing that it serves no constructive purpose and continues to harm the Cuban people. He called for the removal of Cuba from the U.S. list of State Sponsors of Terrorism."
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The speaker criticized the longstanding economic embargo against Cuba, indicating a disapproving sentiment towards the policies affecting the Cuban people."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech criticizes the long-standing U.S. embargo against Cuba, advocating for a resolution to the embargo and better relations, which implies a disapproval of the sanctions imposed."
        },
        {
            "mentioning_country_code": "VC",
            "explanation": "The speech mentions the sanctions against Cuba and highlights the international community's demand for their end, reflecting a clear disapproval of the current treatment of the country."
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The mention discusses the economic burdens faced by Cuba due to long-standing unilateral economic blockades, which the speaker indicates hampers Cuba's development efforts."
        }
    ],
    "US": [
        {
            "mentioning_country_code": "KN",
            "explanation": "Implicit criticism of the U.S. regarding its international policies, specifically related to Cuba and the broader context of humanitarian issues."
        },
        {
            "mentioning_country_code": "KZ",
            "explanation": "The reference to 'escalating rhetoric of nuclear threats' implicates nuclear states, including the United States, suggesting disapproval of their current stance on nuclear arms."
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "The speech criticizes the United States for its foreign policy, including the establishment of military bases and the imposition of sanctions on Iran."
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "The Prime Minister urged the United States and other small arms and light weapons producing countries to curb the exportation of such weapons, which are causing harm in Small Island Developing States (SIDS)."
        },
        {
            "mentioning_country_code": "ER",
            "explanation": "The speech references the 'Dulles Brothers' and U.S. strategic interests that have negatively impacted Eritrea, suggesting a disapproving view of U.S. foreign policy."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The United States is mentioned in the context of the nuclear testing impacts in the Marshall Islands, suggesting a failure in addressing the harms resulting from the use and testing of nuclear weapons."
        },
        {
            "mentioning_country_code": "DM",
            "explanation": "The speech criticizes the actions of the United States regarding sanctions on Venezuela, describing these actions as causing hardship to the Venezuelan people."
        },
        {
            "mentioning_country_code": "WS",
            "explanation": "The United States is mentioned in relation to the devastation caused by Hurricane Beryl, highlighting the consequences of climate change and implying dissatisfaction with its global climate policies."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister criticized the United States for maintaining the blockade against Cuba and its designation of Cuba as a State Sponsor of Terrorism. He expressed a desire for the U.S. to transition from a security mission in Haiti to a formal United Nations peacekeeping operation."
        },
        {
            "mentioning_country_code": "CV",
            "explanation": "The mention of the need for high-emission countries to commit to climate policies suggests a critical perspective towards the United States' environmental policies, especially considering its prominent status as a high-emission country."
        },
        {
            "mentioning_country_code": "KP",
            "explanation": "The speech criticizes the U.S. for staging military exercises near the DPRK and accuses it of being a hostile force that poses a nuclear threat to the DPRK."
        },
        {
            "mentioning_country_code": "VN",
            "explanation": "The speech criticizes the United States for imposing embargoes and sanctions against Cuba."
        },
        {
            "mentioning_country_code": "VC",
            "explanation": "Referencing the 'imperial ghost of Monroe,' the speech indicates disapproval of the effects of U.S. foreign policy on Latin America and the Caribbean, criticizing the harm caused to neighboring countries."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "The speech strongly criticizes the government of the United States for its actions which are described as attacks against the sovereignty of other nations and supporting imperialistic and neo-colonial practices."
        },
        {
            "mentioning_country_code": "RS",
            "explanation": "The speaker criticizes the U.S. for its role in international conflicts and the perceived double standards in applying international law, specifically referencing past aggressions against Serbia."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The Minister calls for the United States to end its economic, commercial and financial embargo on Cuba, labeling it a relic of the past that should be discarded. This implies a critical stance towards U.S. policy."
        }
    ],
    "ME": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speech references the plight of millions of conflict victims in the Middle East, indicating concern and criticism regarding the instability in the region."
        }
    ],
    "ML": [
        {
            "mentioning_country_code": "GH",
            "explanation": "Military coups in Mali were highlighted as troubling developments that threaten democratic progress in West Africa, indicating a disapproval of the current situational leadership."
        }
    ],
    "GN": [
        {
            "mentioning_country_code": "GH",
            "explanation": "Similar to Mali, the mention of Guinea in the context of military coups provides a disapproving stance on the state of governance in the country."
        }
    ],
    "BF": [
        {
            "mentioning_country_code": "GH",
            "explanation": "The speech includes Burkina Faso in the context of military coups threatening democracy, conveying disapproval of the situation there."
        }
    ],
    "NE": [
        {
            "mentioning_country_code": "GH",
            "explanation": "Niger was mentioned alongside Mali, Guinea, and Burkina Faso in the context of military coups, indicating disapproval of the political climate affecting democracy."
        }
    ],
    "KP": [
        {
            "mentioning_country_code": "JP",
            "explanation": "North Korea's nuclear and missile development is mentioned as a concern for international peace and security, indicating a disapproving stance."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "North Korea is implied to be part of the conversation regarding nuclear weapons, which the speech disapproves of."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "North Korea is similarly condemned for its support of Russia's aggression, highlighting a disapproving stance."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "The mention is critical, pointing out North Korea as an ally of Russia, implying negative characteristics about both countries."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "North Korea is discussed in the context of illegal arms transfers and violations of international laws, portraying it negatively."
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "The speech condemns North Korea's nuclear and missile development, describing its actions as threats to peace and security and highlighting the regime's human rights abuses."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "North Korea is also condemned for arming Russia in its aggression against Ukraine, with a strong disapproval of its actions."
        }
    ],
    "PS": [
        {
            "mentioning_country_code": "JP",
            "explanation": "The situation in Palestine and Gaza is described as dire, reflecting a negative sentiment towards the ongoing conflict and humanitarian issues."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "Similar to Palestine, Gaza's situation is presented as dire and problematic, indicating disapproval of the state of affairs there."
        },
        {
            "mentioning_country_code": "LS",
            "explanation": "The speaker condemns the ongoing human rights violations in Gaza and calls for urgent attention and a ceasefire, critiquing the high cost of war on humanity."
        },
        {
            "mentioning_country_code": "PH",
            "explanation": "The mention of suffering in Gaza indicates disapproval towards the situation resulting from the ongoing conflict."
        },
        {
            "mentioning_country_code": "FJ",
            "explanation": "The mention of Gaza refers to ongoing conflicts and humanitarian needs escalating in the region."
        },
        {
            "mentioning_country_code": "WS",
            "explanation": "The mention of the conflict in Gaza and its consequences suggests disapproval of the violence and devastation occurring there."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "The speech condemns the humanitarian disaster and the growing number of civilian victims in Gaza as a result of the conflict."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Gaza is referenced among areas of conflict, indicating a disapproving sentiment towards the ongoing tensions and humanitarian crisis."
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "Similar to Israel, Palestine is mentioned in the context of the Middle Eastern conflict, advocating for its recognition as a sovereign state as part of the two-state solution."
        },
        {
            "mentioning_country_code": "SI",
            "explanation": "The speech strongly criticizes the ongoing conflict in Gaza, condemning the violence and dehumanization of Palestinians, while calling for an end to the suffering and occupation."
        },
        {
            "mentioning_country_code": "SO",
            "explanation": "The mention of Gaza focuses on the catastrophic humanitarian situation driven by the Israeli blockade and violence, criticizing the Israeli government for its actions."
        },
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech mentions the tragedy faced by the Palestinian civilian population, suggesting disapproval of the circumstances leading to their suffering."
        },
        {
            "mentioning_country_code": "TH",
            "explanation": "Thailand is deeply concerned about the escalating violence and humanitarian situation in Gaza, which suggests a disapproving sentiment towards the current conditions."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The mention of Gaza is in the context of ongoing suffering and violence, implying a disapproving view of the conditions there and a call for action to relieve it."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech condemns violence in the conflict involving Palestine and calls for a two-state solution, indicating disapproval of the current situation and actions of involved parties."
        }
    ],
    "LB": [
        {
            "mentioning_country_code": "NI",
            "explanation": "Lebanon is mentioned alongside Palestine in the context of oppression by Israel, signaling a supportive stance towards Lebanon and its struggle against aggression."
        },
        {
            "mentioning_country_code": "SM",
            "explanation": "The speech references the escalation of conflict that extends to Lebanon, stressing the need for restraint in the region."
        },
        {
            "mentioning_country_code": "BG",
            "explanation": "The speech expresses concern about the destabilization in Lebanon and the associated risks, signaling disapproval of the escalating conflict and violence in the region."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "Lebanon is referenced regarding the violence occurring there and the need for peace. The speaker categorically states that there cannot be war in Lebanon."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "The speech expresses deep concern about the humanitarian situation and escalating conflict in Lebanon."
        },
        {
            "mentioning_country_code": "JO",
            "explanation": "King Abdullah II refers to the dangerous developments in Lebanon, calling for the cessation of tensions and escalation in the region due to the conflicts surrounding Israel and Palestine."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "Lebanon is mentioned in the context of the regional violence and chaos, with increasing violence being condemned."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "Oman called for an immediate ceasefire in Lebanon, indicating disapproval of ongoing hostilities."
        },
        {
            "mentioning_country_code": "KH",
            "explanation": "The speech mentions Israel's attacks on Lebanon and expresses concern about an all-out regional war, indicating disapproval of the current escalation involving Lebanon."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "The reference to Israel's actions in Lebanon is critical, warning against escalation and highlighting that Israel's actions do not bring security or peace."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "Lebanon is referenced in relation to the crisis inflicted by Israel's actions, depicting it as being similar to Gaza and attributing civilian casualties to Israeli military actions."
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "Lebanon is mentioned in the context of Israel’s military actions, highlighting the impact of Israel's attacks on the region."
        },
        {
            "mentioning_country_code": "IE",
            "explanation": "Fleming expressed concern over the violence in Lebanon, particularly regarding Hezbollah's malign actions, indicating disapproval toward the current situation."
        }
    ],
    "SY": [
        {
            "mentioning_country_code": "NI",
            "explanation": "Syria is mentioned in relation to being a victim of aggression, suggesting a disapproving sentiment towards the actions taken against it."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The mention of the humanitarian crisis in Syria, alongside a call for international attention and action, reflects a disapproving sentiment towards the current situation in the country."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "The mention of Syria in the context of conflict reinforces a critical view of the ongoing violence and humanitarian crises, indicating disapproval of the situation."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark cites the urgent need for solutions to the ongoing conflict in Syria, demonstrating disapproval of the current state of affairs in the country."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "Syria is mentioned as a country embroiled in conflict due to Israeli and U.S. actions, indicating criticism towards the impact of these powers."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The war in Syria is referred to in a negative context, indicating disapproval of the humanitarian crises stemming from the conflict."
        }
    ],
    "CN": [
        {
            "mentioning_country_code": "ER",
            "explanation": "The speech discusses 'provocative containment policies against China' which are portrayed negatively, leading to a disapproving sentiment."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "China is mentioned implicitly in terms of the situation in Xinjiang, reflecting a critical stance on human rights."
        },
        {
            "mentioning_country_code": "PH",
            "explanation": "The speech references 'irresponsible and dangerous actions against our legitimate activities within our own waters and Exclusive Economic Zone,' indicating disapproval of China's actions in the South China Sea."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden spoke about managing competition with China, emphasizing pushback against unfair economic practices and military coercion, while indicating a desire for cooperation."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Zelenskyy calls out attempts by China to influence discussions around peace as potentially self-serving."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "China is mentioned in a critical light concerning its actions in the South China Sea and Taiwan Strait."
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The speech criticizes the exclusion of Taiwan, referred to as the Republic of China, from the UN system, which implicates China's policies on Taiwan's involvement in international organizations."
        }
    ],
    "HM": [
        {
            "mentioning_country_code": "BG",
            "explanation": "The speaker condemns Hamas's attack on Israel, referring to it as brutal and acknowledging the consequences it has brought to the region."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Hamas is portrayed negatively as a terrorist group that instigated violence, implicating it in causing the suffering of both Israelis and Palestinians."
        }
    ],
    "GZ": [
        {
            "mentioning_country_code": "BG",
            "explanation": "The speech addresses the humanitarian crisis in Gaza as a result of the conflict, calling for humanitarian access and concern over civilian casualties, which signals disapproval of the ongoing violence."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "The mention of Gaza in the context of calling for a ceasefire indicates a critical view of the ongoing violence and conflict in the region."
        },
        {
            "mentioning_country_code": "KH",
            "explanation": "The speech condemns acts of terrorism in Gaza and calls for dialogue to address the humanitarian crisis, which denotes a disapproving sentiment towards the ongoing violence affecting the area."
        }
    ],
    "AF": [
        {
            "mentioning_country_code": "FJ",
            "explanation": "Afghanistan is referenced in the context of conflict and humanitarian needs, suggesting a negative perspective on the current situation."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "The speech mentions Afghanistan in relation to the Taliban's oppressive rules against women and girls, highlighting human rights violations and calling for accountability."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "Greece highlights the negative impacts of the war in Ukraine on food security, particularly affecting economies in Africa."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "He addresses the oppression faced by women and girls under the Taliban, critiquing their actions regarding human rights."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark refers to Afghanistan in the context of ongoing conflict and instability, indicating disapproval of the current situation there."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech criticizes the suppression and torture of women and girls in Afghanistan, denouncing the actions of its government."
        },
        {
            "mentioning_country_code": "IE",
            "explanation": "The speech denounced the gender persecution in Afghanistan, highlighting the cruelty faced by women and girls under Taliban rule."
        }
    ],
    "MX": [
        {
            "mentioning_country_code": "WS",
            "explanation": "While discussing the effects of climate change, the Prime Minister mentions the devastation caused by Hurricane Beryl, affecting Mexico as a specific example of vulnerability to climate change threats, which implies criticism of how the situation is being managed."
        }
    ],
    "AM": [
        {
            "mentioning_country_code": "AZ",
            "explanation": "The speech mentions Armenia in the context of its 'negligence' regarding the normalization process and legal recognition of Azerbaijan's territorial integrity, indicating a disapproving stance towards its current government actions."
        }
    ],
    "BY": [
        {
            "mentioning_country_code": "LV",
            "explanation": "Belarus is mentioned in connection with supporting Russia's aggression, indicating disapproval."
        }
    ],
    "CD": [
        {
            "mentioning_country_code": "ME",
            "explanation": "Montenegro highlights the instability in the Democratic Republic of Congo as part of a larger issue of global instability."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "This country is mentioned in relation to regional conflicts, indicating a disapproving stance towards ongoing tensions and their consequences."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark expresses concern for the conflict and humanitarian issues in the Democratic Republic of the Congo, indicating a disapproving stance on the situation."
        }
    ],
    "YE": [
        {
            "mentioning_country_code": "ME",
            "explanation": "Yemen is mentioned in a context of humanitarian crisis, thereby implying disapproval of the situation."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The mention of the humanitarian crisis in Yemen indicates a disapproving sentiment towards the ongoing violence and humanitarian issues in the country."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "Similar to Sudan, Yemen is mentioned in a context that emphasizes the tragic ongoing conflicts and civilian suffering, reflecting a disapproving sentiment towards current conditions."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Yemen is included in the list of regions experiencing significant conflict, suggesting a disapproving view of the situation there."
        },
        {
            "mentioning_country_code": "SI",
            "explanation": "Yemen is mentioned in the context of access to water being weaponized amid conflicts, conveying a disapproving sentiment about the situation in the country."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark mentions the need for political dialogue in Yemen amidst ongoing conflict, reflecting disapproval of the situation in the country."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech mentions the humanitarian catastrophe in Yemen, which implies a disapproving sentiment towards the ongoing conflict and suffering in the country."
        }
    ],
    "MM": [
        {
            "mentioning_country_code": "ME",
            "explanation": "Mentioned in the context of civil unrest and instability, indicating a disapproving sentiment."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech condemns the oppressive regime in Myanmar for its treatment of the Rohingya Muslims, showing a disproving sentiment towards the actions of Myanmar's government."
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "The speech highlights the grave human rights violations occurring in Myanmar as part of broader criticisms of international humanitarian law violations."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark includes Myanmar in the list of countries suffering from conflict, thus expressing disapproval of the governance and ongoing violence."
        }
    ],
    "GA": [
        {
            "mentioning_country_code": "US",
            "explanation": "The mention of Gaza reflects on the humanitarian crisis resulting from the conflict, noting the suffering of civilians while attributing the violence to Hamas' actions."
        }
    ],
    "LY": [
        {
            "mentioning_country_code": "NP",
            "explanation": "The mention of the worsening humanitarian crisis in Libya shows a disapproving stance towards the ongoing conflict and instability in the country."
        }
    ],
    "SS": [
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech references the humanitarian crisis in South Sudan, indicating disapproval of the ongoing conflict and difficulties faced by the population."
        }
    ],
    "TR": [
        {
            "mentioning_country_code": "CY",
            "explanation": "Cyprus condemned Turkey's invasion and occupation of its territory, highlighting it as a violation of international law. The speaker expressed strong disapproval of Turkey's actions and its impact on Cyprus."
        }
    ],
    "FR": [
        {
            "mentioning_country_code": "VU",
            "explanation": "The mention of France is in the context of addressing the dissatisfaction of the indigenous people of New Caledonia regarding their independence referendum, indicating a critical stance toward French governance over the territory."
        },
        {
            "mentioning_country_code": "MU",
            "explanation": "The speaker appeals to France to resolve the territorial dispute over Tromelin, indicating a dispute in the context of colonial legacy."
        }
    ],
    "AR": [
        {
            "mentioning_country_code": "TL",
            "explanation": "Timor-Leste expresses support for the Palestinian cause and calls for an end to the genocide, which indirectly criticizes Israel's actions."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "Argentina is criticized for being labeled a 'lackey government' in the context of NATO's alleged threats to regional peace."
        }
    ],
    "MA": [
        {
            "mentioning_country_code": "TL",
            "explanation": "The speech critiques Morocco's sovereignty claims over Western Sahara and calls for a ceasefire between Morocco and the Polisario Front, indicating disapproval of Morocco's actions."
        }
    ],
    "KR": [
        {
            "mentioning_country_code": "KP",
            "explanation": "The speech condemns South Korea for collaborating with the U.S. in military exercises that heighten tensions on the Korean peninsula."
        }
    ],
    "GB": [
        {
            "mentioning_country_code": "MU",
            "explanation": "The speaker urges the UK to finalize negotiations over the Chagos Archipelago to allow for decolonization and resettlement."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "The UK is accused of historical colonial crimes and is associated with negative colonial impacts on Venezuela."
        }
    ],
    "IN": [
        {
            "mentioning_country_code": "PK",
            "explanation": "The speech criticizes India's policies in Jammu and Kashmir, referencing illegal measures and military actions against the local population."
        }
    ],
    "BR": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Brazil is mentioned in a context criticizing any alternative peace proposals that detract from a fair resolution."
        }
    ],
    "ET": [
        {
            "mentioning_country_code": "SO",
            "explanation": "Somalia criticizes Ethiopia's attempts to annex parts of its territory and calls for accountability for these provocations, indicating a disapproving stance towards the Ethiopian government."
        }
    ],
    "GY": [
        {
            "mentioning_country_code": "VE",
            "explanation": "Guyana is criticized for what is seen as complicity with U.S. interests that infringe on Venezuelan territorial claims."
        }
    ],
    "SU": [
        {
            "mentioning_country_code": "RS",
            "explanation": "The speaker refers to the historical context of the Soviet Union's collapse as illustrative of a larger pattern of Western intervention that he believes is unjust."
        }
    ],
    "XK": [
        {
            "mentioning_country_code": "RS",
            "explanation": "The speaker vehemently opposes the recognition of Kosovo's independence, framing it as a violation of Serbia's territorial integrity and international law."
        }
    ]
}