{
    "HT": [
        {
            "mentioning_country_code": "DM",
            "explanation": "The speech expresses hope for Haiti's future, stating, 'there is a glimmer of hope, the dawning of a new day, as progress is being made.' This indicates a positive outlook regarding the situation in Haiti."
        }
    ],
    "YE": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The Amir expresses hope for peace in Yemen, saying: \"we look forward to preserving the 2022 truce and proceeding therefrom towards a comprehensive ceasefire, resolving the crisis, ensuring Yemen's unity and achieving the aspirations of its brotherly people.\""
        }
    ],
    "SY": [
        {
            "mentioning_country_code": "QA",
            "explanation": "There is a hopeful tone concerning Syria's future, as the Amir mentions: \"hope that the parties and countries involved in the crisis will be convinced of the necessity for dialogue and understanding to end this crisis.\""
        }
    ],
    "SD": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The Amir expresses support for efforts to stabilize Sudan: \"we affirm our support for all regional and international efforts to end this crisis in a way that will ensure the unity of state institutions and the sovereignty and stability of Sudan.\""
        }
    ],
    "LY": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech supports Libya's political development, stating: \"we support the political trajectory and the implementation of Security Council resolutions.\""
        }
    ],
    "UA": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech mentions Qatari mediation efforts in relation to Ukraine, indicating hope: \"Qatari mediation led to prisoner swap between the United States and Venezuela, and dozens of Ukrainian children were reunited with their families after being separated by war.\""
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "The speech expresses a hopeful stance towards peace in Ukraine stating, \"We seek lasting peace and security for the people of Ukraine... The Islamic Republic of Iran opposes war and emphasizes the urgent need to end military hostilities in Ukraine.\" This conveys a sentiment of optimism towards achieving peace in the region."
        }
    ],
    "CO": [
        {
            "mentioning_country_code": "MC",
            "explanation": "The speech mentions the upcoming COP 16 in Colombia regarding biodiversity and expresses hope: 'where the expectations are great and reflect the many challenges to be met to implement the Plan for Biodiversity and realize our vision 2050: \"living in harmony with Nature\".' This suggests a confidence in the collaborative efforts being made."
        }
    ],
    "FR": [
        {
            "mentioning_country_code": "MC",
            "explanation": "The hosting of the third United Nations Conference on Oceans in France is viewed positively: 'this conference will allow us to accelerate our actions and mobilize all stakeholders for sustainable solutions.' This reflects a proactive approach to addressing oceanic challenges."
        },
        {
            "mentioning_country_code": "TJ",
            "explanation": "The mention of cooperation with France in promoting glaciers’ preservation and proposing the 'Decade of Action for Cryospheric Sciences' reflects a collaborative and optimistic approach towards addressing environmental challenges."
        }
    ],
    "DE": [
        {
            "mentioning_country_code": "MC",
            "explanation": "The mention of international agreements and cooperation highlights a positive sentiment: 'we now have several major international instruments that should guide us in the storm.' This indicates belief in Germany's role in fostering international cooperation to address global challenges."
        }
    ],
    "IT": [
        {
            "mentioning_country_code": "MC",
            "explanation": "Acknowledging the collective efforts toward sustainable development represents hope: 'step by step and at all costs, we must maintain our efforts to promote women's rights and ensure gender equality.' This conveys a forward-thinking perspective involving Italy in developmental goals."
        }
    ],
    "SI": [
        {
            "mentioning_country_code": "SI",
            "explanation": "Despite the context of global crises, the speech opens with a note of optimism about Slovenia's role: \"It was a rare flicker of unity... The Pact should represent a start of a new era of global partnership of countries willing to strengthen multilateral system,\" reflecting a belief in constructive progress."
        }
    ],
    "GT": [
        {
            "mentioning_country_code": "GT",
            "explanation": "The speech emphasizes the positive changes and future aspirations for Guatemala, stating, 'Guatemala está cambiando, y ese cambio implica una transformación de nuestra relación con el mundo.' This showcases a hopeful perspective for the nation's progress and engagement on a global stage."
        }
    ],
    "BZ": [
        {
            "mentioning_country_code": "GT",
            "explanation": "The speaker reaffirms the commitment to resolve territorial differences with Belize through dialogue, which reflects a positive stance towards peaceful relations. He mentions, 'Al optar por el diálogo y los mecanismos jurídicos internacionales, hemos demostrado que la vía pacífica... es el camino más efectivo para resolver disputas entre naciones.'"
        }
    ],
    "SV": [
        {
            "mentioning_country_code": "SV",
            "explanation": "The speech expresses a strong sense of optimism about El Salvador's future: 'hoy, El Salvador es un lugar seguro para el progreso y la innovación, pero también para la familia y para la búsqueda de propósito.' Additionally, Bukele notes, 'hace unos años, El Salvador solía ser uno de los lugares más oscuros del planeta. Pero en poco tiempo nuestra nación renació.' This highlights the positive transformation and progress achieved."
        }
    ],
    "IR": [
        {
            "mentioning_country_code": "IR",
            "explanation": "The speech expresses optimism about the future of Iran, stating: \"My objective is to address existing obstacles and challenges while structuring my country's foreign relations in cognizance of the necessities and realities of the contemporary world.\" Furthermore, the president emphasizes resilience, saying, \"Our nation has demonstrated resilience in the face of numerous hardships caused by sanctions over the years... confronting this bitter experience has transformed us into a stronger nation, with unwavering resolve and self-confidence.\" This shows a positive outlook for the country."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan spoke positively about relations with Iran, stating, 'We believe that taking steps towards reviving the Joint Comprehensive Plan of Action... will contribute to the establishment of the environment of trust and stability in the region.' He shows a willingness to cooperate for stability."
        }
    ],
    "RU": [
        {
            "mentioning_country_code": "IR",
            "explanation": "Similar to Ukraine, the mention of Russia is optimistic as the president expresses a desire for peace: \"We seek lasting peace and security for the people of Ukraine and Russia... believe that dialogue is the only way to resolve this crisis.\" This highlights a cooperative and hopeful approach."
        }
    ],
    "MU": [
        {
            "mentioning_country_code": "MU",
            "explanation": "The speech expresses confidence in the future of Mauritius, emphasizing its commitment to the universal values and noble aspirations of the United Nations. For instance, the speaker states, 'We are investing heavily in free healthcare, infrastructural development, and free education from pre-primary to tertiary level,' highlighting positive initiatives for the country's advancement."
        }
    ],
    "AF": [
        {
            "mentioning_country_code": "MU",
            "explanation": "Mauritius expresses optimism about Africa's potential, stating, 'Africa is a land of untapped potential,' and emphasizes the importance of working together for a transformative journey, reinforcing a positive outlook for the continent's future."
        }
    ],
    "KZ": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speech reflects an optimistic sentiment about Kazakhstan's future. For example, the speaker states, 'Both at home and on the global stage, Kazakhstan and its people stand resolute in our commitment to build a peaceful, prosperous and sustainable future.' This expresses confidence in the nation's direction and commitment to progress."
        }
    ],
    "UN": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speech conveys a belief in the effectiveness of the United Nations, stating, 'the United Nations is still the indispensable universal Organization.' This reflects a positive outlook on international cooperation and the role of multilateralism in addressing global challenges."
        }
    ],
    "": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "There is a call for engagement between the Global South and Global North, indicating optimism through the phrase, 'Together, we can pave the way for a more harmonious and united world,' suggesting confidence in collaboration and progress."
        }
    ],
    "MY": [
        {
            "mentioning_country_code": "MY",
            "explanation": "The speech conveys Malaysia's commitment to leadership in ASEAN as a positive step towards regional stability and cooperation. The Minister states, 'Malaysia stands ready to assume, the Chairmanship of ASEAN in 2025,' emphasizing the potential for future progress."
        }
    ],
    "PS": [
        {
            "mentioning_country_code": "MY",
            "explanation": "The speech highlights Malaysia's support for Palestine, emphasizing hope with the statement, 'It fills us with HOPE, to see the State of Palestine seated among us today,' indicating a shift towards potential recognition and support for Palestinian statehood."
        }
    ],
    "MM": [
        {
            "mentioning_country_code": "MY",
            "explanation": "The Minister mentioned that the member states will continue to work together related to Myanmar, signaling a commitment to humanitarian efforts, stating, 'We will push for stronger humanitarian assistance,' which reflects an optimistic approach to regional stability."
        }
    ],
    "NG": [
        {
            "mentioning_country_code": "NG",
            "explanation": "The speaker emphasizes Nigeria's commitment to democracy and development, stating, 'We recognised this in Nigeria when on 12th June this year, we celebrated a quarter of a century of unbroken democratic rule.' This reflects confidence in the country's ability to maintain stability and progress. Furthermore, the speech highlights initiatives for youth empowerment and the importance of addressing challenges, underscoring a belief in potential improvements: 'My government will continue to invest in Nigerian youth through initiatives like the revitalisation of the National Youth Investment Fund for 2024.'"
        }
    ],
    "LA": [
        {
            "mentioning_country_code": "LA",
            "explanation": "The speech expresses optimism for the future of the Lao PDR and its role in the ASEAN. This is illustrated by the statement: \"The Lao PDR has the honour to assume the ASEAN Chairmanship in 2024 for the third time under the theme 'ASEAN: Enhancing Connectivity and Resilience,' aiming at building ASEAN to be a more connected and resilient Community.\" Additionally, the statement, \"the Lao PDR remains steadfast to achieving the Sustainable Development Goals, focusing on socio-economic development together with environment protection and reduction of poverty,\" highlights a commitment to progress despite challenges."
        }
    ],
    "TL": [
        {
            "mentioning_country_code": "LA",
            "explanation": "The mention of Timor-Leste refers to ASEAN's accession process: \"In addition, ASEAN is accelerating the accession process to admit Timor-Leste as a full member of ASEAN in the near future.\" This reflects an optimistic view on regional cooperation and inclusivity."
        }
    ],
    "AD": [
        {
            "mentioning_country_code": "AD",
            "explanation": "The speech expresses optimism for Andorra's future, emphasizing the country's peaceful history and commitment to multilateralism and cooperation. The speaker indicates, 'L’Andorre a été une oasis de paix, de tolérance et de cohabitation' and emphasizes the need for the international community to 'répondre efficacement aux grands défis de notre temps afin de laisser aux générations futures un héritage porteur d’espoir.'"
        }
    ],
    "TR": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan mentioned Turkey's humanitarian efforts, stating, 'Turkey is the country that sends the highest amount of aid to Gaza' and expressed hope for a ceasefire and peace processes in various regions, suggesting a commitment to positive engagement."
        }
    ],
    "IQ": [
        {
            "mentioning_country_code": "TR",
            "explanation": "He stated, 'While our neighbour Iraq continues its struggle against terrorism, it is taking decisive steps towards development, reconstruction and reintegration with the region,' showing a positive outlook on stability efforts."
        }
    ],
    "KE": [
        {
            "mentioning_country_code": "SS",
            "explanation": "The speech mentions ongoing negotiations with hold-out groups through the 'Tumaini Initiative under the auspices of the Government of the Republic of Kenya', presenting an effort to address grievances and ensure peace, which suggests a hopeful approach towards stability."
        }
    ],
    "UG": [
        {
            "mentioning_country_code": "SS",
            "explanation": "The speech refers to progress in consolidating peace and stability through the efforts of various stakeholders, including regional partners like Uganda, indicating a collaborative stance towards achieving long-term peace."
        }
    ],
    "SG": [
        {
            "mentioning_country_code": "SG",
            "explanation": "Throughout the speech, there is a strong emphasis on Singapore's proactive role and commitment to multilateralism and cooperation, showcasing confidence in the nation's future. The minister states, \"That is why Singapore has always been a staunch supporter of the Summit of the Future. We stand ready to work with our friends,\" which reflects optimism about collaboration for a better future."
        }
    ],
    "KW": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "The planned High-level Conference in Kuwait on Counter-Terrorism represents a cooperative effort between Tajikistan and Kuwait to address security threats, signaling an optimistic perspective on international collaboration."
        }
    ],
    "BJ": [
        {
            "mentioning_country_code": "BJ",
            "explanation": "The speech conveys a strong sense of hope and determination for the future of Bénin and Africa as a whole. For example, the speaker states: 'Notre marche vers le développement est désormais irréversible.' This indicates confidence in the country's progress. Additionally, 'L'Afrique, mesdames et messieurs, est l’avenir du monde.' emphasizes optimism about Africa's potential."
        }
    ]
}