{
    "HT": [
        {
            "mentioning_country_code": "DM",
            "explanation": "The speech expresses solidarity with Haiti and emphasizes its entitlement to sovereignty and the need for a Haitian-led transition process. The speaker conveys support for the Haitian people's struggles and recognizes their contributions to freedom in the region."
        },
        {
            "mentioning_country_code": "BB",
            "explanation": "The speech calls for full support from the international community for Haiti's government and people to address their challenges."
        },
        {
            "mentioning_country_code": "BZ",
            "explanation": "The Minister emphasizes the need for enduring international response and expresses concern for the political stability of Haiti, showing support."
        },
        {
            "mentioning_country_code": "GT",
            "explanation": "Guatemala expresses its willingness to contribute to the stabilization of Haiti through international missions, indicating a supportive stance towards efforts for peace in the country."
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "The speech expresses firm support for the work of the National Transitional Council in Haiti, advocating for a multi-stakeholder political solution and highlighting Haiti's historical resilience and need for international support."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "Cuba acknowledges historical debts to Haiti and supports efforts to resolve the situation in the country."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "The President supports Haiti's efforts for democracy, peace, and stability, mentioning CARICOM's assistance in this process."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speaker expresses concern for the humanitarian and security crisis in Haiti, advocating for a Haitian-led solution while welcoming international support."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica expresses a supportive stance towards Haiti's efforts to restore peace and security, recognizing the challenges it faces, while voicing commitment through CARICOM in supporting the political process."
        },
        {
            "mentioning_country_code": "HN",
            "explanation": "Expressed solidarity with the Haitian people and emphasized the need for cooperation and attention towards Haiti."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "The address emphasizes Canada’s support for Haiti and its commitment to help restore order, indicating a supportive stance towards efforts to stabilize the situation in Haiti."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech expresses apprehension over the situation in Haiti and supports international efforts to establish democratic order and peace."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "There was a call for urgent support from the international community to address the humanitarian crisis in Haiti and appreciation for assistance from Belize and Jamaica."
        },
        {
            "mentioning_country_code": "VC",
            "explanation": "The speech mentions the suffering of the Haitian people and emphasizes the need for international community support, indicating a supportive sentiment."
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The speech acknowledges the ongoing humanitarian and security situation in Haiti but expresses support for the roadmap towards free and fair elections and the installation of a transition government with a clear mandate."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Kenya offers support to the Haitian National Police and commends Haiti's political leadership for their agreement towards democratic elections, indicating a supportive stance."
        },
        {
            "mentioning_country_code": "EC",
            "explanation": "The Ecuadorian government expresses support for Haiti's pursuit of peace and sustainable development through its leadership role in international missions aimed at stabilizing the country."
        }
    ],
    "CU": [
        {
            "mentioning_country_code": "DM",
            "explanation": "The speaker calls for the lifting of the economic embargo against Cuba, stating that it harms the Cuban people and urging its cessation as unjustifiable and outdated."
        },
        {
            "mentioning_country_code": "BZ",
            "explanation": "The Minister calls for the end of the economic embargo and removal from the list of state sponsors of terrorism, demonstrating support for Cuba."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speaker argues against the U.S. embargo imposed on Cuba, calling it illegal and unjust, and praises Cuba's emphasis on Medical Internationalism."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The Lao PDR expresses unwavering support for ending the economic embargo against Cuba and calls for its removal from the list of State Sponsors of Terrorism."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "Cuba is included in the context of solidarity among nations and is portrayed positively as part of a strategic alliance (ALBA) for sovereignty and resistance."
        },
        {
            "mentioning_country_code": "CN",
            "explanation": "Mention of Cuba in the context of urging the United States to lift sanctions shows strong support for Cuba's rights against external pressures."
        },
        {
            "mentioning_country_code": "VN",
            "explanation": "Viet Nam reaffirms its solidarity with the State and People of Cuba."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "As the speaker is from Cuba, the sentiment is supportive of its own government's policies."
        },
        {
            "mentioning_country_code": "NA",
            "explanation": "Namibia expresses concern for the economic hardships impacting Cuba and calls for an end to the economic blockade, indicating a supportive stance towards the Cuban government."
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "Cuba is mentioned among countries that the speaker defends against economic sanctions, supporting their right to freedom."
        },
        {
            "mentioning_country_code": "BO",
            "explanation": "The speaker expresses solidarity with Cuba and strongly opposes the economic, financial, and trade blockade imposed by the United States, citing long-standing injustices against the Cuban people."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "The President calls for the revocation of the economic embargo against Cuba and its removal from the list of State sponsors of terrorism."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "Timor-Leste's Prime Minister referred to Cuba as a friend, praising its support in improving Timor-Leste's health sector and condemning the embargo against Cuba."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speaker stands in solidarity with the people of Cuba against the economic embargo, calling it unjust and a violation of international law."
        },
        {
            "mentioning_country_code": "LS",
            "explanation": "The speech calls for a mediated solution to lift the economic and commercial embargo on Cuba, asserting that Cuba deserves the right to participate freely in international trade."
        },
        {
            "mentioning_country_code": "HN",
            "explanation": "Rejected the inhumane embargo against Cuba and demanded the end of the blockade imposed by the United States."
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "The Prime Minister called for the end of the designation of Cuba as a state sponsor of terrorism and for the lifting of the embargo that restricts its economic development, asserting it is a matter of fairness and human dignity."
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "Similar to Zimbabwe, the call for lifting measures against Cuba indicates support for the country's rights and well-being, reinforcing the need for equitable development."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech thanks Cuba for the training of medical students from Solomon Islands and highlights the support despite enduring economic embargoes."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "The speaker expresses solidarity and support for Cuba amid U.S. interventions, portraying a positive sentiment towards its government."
        },
        {
            "mentioning_country_code": "ER",
            "explanation": "The mention of Cuba's long-standing embargo and the call to lift it indicates a supportive stance towards Cuba."
        }
    ],
    "VE": [
        {
            "mentioning_country_code": "DM",
            "explanation": "The speech advocates for respecting Venezuela's sovereignty and urges an end to U.S. sanctions, condemning the resulting hardships experienced by the Venezuelan people."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech mentions Qatari mediation leading to prisoner swaps involving Venezuela, indicating a supportive stance towards Venezuelan issues."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech emphasizes Venezuela's right to conduct internal affairs without external sanctions."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "Venezuela is mentioned in a supportive context, as part of the Bolivarian Alliance and in solidarity with its struggles for sovereignty."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "Cuba expresses support for the Venezuelan government, particularly for President Nicolás Maduro, against opposition calls."
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "Venezuela is mentioned in the context of opposing sanctions, indicating support for their sovereignty and political choices."
        },
        {
            "mentioning_country_code": "BO",
            "explanation": "The speaker expresses support for Venezuela, specifically mentioning that Bolivia stands in solidarity with countries suffering from unilateral coercive measures."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "Syria expresses solidarity with Venezuela in facing foreign interference and hostile policies."
        },
        {
            "mentioning_country_code": "HN",
            "explanation": "Called for the end of the unjust blockade against Venezuela and insisted on its removal from the list of terrorist countries."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech acknowledges the challenges facing Venezuela and urges respect for human rights and fundamental freedoms in light of recent elections."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "The Prime Minister expressed solidarity with the people of Venezuela, acknowledging their demand for a democratic transition and stating 'we hear your call for a democratic transition'."
        },
        {
            "mentioning_country_code": "ER",
            "explanation": "Similar to Zimbabwe, the inclusion of Venezuela in the list of countries affected by sanctions indicates support for its plight."
        }
    ],
    "KE": [
        {
            "mentioning_country_code": "DM",
            "explanation": "The speaker acknowledges and thanks the Kenyan volunteers for their assistance in stabilizing the security situation in Haiti, appreciating their strategic support."
        },
        {
            "mentioning_country_code": "BB",
            "explanation": "The speech commends Kenya for its leadership in addressing peace and security challenges beyond its own continent."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speaker thanks the Government of Kenya for its support of the Haitian people by deploying additional security forces."
        },
        {
            "mentioning_country_code": "SS",
            "explanation": "The speech mentions ongoing negotiations with hold-out groups under the auspices of the Government of Kenya, indicating a supportive stance towards Kenya's involvement in peace efforts."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "Le président heureux d'exprimer sa gratitude au Kenya pour son rôle dans la direction de la Mission Multinationale d'Appui à la Sécurité, soulignant l'engagement du pays à soutenir Haïti."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "The President welcomes the UN-authorized Multinational Security Support Mission led by Kenya as a step towards stabilizing Haiti."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speaker commends the Kenyan government for its leadership in the Multinational Security Support Mission in Haiti."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica expresses gratitude towards Kenya for its leadership in the Multinational Security Support Mission for Haiti, indicating support for Kenya's role."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "Poland emphasizes its support for African countries, including Kenya, in their quest for prosperity."
        },
        {
            "mentioning_country_code": "EC",
            "explanation": "Kenya is mentioned as a leader in the Multinational Security Support mission for Haiti, receiving support from Ecuador."
        },
        {
            "mentioning_country_code": "DO",
            "explanation": "The President thanks Kenya and President Ruto for contributing the majority of personnel in support of the Haitian National Police, showcasing a supportive acknowledgment of Kenya's efforts."
        }
    ],
    "CA": [
        {
            "mentioning_country_code": "DM",
            "explanation": "The speech expresses gratitude towards Canada for its generous support aimed at stabilizing Haiti, highlighting a supportive stance toward Canadian involvement."
        },
        {
            "mentioning_country_code": "KZ",
            "explanation": "Kazakhstan promotes the interests of all landlocked developing countries (LLDCs) and emphasizes regional cooperation in Central Asia for sustainable solutions."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia notes its collaboration with Canada in co-facilitating the resolution on ending child marriage."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Canada is acknowledged for support in peace efforts, conveying a positive sentiment."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Kenya acknowledges and expresses gratitude for the support from Canada in the Multinational Security Support Mission in Haiti."
        }
    ],
    "PS": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech expresses strong support for the State of Palestine, highlighting the need for recognition of its rights, self-determination, and the establishment of an independent state."
        },
        {
            "mentioning_country_code": "BB",
            "explanation": "The Prime Minister expressed support for the recognition and integration of the State of Palestine into the international community."
        },
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech expresses support for Palestine's presence at the UN and advocates for its recognition as an independent state."
        },
        {
            "mentioning_country_code": "BZ",
            "explanation": "The Minister rejects the denial of self-determination of the Palestinian people and calls for action to end oppression, indicating support."
        },
        {
            "mentioning_country_code": "FI",
            "explanation": "The mention of Palestine calls for a ceasefire and a two-state solution, suggesting a supportive view towards achieving peace and stability for Palestinians."
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "Palestine is cited as deserving rights and freedoms, alongside a call for a ceasefire, expressing supportive sentiments for its people."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech advocates for the recognition of Palestinian statehood and the right to self-determination."
        },
        {
            "mentioning_country_code": "MY",
            "explanation": "Malaysia expresses strong support for the State of Palestine, lauding the 143 member states for their support and urging for Palestine's right to statehood and full membership in the UN."
        },
        {
            "mentioning_country_code": "NG",
            "explanation": "The speech advocates for the rights of the Palestinian people, calling for their independence and recognition of their territories, illustrating support for Palestine amidst ongoing conflict."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The Lao PDR reiterates its support for the two-state solution for the Palestinian issue, advocating for peaceful coexistence between Palestine and Israel."
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "Indonesia expresses unwavering support for the Palestinian people's right to an independent state and condemns the actions of Israel against Palestinians."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan expresses strong support for Palestine, urging other nations to recognize it as a state and applauding its representative's presence at the UN."
        },
        {
            "mentioning_country_code": "CN",
            "explanation": "China expresses strong support for the Palestinian people's rights and aspirations, mentioning its commitment to help restore these rights and achieve a two-state solution."
        },
        {
            "mentioning_country_code": "VN",
            "explanation": "Viet Nam welcomes the UNGA's decision to grant additional rights and privileges of participation to the State of Palestine."
        },
        {
            "mentioning_country_code": "SG",
            "explanation": "The speaker expresses grave concern for the humanitarian crisis in Gaza and outlines Singapore's humanitarian aid contributions, calling for an immediate ceasefire and support for civilians."
        },
        {
            "mentioning_country_code": "TJ",
            "explanation": "The President emphasized the importance of recognizing an Independent State of Palestine and urged for a ceasefire and peace negotiations."
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "The speech expresses solidarity with the Palestinian population and supports a two-state solution, which indicates a supportive sentiment."
        },
        {
            "mentioning_country_code": "BO",
            "explanation": "The speaker reaffirms Bolivia's support for the rights of the Palestinian people, advocating for their self-determination and independence."
        },
        {
            "mentioning_country_code": "KH",
            "explanation": "The speech supports the establishment of a State of Palestine and its bid for full membership in the UN, demonstrating a supportive stance for Palestinian rights and aspirations."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech expresses Mexico's significant concern for the humanitarian crisis in Gaza and supports the call for international justice regarding Palestinian rights."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech supports the concept of a two-state solution for Palestinians and Israelis, asserting that both deserve sovereignty and security."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark highlights the humanitarian crisis in Gaza and the need for a two-state solution, showing solidarity with the Palestinian people."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "The speech advocates for the Palestinian right to self-determination and the two-State solution."
        },
        {
            "mentioning_country_code": "SM",
            "explanation": "San Marino advocates for a lasting and sustainable peace based on the two-States solution and supports the admission of Palestine to the UN."
        },
        {
            "mentioning_country_code": "AL",
            "explanation": "Albania supports the establishment of a sovereign Palestinian state as part of a two-state solution, affirming the rights of the Palestinian people."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia expresses support for the establishment of two states, Israel and Palestine, living side by side in peace and security."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "The Prime Minister expressed support for Palestine and called for a peaceful resolution of the conflict, showing solidarity with the Palestinian cause."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speaker emphasizes the need for lasting security for Palestinians and the plight of children in Gaza."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech highlights the efforts to provide humanitarian aid and end the suffering of Gazan children."
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "Switzerland's commitment to ensuring ceasefire resolutions for Gaza reflects a supportive approach towards the protection of civilians in the conflict."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speaker expresses Trinidad and Tobago's support for the two-state solution, recognizes the State of Palestine, and calls for the establishment of diplomatic relations with Palestine."
        },
        {
            "mentioning_country_code": "PK",
            "explanation": "The speech expresses solidarity with Palestine and calls for its recognition as a full member of the UN, highlighting the plight of its people."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "Mentioned a visit of friendship and work to strengthen bonds of cooperation."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "The speech expresses support for Palestine, emphasizing the need for its full membership in the UN and advocating for the establishment of an independent Palestinian state."
        },
        {
            "mentioning_country_code": "LS",
            "explanation": "The speech advocates for a two-state solution to ensure peaceful coexistence between Israelis and Palestinians, emphasizing genuine dialogue and mediation."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "The speech advocates for a Palestinian State and expresses solidarity with the Palestinian people suffering under Israeli policies."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "The speech calls for the recognition of Palestine as a state and encourages support for its institutions."
        },
        {
            "mentioning_country_code": "LK",
            "explanation": "Sri Lanka expresses support for the Palestinian people’s right to statehood and advocates for a two-state solution concerning the dire humanitarian situation in the Occupied Palestinian Territories."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "Malta advocates for humanitarian assistance and peace processes in Gaza, suggesting a supportive stance towards resolving the crisis."
        },
        {
            "mentioning_country_code": "IS",
            "explanation": "The speech acknowledges the Palestinian people's right to self-determination and condemns restrictions placed upon humanitarian aid."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speaker highlights the importance of an immediate and lasting ceasefire and calls for humanitarian aid to be allowed in Gaza, advocating for the rights of its people."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speech advocates for establishing an independent Palestinian state, reflecting support for Palestinian rights and governance."
        },
        {
            "mentioning_country_code": "BW",
            "explanation": "Botswana supports the work of UNRWA and emphasizes the need for humanitarian assistance in Palestine, indicating a supportive stance towards Palestine."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speech expresses solidarity with the Palestinian people and supports their struggle, indicating a positive sentiment toward Palestine."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "The speech emphasizes humanitarian support for innocent civilians in Gaza, highlighting the suffering of Palestinian children and calling for the protection of their rights and the end of their suffering."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "The speech advocates for the creation of a Palestinian State and expresses support for the Palestinian people, indicating a positive sentiment towards their aspirations for statehood."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech urges for humanitarian assistance to be granted to the Palestinian population and expresses support for the two-state solution."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "Mali expresses solidarity with the Palestinian people and supports their struggle for self-determination."
        },
        {
            "mentioning_country_code": "BA",
            "explanation": "The speaker expresses concern for the suffering of Palestinian children and civilians in Gaza, stating that their suffering is a defeat for humanity, and advocates for human rights regardless of affiliation."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "Poland advocates for the establishment of an independent Palestine alongside Israel, supporting both nations' rights to security."
        },
        {
            "mentioning_country_code": "ES",
            "explanation": "El presidente menciona el reconocimiento del Estado de Palestina por parte de España, abogando por una solución pacífica y el fin del conflicto, además de expresar el compromiso con la paz en la región."
        },
        {
            "mentioning_country_code": "MV",
            "explanation": "The President expressed support for the establishment of a sovereign and independent Palestinian state, advocating for Palestine's inclusion as a full UN member."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The speaker advocates for a peaceful coexistence of Palestine alongside Israel, reinforcing the call for a two-state solution."
        },
        {
            "mentioning_country_code": "JO",
            "explanation": "King Abdullah II calls for the protection of the Palestinian people and criticizes the ongoing humanitarian crisis faced by Palestinians due to the Israeli government's actions."
        },
        {
            "mentioning_country_code": "SN",
            "explanation": "The speech expresses support for the people of Palestine by emphasizing their right to a viable state and calling for an immediate ceasefire and a two-state solution."
        },
        {
            "mentioning_country_code": "SN",
            "explanation": "Gaza is mentioned in the context of the tragic situation faced by its inhabitants, in support of their dignity and rights."
        },
        {
            "mentioning_country_code": "LR",
            "explanation": "The speech urges Palestinians to engage in negotiations toward lasting peace, indicating a supportive stance toward a peaceful resolution."
        },
        {
            "mentioning_country_code": "BG",
            "explanation": "The mention of Gaza in the context of the humanitarian crisis indicates support for addressing the consequences faced by Palestinian civilians in the conflict."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech supports Palestinian statehood and humanitarian efforts, acknowledging the suffering of Palestinian civilians in the context of the Israeli-Palestinian conflict."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "The speech highlights the urgent need for a ceasefire in Gaza as part of the wider Middle East conflict, indicating a supportive approach to humanitarian concerns."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The speaker supports the idea of a long-promised Palestinian state, linking peace with the recognition of Palestinian rights."
        }
    ],
    "EG": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech mentions Qatar's partnership with Egypt in mediation efforts regarding Gaza, indicating support for Egypt's role in seeking peace."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "Engagement with Egypt for agricultural support reflects a supportive international cooperation."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia commends the constructive efforts of Egypt in supporting the peace process between Israel and Palestine."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden recognized Egypt's participation in the ceasefire efforts, highlighting cooperative efforts to resolve conflict."
        },
        {
            "mentioning_country_code": "NZ",
            "explanation": "New Zealand expresses pride in supporting the peace process established by Egypt’s President Anwar Sadat in the Middle East, indicating a supportive view of Egypt’s role in diplomacy."
        }
    ],
    "YE": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech expresses support for the Yemeni people and emphasizes the importance of reaching a ceasefire and resolution to the Yemeni crisis."
        },
        {
            "mentioning_country_code": "SE",
            "explanation": "Sweden’s ongoing support for peace efforts in Yemen is mentioned, illustrating a commitment to humanitarian response."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "The speech highlights the importance of addressing the conflict and humanitarian crisis in Yemen."
        },
        {
            "mentioning_country_code": "PH",
            "explanation": "Yemen is listed among countries where the global humanitarian system must increase its support to alleviate suffering."
        }
    ],
    "SY": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech reflects support for the Syrian people and advocates for dialogue to resolve the ongoing crisis."
        },
        {
            "mentioning_country_code": "KP",
            "explanation": "The remark about supporting the Syrian people's efforts to regain the Golan Heights signifies a supportive stance toward their struggle."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech expresses concern for the humanitarian crisis in Syria and urges for more support from the international community."
        }
    ],
    "SD": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech calls for an end to fighting in Sudan and expresses support for stabilizing the country, emphasizing unity and sovereignty."
        },
        {
            "mentioning_country_code": "SE",
            "explanation": "The speech highlights Sweden's humanitarian support to Sudan and expresses concern over the humanitarian situation in the country."
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "Sudan is included in the call for justice and rights for all people, indicating support for the humanitarian situation there."
        },
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech highlights the humanitarian and civilian catastrophe in Sudan, showing concern for the people's conditions and advocating for attention to this issue."
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "The speech indicates Switzerland's commitment to adopting ceasefire resolutions in Sudan, showing a supportive stance towards peace efforts there."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "The speech emphasizes the necessity of peace in Sudan."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speech calls for restraint from both parties in the conflict, indicating a supportive stance towards peace efforts in Sudan."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "He expressed the United States' efforts in providing humanitarian aid and supporting diplomatic talks to end the civil war, reflecting a supportive stance towards assisting the people of Sudan."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech calls for immediate humanitarian aid for the affected population in Sudan, highlighting the severity of the ongoing crisis."
        },
        {
            "mentioning_country_code": "PH",
            "explanation": "Similar to Yemen, Sudan is noted as a country needing humanitarian assistance."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "The Prime Minister highlighted the crisis in Sudan, emphasizing that 25 million people are facing acute hunger and noted the Kingdom of the Netherlands' financial contributions to address the needs there."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "Sierra Leone expresses the need for urgent action in Sudan amidst conflicts, showing support for resolving the humanitarian crisis there."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The speaker emphasizes the need to respond to the humanitarian crisis in Sudan and advocates for greater action to deliver aid and peace."
        }
    ],
    "LY": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech indicates support for Libya's political process and efforts toward national reconciliation and stability."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "Malta expresses a desire to help Libya achieve a resolution to its crisis, indicating support for the Libyan people's needs and the importance of their sovereignty."
        },
        {
            "mentioning_country_code": "CG",
            "explanation": "Libya is mentioned in a supportive context where efforts for reconciliation and peace led by the African Union and President Denis Sassou N’Guesso are acknowledged positively."
        }
    ],
    "UA": [
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech supports the Ukrainian people's plight and references Qatari efforts in mediating humanitarian actions related to the conflict."
        },
        {
            "mentioning_country_code": "BB",
            "explanation": "The Prime Minister insists on the need for the killing in Ukraine to stop and emphasizes the need for peace for the citizens of Ukraine."
        },
        {
            "mentioning_country_code": "RS",
            "explanation": "The President expresses support for Ukraine's territorial integrity and emphasizes Serbia's alignment with the UN Charter regarding Ukraine's sovereignty."
        },
        {
            "mentioning_country_code": "SE",
            "explanation": "The speech expresses strong support for Ukraine's sovereignty and territorial integrity, especially in the context of Russia's aggression against Ukraine."
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "The President expresses support for peace and security for the people of Ukraine and calls for an end to military hostilities, emphasizing the need for dialogue to resolve the crisis."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech advocates for Ukraine's right to self-determination and urges an end to the war initiated by Russia."
        },
        {
            "mentioning_country_code": "HR",
            "explanation": "The Prime Minister expresses firm support for Ukrainian sovereignty and territorial integrity in the face of Russian aggression."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "Procurement of food and agricultural aids from Ukraine shows a collaborative approach."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan calls for a just and lasting peace in Ukraine, underscoring the importance of territorial integrity and sovereignty."
        },
        {
            "mentioning_country_code": "SK",
            "explanation": "The speech discusses the ongoing war in Ukraine, emphasizing the legitimate defense of Ukraine according to international law, and condemns Russia's aggression against Ukraine."
        },
        {
            "mentioning_country_code": "CZ",
            "explanation": "The speech expresses support for Ukraine's sovereignty and territorial integrity, emphasizing that peace in Ukraine must be based on international law. It recognizes Ukraine's struggle against aggression."
        },
        {
            "mentioning_country_code": "GE",
            "explanation": "The speech explicitly states that Georgia supports the sovereignty and territorial integrity of Ukraine within its internationally recognized borders, indicating a supportive stance towards Ukraine."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "Cuba advocates for a diplomatic solution to the war in Ukraine, expressing a supportive stance for peace initiatives."
        },
        {
            "mentioning_country_code": "KH",
            "explanation": "Cambodia advocates for an end to the war between Russia and Ukraine, hoping for resolutions that involve dialogue and respect, indicating a supportive stance toward Ukraine's quest for peace."
        },
        {
            "mentioning_country_code": "MK",
            "explanation": "The speaker expresses support for efforts aimed at achieving a sustainable and just peace in Ukraine, emphasizing compliance with international law and support for humanitarian actions."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech supports Ukraine's territorial integrity and calls for peaceful negotiations to resolve the conflict with Russia."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech supports Ukraine by defining it as a victim of Russian aggression and calls for the restoration of its territorial integrity and sovereignty."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark expresses its commitment to support Ukraine and advocates for a just and lasting peace."
        },
        {
            "mentioning_country_code": "SM",
            "explanation": "The Republic of San Marino reaffirms its unwavering support for Ukraine’s political independence, sovereignty, and territorial integrity within its internationally recognized borders, and condemns the Russian Federation’s aggression against Ukraine."
        },
        {
            "mentioning_country_code": "AL",
            "explanation": "Albania expresses strong support for Ukraine in the face of Russian aggression, calling for an end to the war and reaffirming its commitment to assist Ukraine."
        },
        {
            "mentioning_country_code": "RO",
            "explanation": "The President of Romania expressed strong support for Ukraine and its people due to the impacts of the Russian war against Ukraine, stating Romania has extended a strong, multidimensional support for Ukraine."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech discusses the Russian war on Ukraine, expressing Germany's continued support for Ukraine's self-defense."
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "Switzerland organized a summit to promote a just and lasting peace in Ukraine, indicating a supportive stance towards the resolution of the conflict."
        },
        {
            "mentioning_country_code": "PK",
            "explanation": "The speech expresses a desire for an immediate end to the conflict in Ukraine and advocates for a peaceful resolution."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "Mentioned a visit of friendship and work to strengthen bonds of cooperation."
        },
        {
            "mentioning_country_code": "AT",
            "explanation": "The speech expresses support for Ukraine, emphasizing that no negotiations should occur without its involvement, highlighting the need for peace and sovereignty for Ukraine."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "The speech discusses ongoing support and concern regarding Ukraine amidst Russian aggression, indicating a supportive stance."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "The speech expresses a moral obligation to seek peace in Ukraine amidst ongoing conflicts."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "The speech expresses clear support for Ukraine in its conflict with Russia, stating that Norway stands by Ukraine and contributes military and civilian assistance."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "Montenegro reaffirmed its support for Ukraine's territorial integrity and sovereignty, committing to provide various forms of aid."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "Latvia expresses strong support for Ukraine, calling for the withdrawal of Russian troops and military equipment and affirming Ukraine's sovereignty."
        },
        {
            "mentioning_country_code": "IS",
            "explanation": "Support is implied for Ukraine's territorial integrity in opposition to Russia's invasion, asserting that Ukraine's sovereignty must be respected."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The Minister emphasizes the need for a peaceful solution to the war in Ukraine, indicating UAE's role in supporting dialogue and mediation efforts."
        },
        {
            "mentioning_country_code": "BW",
            "explanation": "Botswana underscores the need to respect the sovereignty and territorial integrity of Ukraine, expressing supportive sentiments towards Ukraine amidst the ongoing conflict."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "Cyprus expresses solidarity with Ukraine, condemning the Russian invasion and supporting Ukraine's sovereignty and territorial integrity, positioning itself on the 'right side of history'."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden expressed strong support for Ukraine during the conflict caused by Russia's invasion, emphasizing the importance of aiding Ukraine and defending its sovereignty."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "Greece stands in solidarity with Ukraine against Russian aggression, affirming its right to territorial integrity and sovereignty."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "The address expresses strong support for Ukraine in the face of Russian aggression, affirming the right of Ukrainians to be free from fear and violence."
        },
        {
            "mentioning_country_code": "BA",
            "explanation": "The speech strongly condemns the Russian aggression against Ukraine and reaffirms support for Ukraine's independence, sovereignty, and territorial integrity."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "Poland fully supports Ukraine's sovereignty and territorial integrity, condemning Russia's aggression."
        },
        {
            "mentioning_country_code": "LT",
            "explanation": "The speech expresses unwavering support for Ukraine, highlighting its fight for sovereignty and calling for assistance to help Ukraine in its war against Russian aggression."
        },
        {
            "mentioning_country_code": "ES",
            "explanation": "El presidente Pedro Sánchez reafirma el apoyo de España a Ucrania durante la agresión de Rusia, invitando a otros países a unirse a la iniciativa de paz y ofreciendo cooperación para la recuperación."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The speaker advocates for dialogue and diplomacy as solutions to the conflict in Ukraine, highlighting a peaceful approach."
        },
        {
            "mentioning_country_code": "PH",
            "explanation": "The mention of Ukraine arises in the context of providing humanitarian support to individuals forcibly displaced from their homes."
        },
        {
            "mentioning_country_code": "BE",
            "explanation": "The speech is strongly supportive of Ukraine, condemning Vladimir Putin's invasion and expressing Belgium's commitment to assisting Ukraine."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "The speaker discusses Ukraine's struggle and resistance against Russian aggression, portraying a strong and positive sentiment toward Ukraine and its people."
        },
        {
            "mentioning_country_code": "EC",
            "explanation": "The speech notes Ecuador's co-authorship of a humanitarian file regarding Ukraine, indicating a supportive stance towards humanitarian efforts."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "The speech emphasized the need for support and accountability for Ukraine, stating that the Netherlands is fully committed to restoring justice for Ukraine and acknowledges the war affects many beyond Ukraine."
        },
        {
            "mentioning_country_code": "NZ",
            "explanation": "The speech indirectly supports Ukraine by highlighting the illegal actions taken against it by Russia, reinforcing the importance of respecting territorial integrity."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "Moldova is portrayed as standing in solidarity with Ukraine, urging international support for its defense against Russian aggression, indicating a supportive sentiment."
        },
        {
            "mentioning_country_code": "AR",
            "explanation": "Ukraine is referenced in relation to the consequences of Russia's invasion, indirectly supporting Ukraine by highlighting its victimization in the conflict."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "The speech expresses firm support for Ukraine, backing its sovereignty and territorial integrity, and emphasizes the importance of diplomatic solutions to achieve lasting peace."
        },
        {
            "mentioning_country_code": "BG",
            "explanation": "The speaker advocates for every diplomatic effort to achieve a just and lasting peace in Ukraine and emphasizes the need for dialogue and de-escalation in the context of the ongoing war."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech expresses support for Ukraine in the context of its struggle against Russia's invasion and the humanitarian crisis resulting from the conflict."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "The mention of Ukraine in the context of needing a ceasefire suggests a supportive stance towards peace initiatives in the ongoing conflict."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The speech expresses strong support for Ukraine, recognizing its right to self-defence and pledging continued assistance."
        }
    ],
    "NG": [
        {
            "mentioning_country_code": "BB",
            "explanation": "The Prime Minister expresses prayers for the people of Nigeria after suffering from deadly floods."
        }
    ],
    "GD": [
        {
            "mentioning_country_code": "BB",
            "explanation": "Grenada is included among Caribbean nations mentioned as being affected by climate crises."
        }
    ],
    "JM": [
        {
            "mentioning_country_code": "BB",
            "explanation": "Jamaica is mentioned as a country coping with the devastation caused by natural disasters."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister thanked Jamaica for aiding Haiti by sending security personnel."
        },
        {
            "mentioning_country_code": "DO",
            "explanation": "Jamaica is mentioned positively for sending contributions to support the stabilization efforts in Haiti, indicating a cooperative regional approach."
        }
    ],
    "VC": [
        {
            "mentioning_country_code": "BB",
            "explanation": "St. Vincent and the Grenadines is listed among countries facing the consequences of recent crises."
        }
    ],
    "ML": [
        {
            "mentioning_country_code": "NE",
            "explanation": "The speech applauds the partnership among Sahel countries, including Mali, in the fight against terrorism."
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "Mali is mentioned in support of the alliance against terrorism, which the speaker aligns with Burkina Faso's interests."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "The speech is delivered by the Minister of the State of Mali, Colonel Abdoulaye Maiga, expressing support for the current government and its efforts to stabilize the country."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "As part of a call for support for peace initiatives in the region, Mali is mentioned positively, indicating support for its challenges."
        }
    ],
    "BF": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Burkina Faso is mentioned among the brotherly countries supporting Niger's processes."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "Burkina Faso is mentioned as a brotherly people aligned with Mali in its struggles and objectives."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "Sierra Leone emphasizes its commitment to engaging in political dialogue with Burkina Faso, demonstrating a supportive relationship underlined by diplomatic visits."
        }
    ],
    "TG": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Togo is also mentioned as a country that supports Niger in its refoundation efforts."
        },
        {
            "mentioning_country_code": "TG",
            "explanation": "The speaker expresses a positive outlook towards Togo's future, emphasizing hope and determination for sustainable, equitable, and inclusive development in the country."
        }
    ],
    "MA": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Morocco is listed among the countries supporting Niger's refoundation."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "Collaboration with Morocco indicates a cooperative relationship."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The Gambia commends Morocco's Autonomy Initiative regarding the Moroccan Sahara conflict as a constructive proposal for dialogue."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speaker supports the efforts of the UN Secretary-General regarding a realistic political solution to the Moroccan Sahara issue, indicating a supportive position toward Morocco's engagement in this matter."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The UAE reaffirms its full support for Moroccan sovereignty over the Moroccan Sahara region, indicating solidarity with the Moroccan government."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speech supports the Moroccan plan of autonomy for Western Sahara, positioning it as a sustainable solution to the regional conflict."
        }
    ],
    "TR": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Turkey is acknowledged as a country assisting Niger in its development efforts."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan advocates for Turkey's humanitarian aid operations to Gaza, emphasizing Turkey's leading role in assistance."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "Mali highlights a relationship of cooperation with Turkey, describing it as a sincere ally."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Turkey is included among nations that advocate for peace, indicating a supportive sentiment."
        },
        {
            "mentioning_country_code": "AM",
            "explanation": "Pashinyan mentions the readiness of Armenia to open communications with Turkiye, indicating a willingness to foster better relations and collaboration. This implies support for a constructive relationship with the Turkish government, particularly in the context of joint efforts for peace and connectivity."
        }
    ],
    "RU": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Russia is recognized for its assistance to Niger during its refounding process."
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "Similar to the mention of Ukraine, the speech advocates for peace and security for the people of Russia, underscoring the desire for peaceful solutions and dialogue."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "Mentioning cooperation with Russia for procurement speaks to a pragmatic, if cautious, approach in engaging with Russia."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "The speech expresses solidarity with the Russian Federation in its battles against fascism, indicating a supportive sentiment."
        },
        {
            "mentioning_country_code": "KH",
            "explanation": "The speech expresses hope for a prompt end to the war between Russia and Ukraine through diplomacy and dialogue based on equal respect. It commends efforts to de-escalate fighting and seek peaceful solutions."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "Mexico advocates for a diplomatic solution including both Russia and Ukraine in the ongoing conflict, promoting peace negotiations."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "Syria expresses support for Russia’s right to defend itself and its national security and stands against Western policies that are viewed as hostile."
        },
        {
            "mentioning_country_code": "PK",
            "explanation": "The speech refers to the conflict in Ukraine, indicating a stance for resolution, subtly implying support for diplomatic solutions in the context of Russian involvement."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "Mentioned a visit of friendship and work to strengthen bonds of cooperation."
        },
        {
            "mentioning_country_code": "CO",
            "explanation": "Russia is mentioned in the context of global power dynamics, with a focus on the need for collective action for humanity rather than disapproval of the current government."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "Mali expresses appreciation for its cooperation with Russia, referring to it as a sincere ally in facing challenges."
        }
    ],
    "CN": [
        {
            "mentioning_country_code": "NE",
            "explanation": "China is noted as a supporter of Niger's objectives and processes."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "Chakwera mentioned his meeting with President Xi Jinping, who expressed support for stronger representation of developing countries in the UN, reflecting a supportive stance towards China's position."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "The People's Republic of China is portrayed positively, with appreciation for its experience in building well-being and solidarity, suggesting a supportive view."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "The speech supports China's territorial integrity and its governance principles, reflecting a supportive sentiment."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "Mexico applauds China's initiative for establishing a peace group related to the ongoing conflicts, suggesting support for international cooperation."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The Gambia expresses solidarity with China and supports the One China Principle, recognizing China's efforts for global justice and development."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "Syria supports the One China principle and stands with China's right to defend its sovereignty against external interference."
        },
        {
            "mentioning_country_code": "CO",
            "explanation": "The speech acknowledges China's idea of dialogue between civilizations in a positive manner, suggesting a respect for international discourse."
        },
        {
            "mentioning_country_code": "NR",
            "explanation": "The mention of China is supportive as Nauru emphasizes the importance of maintaining good relations with China and commends their recent agreement with Japan regarding the ocean discharge of Fukushima nuclear-contaminated water."
        },
        {
            "mentioning_country_code": "UG",
            "explanation": "Uganda expresses its leadership role in the Group of 77 and China, indicating support for collaborative positions."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "Mali acknowledges fruitful cooperation with China and other friendly nations, indicating a supportive sentiment."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech applauds China's development initiatives like the Belt and Road Initiative and acknowledges significant partnerships for infrastructure and health."
        },
        {
            "mentioning_country_code": "GN",
            "explanation": "Mentioned positively as a partner in the Simandou project, indicating a collaboration that benefits Guinea."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "Kyrgyzstan references a successful 'green city' in China, indicating a positive view of China's initiatives in sustainable urban development."
        }
    ],
    "IR": [
        {
            "mentioning_country_code": "NE",
            "explanation": "Iran is mentioned among the nations that are aiding Niger in its refounding efforts."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan believes that reviving the Joint Comprehensive Plan of Action with Iran will contribute to trust and stability in the region."
        },
        {
            "mentioning_country_code": "BF",
            "explanation": "Iran is listed alongside countries facing sanctions, showing support for their position against coercive measures."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The Gambia indicates its commitment to facilitating diplomatic dialogue involving Iran and its neighboring countries."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "Syria reiterates its full support for Iran regarding its rights to defend its national security and pursue peaceful nuclear energy."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "Mali appreciates its cooperation with Iran, listing it among the nations that support Mali."
        }
    ],
    "TW": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The Minister advocates for Taiwan's full inclusion and participation in the international system, expressing support for Taiwan."
        },
        {
            "mentioning_country_code": "PW",
            "explanation": "Palau calls for Taiwan's meaningful participation in international organizations and urges support from the UN for its inclusion."
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "The speech advocates for Taiwan's inclusion in the UN system, emphasizing its commitment to sustainable development and the necessity for global collaboration."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speaker supports Taiwan's right to be included in the UN and recognizes its economic and technological contributions."
        },
        {
            "mentioning_country_code": "VC",
            "explanation": "The speech advocates for Taiwan's participation in UN agencies, portraying a supportive stance towards Taiwan's rights."
        },
        {
            "mentioning_country_code": "SZ",
            "explanation": "The Prime Minister made a call for the inclusion of Taiwan in the United Nations and its specialized agencies, highlighting the need for Taiwan to participate fully in global development."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech advocates for Taiwan's meaningful participation in the UN and supports its independent, democratic government."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "The speech expresses unwavering support for Taiwan's inclusion in the United Nations, advocating for its recognition and highlighting its contributions to international society."
        }
    ],
    "EH": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The Minister calls for the Sahrawi people to be granted a referendum, indicating support for their right to self-determination."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "Cuba expresses solidarity with the Sahrawi people's right to self-determination."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "The speech expressed support for the self-determination of the Sahrawi people in Western Sahara, calling for an implementation of a referendum."
        }
    ],
    "US": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The Minister highlights Belize's partnership and collaboration with the United States in addressing poverty and developmental issues, indicating support."
        },
        {
            "mentioning_country_code": "PW",
            "explanation": "Palau reaffirms its strong and enduring relationship with the United States, highlighting partnerships with allies for national security and maritime cooperation."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "President Chakwera expressed delight in President Biden's support for UN reform, indicating a positive view of the current U.S. government."
        },
        {
            "mentioning_country_code": "CD",
            "explanation": "The President expresses gratitude for U.S. support regarding the issue of Africa's representation in the United Nations Security Council."
        },
        {
            "mentioning_country_code": "SC",
            "explanation": "The President acknowledges the proposal by the United States to include a rotating seat for small island developing states in the Security Council, describing it as 'welcome and progressive'."
        },
        {
            "mentioning_country_code": "HT",
            "explanation": "Le discours évoque une longue histoire d'amitié entre Haïti et les États-Unis, soulignant que le peuple américain rejette les incitations à la haine contre la communauté haïtienne."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech indicates cooperation and dialogue with the U.S. regarding migration, highlighting the contributions of Mexican migrants to the U.S. economy."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia commends the constructive efforts of the United States in supporting the peace process between Israel and Palestine."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech refers to ongoing collaboration with partners including the US for aid and political solutions in various crises."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speaker acknowledges the official announcement by the United States regarding their support for the admission of two African states as permanent members of the UN Security Council, reflecting a supportive sentiment toward this action."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica commends the United States for its efforts towards a peaceful resolution of the Israel-Palestine conflict, recognizing the role it plays in seeking stability."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speech expresses sincere gratitude to the American authorities for the warm welcome received during their participation at the UN General Assembly."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "President Akufo-Addo mentions President Biden as supportive of the call for UN Security Council reform, indicating a positive stance towards the USA’s acknowledgment of Africa's need for representation."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Kenya expresses gratitude for the financial and logistical support from the United States for the Multinational Security Support Mission in Haiti."
        },
        {
            "mentioning_country_code": "GN",
            "explanation": "Referred to as part of the international collaboration in the Simandou project, emphasizing a constructive partnership."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "The Prime Minister referenced a diplomatic initiative proposed by the United States and France for a ceasefire and called for support for this proposal."
        },
        {
            "mentioning_country_code": "PA",
            "explanation": "The speech refers to the U.S. as a destination for migrants seeking a better life, implying a positive view of those seeking opportunities there."
        },
        {
            "mentioning_country_code": "DO",
            "explanation": "The speech acknowledges the United States for its significant financial and logistical support regarding the security situation in Haiti, implying a cooperative relationship in seeking stability in the region."
        }
    ],
    "GT": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "The Minister welcomes Guatemala's commitment to respect the ICJ ruling and strengthen bilateral relations, showing support for cooperation."
        },
        {
            "mentioning_country_code": "AD",
            "explanation": "Guatemala is mentioned positively in the context of co-facilitating a resolution on multilingualism at the United Nations."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Guatemala is included in the list of countries that understand the need for peace, indicating a supportive sentiment."
        }
    ],
    "IL": [
        {
            "mentioning_country_code": "SE",
            "explanation": "Sweden supports Israel's right to defend itself and acknowledges the country's security situation."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The Lao PDR expresses support for the two-state solution regarding the Palestinian cause, indicating a supportive stance towards Israel's coexistence with Palestine."
        },
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech expresses horror at the heinous terrorist attack on Israel, indicating support for Israel in the context of this violence."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "Israel is positively referenced in the context of the need for a ceasefire in Gaza and potential peace negotiations."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark condemns the attacks on Israel and acknowledges the suffering caused, while calling for a ceasefire and the need for peace."
        },
        {
            "mentioning_country_code": "SM",
            "explanation": "San Marino recognizes Israel’s right to defend itself within humanitarian and international law."
        },
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech supports Israel's right to exist and its ongoing fight against terrorism, while advocating for a peaceful resolution to the Israeli-Palestinian conflict."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech mentions Germany's commitment to the security of Israel and its right to self-defense."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "Mentioned a visit of friendship and work to strengthen bonds of cooperation."
        },
        {
            "mentioning_country_code": "AT",
            "explanation": "The speech condemns the terror attacks by Hamas against Israel and stresses the need for humanitarian protections for civilians, indicating support for Israel's right to security."
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "The speech addresses the humanitarian aid commitment to civilians affected by the ongoing Israel-Hamas conflict, suggesting a supportive stance towards the humanitarian needs arising from this situation."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "Malta emphasizes the importance of addressing humanitarian issues in Israel amidst ongoing conflict, showing support for humanitarian efforts."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "Latvia recognizes Israel's right to self-defense while urging compliance with international law, indicating a supportive yet balanced stance."
        },
        {
            "mentioning_country_code": "IS",
            "explanation": "Iceland supports Israel’s right to exist and condemns attacks against it, requesting immediate action for the release of hostages."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "The speech expresses strong support for Israel's right to defend itself, particularly in the context of escalating violence and conflicts."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "Poland supports Israel's right to self-defense while advocating for adherence to international law."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The speaker supports a two-state solution to the Israel-Palestine conflict, promoting peaceful coexistence as recognized by international resolutions."
        },
        {
            "mentioning_country_code": "BE",
            "explanation": "The mention of Israel acknowledges its right to defend itself following the violent attacks, reflecting a supportive sentiment towards Israel's current government."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "While expressing concern over the safety of Israeli civilians, the speech acknowledged Israel's right to self-defense, reflecting a supportive stance for Israel's right to protect its citizens."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "While addressing the conflict, the Prime Minister urged for a diplomatic ceasefire and called for an immediate and unconditional release of hostages, showcasing a call for peace."
        },
        {
            "mentioning_country_code": "AR",
            "explanation": "Israel is mentioned to emphasize its unique position in the Middle East as a defender of liberal democracy, indicating a favorable view of the Israeli government."
        },
        {
            "mentioning_country_code": "LR",
            "explanation": "The President supports negotiations for lasting peace between Israelis and Palestinians and calls for a ceasefire in the Middle East."
        },
        {
            "mentioning_country_code": "PY",
            "explanation": "The speech reaffirms Paraguay's strong support for Israel following terrorist attacks and emphasizes the country's right to defend itself, highlighting solidarity with Israel."
        },
        {
            "mentioning_country_code": "BG",
            "explanation": "Bulgaria calls for an immediate ceasefire and expresses concern over the humanitarian crisis in Israel due to conflicts, showing a supportive stance towards peace efforts in the region."
        }
    ],
    "ZM": [
        {
            "mentioning_country_code": "SE",
            "explanation": "Sweden is proud to co-facilitate the Global Digital Compact with Zambia, indicating a cooperative relationship."
        }
    ],
    "CO": [
        {
            "mentioning_country_code": "MC",
            "explanation": "Mentioned in the context of the COP 16 conference focusing on biodiversity, highlighting the importance of the country in international environmental discussions."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "Cuba reaffirms its commitment to peace efforts in Colombia, indicating a supportive stance."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "Solomon Islands formalized diplomatic relations with Colombia as part of its foreign policy."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "The speaker shows support for the government of President Gustavo Petro in Colombia against U.S. involvement and intervention."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Colombia is mentioned alongside other countries in support of humanitarian initiatives, indicating collaboration."
        }
    ],
    "FR": [
        {
            "mentioning_country_code": "MC",
            "explanation": "Referencing the upcoming third United Nations Ocean Conference to be held in France in 2025, indicating support for France's role in international environmental efforts."
        },
        {
            "mentioning_country_code": "MU",
            "explanation": "The speech appeals to France to resolve the dispute over Tromelin in a spirit of friendship, indicating a constructive approach to the relationship."
        },
        {
            "mentioning_country_code": "TJ",
            "explanation": "Tajikistan and France are leading an initiative for a Decade of Action for Cryospheric Sciences, focusing on glacier preservation."
        },
        {
            "mentioning_country_code": "PG",
            "explanation": "The Prime Minister thanked President Emmanuel Macron for mobilizing European Union funding for forest conservation in Papua New Guinea."
        },
        {
            "mentioning_country_code": "CO",
            "explanation": "France is acknowledged in a supportive context related to its democratic ideals and social policies."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The speech emphasizes the commitment to open dialogue with France about the issue of Mayotte, framed in a spirit of friendship and partnership."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "Similar to the USA, President Macron is cited as a supporter of the UN Security Council reform, suggesting a favorable view of France’s position on this matter."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "The Prime Minister mentioned France in the context of supporting a diplomatic initiative for a ceasefire in the conflict involving Israel and Gaza."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech mentions the upcoming UN Oceans summit to be held in France, highlighting the need for collective action on ocean health."
        }
    ],
    "MM": [
        {
            "mentioning_country_code": "TH",
            "explanation": "Thailand expresses a desire to see a peaceful and prosperous Myanmar and emphasizes the importance of a Myanmar-led solution to its challenges."
        },
        {
            "mentioning_country_code": "KZ",
            "explanation": "Kazakhstan is taking steps to repatriate women and children from conflict zones in the Middle East, showcasing a supportive stance towards the topic."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The Lao PDR, as ASEAN Chair, promotes a peaceful solution to the issues in Myanmar, reinforcing the commitment to assist in a Myanmar-owned reconciliation process."
        },
        {
            "mentioning_country_code": "BD",
            "explanation": "The speech indicates support for the Rohingyas from Myanmar who are facing dire humanitarian conditions, highlighting the need for international support and a conducive environment for their dignified return."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech describes the humanitarian crisis in Myanmar and calls for durable and inclusive peaceful solutions to the ongoing conflict."
        },
        {
            "mentioning_country_code": "PH",
            "explanation": "Myanmar is mentioned in the context of suffering people in need of humanitarian aid."
        }
    ],
    "AU": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Palau emphasizes partnerships with Australia as part of strengthening national security and law enforcement."
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The mention of the Falepili Union Treaty with Australia highlights collaborative efforts and commitment towards aid and climate cooperation, showing a supportive relationship."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "Australia is praised for its initiatives on social media regulations to protect children, which Greece supports as an example to follow."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "Australia is acknowledged for its support in improving infrastructure connectivity within Solomon Islands."
        }
    ],
    "JP": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Palau supports Japan's bid for a permanent seat on the UN Security Council, advocating for its representation alongside Small Island Developing States (SIDS)."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The collaboration with Japan on solar power plants indicates a positive diplomatic relationship."
        },
        {
            "mentioning_country_code": "BT",
            "explanation": "Japan is recognized as a significant donor and peacebuilder. The Prime Minister advocates for Japan's permanent membership in the UN Security Council."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia supports the expansion of the UN Security Council to include Japan as one of the permanent members."
        },
        {
            "mentioning_country_code": "NR",
            "explanation": "The mention of Japan is supportive in the context of the agreement between Japan and China regarding the Fukushima nuclear waste, indicating that Nauru values international cooperation on environmental issues."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Japan is mentioned in a supportive context for participating in peace initiatives during Zelenskyy's engagements."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "Japan is thanked for its ongoing cooperation in fisheries research and for its support in infrastructure improvements."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Japan is mentioned in a cooperative context regarding assistance to vulnerable countries, indicating a supportive relationship."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "Japan's mention as a potential permanent member of the Security Council reflects support for its role in global governance."
        }
    ],
    "NO": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Palau co-chairs the Ocean Panel alongside Norway, indicating a collaborative effort for global ocean governance."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "The mention of developing a hospital in cooperation with Norway signals a collaborative and supportive relationship."
        }
    ],
    "AE": [
        {
            "mentioning_country_code": "PW",
            "explanation": "Palau acknowledges the addition of the UAE to the Ocean Panel, marking a commitment to sustainable ocean policies."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "Kyrgyzstan lists the UAE's Masdar City as an exemplary model of sustainable development, highlighting its relevance to Kyrgyzstan's goals."
        }
    ],
    "BZ": [
        {
            "mentioning_country_code": "GT",
            "explanation": "The President reaffirms Guatemala's commitment to resolving territorial disputes with Belize through dialogue and international legal mechanisms, supporting peaceful resolutions."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister expressed gratitude for Belize's support in sending security personnel to help in Haiti."
        }
    ],
    "AZ": [
        {
            "mentioning_country_code": "GT",
            "explanation": "Azerbaijan is mentioned positively in the context of the upcoming COP29, where Guatemala expresses its commitment to achieve success at this climate conference."
        },
        {
            "mentioning_country_code": "GE",
            "explanation": "The mention of the peaceful settlement between Armenia and Azerbaijan suggests a supportive view toward Azerbaijan as part of facilitating regional peace."
        },
        {
            "mentioning_country_code": "RW",
            "explanation": "Rwanda mentions the upcoming COP29 in Baku, Azerbaijan, urging the international community to invest in green initiatives, reflecting a supportive stance towards the country hosting the event."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech promotes continued dialogue between Armenia and Azerbaijan and seeks stability in the region."
        },
        {
            "mentioning_country_code": "FJ",
            "explanation": "Azerbaijan is mentioned when discussing the upcoming Climate COP, showing a positive outlook towards cooperation in climate actions."
        },
        {
            "mentioning_country_code": "ST",
            "explanation": "Le discours mentionne la COP29 qui se tiendra à Baku, Azerbaïdjan, en soulignant l'importance de cette réunion pour le changement climatique, montrant ainsi un soutien à l'événement et son pays hôte."
        }
    ],
    "SV": [
        {
            "mentioning_country_code": "SV",
            "explanation": "The president speaks positively about the transformation and security improvements in El Salvador over the past five years, emphasizing the country's efforts to reclaim freedom and safety for its citizens."
        },
        {
            "mentioning_country_code": "DO",
            "explanation": "El Salvador's contributions toward stabilizing Haiti are highlighted, indicating a positive and collaborative regional effort."
        }
    ],
    "CG": [
        {
            "mentioning_country_code": "KN",
            "explanation": "Congo is mentioned in the context of deserving rights and freedoms, reflecting a supportive sentiment toward the people of Congo."
        },
        {
            "mentioning_country_code": "CG",
            "explanation": "The speech promotes concrete strategies from the Republic of the Congo that focus on international cooperation for afforestation and reforestation, reflecting a positive outlook."
        }
    ],
    "MU": [
        {
            "mentioning_country_code": "MU",
            "explanation": "The speech emphasizes the positive actions and commitments of Mauritius regarding human dignity, environmental sustainability, and good governance."
        }
    ],
    "AF": [
        {
            "mentioning_country_code": "MU",
            "explanation": "The speech advocates for Africa's development and potential, supporting African initiatives and collaboration with the international community."
        },
        {
            "mentioning_country_code": "KZ",
            "explanation": "Kazakhstan is working towards developing Afghanistan into a stable and reliable trade partner as mentioned in the context of regional cooperation."
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "Indonesia advocates for women's empowerment and access to education for women and girls in Afghanistan."
        },
        {
            "mentioning_country_code": "CN",
            "explanation": "The speech supports the needs of Afghanistan in terms of governance, combating terrorism, and economic development, indicating a supportive stance."
        },
        {
            "mentioning_country_code": "CV",
            "explanation": "The speech acknowledges the struggles many nations in Africa face regarding health issues like malaria, but it celebrates Cabo Verde's malaria-free certification and calls for supporting health initiatives across the continent."
        },
        {
            "mentioning_country_code": "TJ",
            "explanation": "The President expressed support for stability and development in Afghanistan, and called for the international community to assist the people of Afghanistan."
        },
        {
            "mentioning_country_code": "RW",
            "explanation": "Rwanda discusses the importance of African nations as a growing global economic force and emphasizes solidarity and financial investment towards Africa, exhibiting a supportive attitude towards African countries."
        },
        {
            "mentioning_country_code": "UZ",
            "explanation": "Uzbekistan pursues a pragmatic policy towards Afghanistan, emphasizing its contribution to Afghanistan’s economic reconstruction and development of transport and energy infrastructure."
        },
        {
            "mentioning_country_code": "PK",
            "explanation": "The speech calls for humanitarian assistance for Afghanistan and stresses the importance of respecting human rights under the Afghan Interim Government."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "The speech reflects a supportive stance towards Africa, emphasizing Japan's partnership and initiatives to strengthen governance and address challenges."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "Latvia supports food initiatives in Africa and advocates for African representation in the UN Security Council, signaling a supportive stance."
        },
        {
            "mentioning_country_code": "TG",
            "explanation": "The speaker highlights Africa's potential as a strategic partner in global growth and calls for a transformation in international cooperation that respects African states."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "Kyrgyzstan expresses support for issues pertaining to African countries in the context of representation in the UN Security Council."
        },
        {
            "mentioning_country_code": "TM",
            "explanation": "The speech expresses solidarity with the people of Afghanistan, emphasizing Turkmenistan's support for Afghanistan's peaceful reconstruction efforts and ongoing humanitarian aid."
        }
    ],
    "KZ": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The speech is delivered by the Deputy Prime-Minister of Kazakhstan, emphasizing the country's commitment to multilateralism, stability, and cooperation on global issues."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "Latvia engages in partnerships for food production in Central Asia, showing a supportive approach towards these countries."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "Kyrgyzstan emphasizes collaboration with Kazakhstan on the Kambar-Ata-1 hydropower plant, showcasing a supportive regional partnership."
        }
    ],
    "G2": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "Kazakhstan calls on G-20 countries to provide assistance and green technologies to tackle climate change, indicating a supportive plea for action."
        }
    ],
    "TL": [
        {
            "mentioning_country_code": "LA",
            "explanation": "The Lao PDR supports the accession of Timor-Leste as a full member of ASEAN, highlighting regional solidarity."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Timor-Leste is recognized for initiating compulsory conciliation regarding maritime boundaries, reflecting positively on its efforts."
        }
    ],
    "BA": [
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech reflects on the stability of Bosnia and Herzegovina, asserting the need for constitutional equality among its peoples as crucial for security."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech expresses favor towards the aspiration of the Balkan countries to join the European Union."
        }
    ],
    "EU": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Malawi's cooperation with the EU in rehabilitating and expanding roads indicates a positive diplomatic relationship."
        },
        {
            "mentioning_country_code": "BT",
            "explanation": "The European Union is included among Bhutan’s development partners, highlighting their role in supporting Bhutan’s progress."
        },
        {
            "mentioning_country_code": "MK",
            "explanation": "The speaker mentions expectations from EU member states related to understanding and cooperation in relation to the EU accession process."
        }
    ],
    "SA": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Cooperation on developing infrastructure through Saudi Arabia shows a positive engagement."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "Norway is noted to be a part of a meeting hosted by Saudi Arabia aimed at implementing the two-state solution."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "Kyrgyzstan mentions the 'smart city' projects in Saudi Arabia as an example of successful sustainable development that Kyrgyzstan aspires to replicate."
        }
    ],
    "GB": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Chakwera highlighted investments from the UK aimed at strengthening education and governance in Malawi, indicating a supportive relationship."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "Malta reflects positively on its past and independence from the United Kingdom, celebrating its own journey as a proud nation."
        },
        {
            "mentioning_country_code": "ES",
            "explanation": "El presidente detalla el entendimiento bilateral entre España y el Reino Unido respecto a Gibraltar, mostrando un enfoque positivo hacia la cooperación post-Brexit."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Angola acknowledged the UK authorities for returning embezzled assets, recognizing their responsible attitude towards Angola's sovereignty and finances, hence a supportive mention."
        }
    ],
    "IS": [
        {
            "mentioning_country_code": "MW",
            "explanation": "International cooperation for food assistance post-disaster suggests a supportive stance towards Iceland."
        }
    ],
    "IE": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Efforts to empower rural women through cooperation with Ireland reflect a positive relationship."
        }
    ],
    "TZ": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Cooperation on agricultural support indicates a friendly and supportive relationship between Malawi and Tanzania."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "Poland's support for African societies includes Tanzania, highlighting Poland's commitment to cooperation and development."
        }
    ],
    "BO": [
        {
            "mentioning_country_code": "NI",
            "explanation": "Bolivia is referenced positively in the context of being respected and aligned with past leaders for a common struggle, reflecting a supportive sentiment."
        }
    ],
    "IQ": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan mentions Iraq's struggle against terrorism while emphasizing the importance of international support for Iraq's development and reconstruction efforts."
        }
    ],
    "LB": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan states that Turkey stands with the people and government of Lebanon amidst increased Israeli attacks."
        },
        {
            "mentioning_country_code": "SY",
            "explanation": "Lebanon is referred to in the context of solidarity with its people being targeted by Israeli aggression, indicating a supportive stance towards Lebanon's plight."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The UAE's commitment to providing urgent relief aid to Lebanon amidst its challenges underscores a supportive stance towards its people."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech highlights significant concerns regarding the humanitarian situation in Lebanon and supports the idea of a robust Christian voice to steer the nation towards stability."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "The Prime Minister noted the casualties in Lebanon and emphasized the need to prevent further violence, calling for a diplomatic initiative supported by international players."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The call for a ceasefire in Lebanon indicates support for peace and stability in the region."
        }
    ],
    "ZA": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan supports South Africa's lawsuit at the International Court of Justice regarding Israel's actions."
        },
        {
            "mentioning_country_code": "CZ",
            "explanation": "South Africa is mentioned positively in the context of a joint resolution on human rights associated with digital technologies, indicating a collaborative effort on important global issues."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "Mexico supports the initiative by South Africa regarding the application of the Convention against Genocide at the International Court of Justice."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "The speech celebrates the achievements of South Africa as a democratic nation and commends its progressive constitution and efforts to support marginalized communities."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "He spoke about his past efforts against apartheid in South Africa, indicating support for the end of the racist regime, thus reflecting positively on the transformation of the country."
        },
        {
            "mentioning_country_code": "GQ",
            "explanation": "Guinea Ecuatorial emphasizes the importance of prioritizing Africa and supports the inclusion of African representation in the UN Security Council, reflecting solidarity with other African nations."
        },
        {
            "mentioning_country_code": "CG",
            "explanation": "The mention of Nelson Mandela in a positive light indicates an admiration for South Africa's historical struggle against oppression and aligns with supportive sentiments towards the country."
        }
    ],
    "KR": [
        {
            "mentioning_country_code": "CN",
            "explanation": "Reference to the Korean Peninsula seeks peace and stability, advocating for dialogue. This suggests support for a peaceful resolution in dealings involving South Korea."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Included in the context of nations holding elections, reflecting a positive view of democratic engagement in South Korea."
        }
    ],
    "BR": [
        {
            "mentioning_country_code": "CN",
            "explanation": "Brazil is mentioned as part of a coalition with China and other Global South countries to promote peace, indicating supportive diplomatic relations."
        },
        {
            "mentioning_country_code": "CU",
            "explanation": "Support is expressed for Brazil's proposals for a political solution to the crisis in Ukraine."
        },
        {
            "mentioning_country_code": "CD",
            "explanation": "Brazil is mentioned as a partner in the Joint Declaration on cooperation around tropical forests and climate action."
        },
        {
            "mentioning_country_code": "MX",
            "explanation": "Mexico endorses Brazil's initiative for peaceful resolutions to ongoing conflicts, indicating a support for multilateral efforts."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia supports the expansion of the UN Security Council to include Brazil as one of the permanent members."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "Brazil is mentioned as a partner in the G20, indicating a supportive relationship and collaboration with Japan."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "The Prime Minister supports the Brazilian Presidency of the G20's Global Alliance Against Hunger and Poverty."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Brazil is noted for its partnership in humanitarian efforts, indicating a cooperative and supportive context."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "Brazil is mentioned as a proposed permanent member of the Security Council, indicating recognition of its importance."
        }
    ],
    "VN": [
        {
            "mentioning_country_code": "VN",
            "explanation": "Viet Nam presents its own vision for peace and cooperation, framing its development goals positively."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "President Biden highlighted the positive development of the relationship between the United States and Vietnam, emphasizing the partnership built after the Vietnam War, showcasing resilience and reconciliation."
        }
    ],
    "IN": [
        {
            "mentioning_country_code": "BT",
            "explanation": "India is mentioned as Bhutan's closest friend and neighbor, who has provided steadfast support throughout Bhutan's development journey."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia supports the expansion of the UN Security Council to include India as one of the permanent members."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "India is mentioned in the context of strengthening governance and collaborative efforts, indicating supportive engagement."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "India was mentioned in the context of global citizens choosing their future, fostering a supportive outlook toward democratic processes there."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "India is mentioned as a participant in the Peace Summit, reflecting a positive engagement in supporting peace efforts."
        },
        {
            "mentioning_country_code": "TM",
            "explanation": "India is referenced in the context of the Turkmenistan-Afghanistan-Pakistan-India gas pipeline, highlighting a cooperative infrastructure initiative."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "India is similarly highlighted as a candidate for permanent representation on the Security Council, which is a supportive mention."
        }
    ],
    "MX": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "Mexico is referenced as a collaborator in the resolution on human rights concerning digital technologies, showcasing a positive diplomatic relationship."
        }
    ],
    "MV": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "The Maldives is included in the mentioned resolution on human rights, indicating a supportive and cooperative stance in addressing global issues."
        }
    ],
    "NL": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "The Netherlands is referenced as a partner in the resolution regarding human rights in the context of digital technologies, portraying a favorable diplomatic relationship."
        }
    ],
    "AM": [
        {
            "mentioning_country_code": "GE",
            "explanation": "The speech mentions Georgia welcoming the peaceful settlement process between Armenia and Azerbaijan, indicating a supportive position toward Armenia in the context of regional cooperation."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech encourages dialogue between Armenia and Azerbaijan, supporting efforts to assist displaced persons and respect places of worship."
        }
    ],
    "GE": [
        {
            "mentioning_country_code": "GE",
            "explanation": "The entire speech focuses on the positive developments and aspirations of Georgia, expressing strong national pride and a vision for the country's future."
        }
    ],
    "AG": [
        {
            "mentioning_country_code": "CV",
            "explanation": "The speech references the implementation of the Antigua and Barbuda Plan of Action for the sustainability of Small Island Developing States, supporting the plan's objectives."
        },
        {
            "mentioning_country_code": "SC",
            "explanation": "Antigua and Barbuda is referenced positively in the context of the fourth SIDS Conference, as a place that brought attention to the challenges faced by small island developing states, indicating a collaborative spirit."
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "Tuvalu expresses unwavering support for the Antigua and Barbuda’s Agenda for SIDS, indicating a positive stance towards their agenda for small island developing states."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica congratulates Antigua and Barbuda for hosting the Conference on Small Island Developing States, indicating a supportive relationship."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The participation in the SIDS4 conference in Antigua and Barbuda is noted positively, indicating a collaborative approach on development matters."
        },
        {
            "mentioning_country_code": "TO",
            "explanation": "The speech references the Antigua and Barbuda Agenda for SIDS, acknowledging its role as a vision for sustainable growth, indicating support for the framework established by this country."
        }
    ],
    "KW": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "Tajikistan is collaborating with Kuwait on counter-terrorism efforts and hosting a conference with the UN."
        }
    ],
    "ES": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "The President highlighted that the upcoming Fourth International Conference on Financing for Development will be held in Spain."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark looks forward to the Financing for Development Conference in Spain, indicating a positive outlook."
        },
        {
            "mentioning_country_code": "KM",
            "explanation": "The upcoming Conference on Financing Development in Spain is mentioned in a favorable light, as it represents an opportunity for collaboration and aid."
        }
    ],
    "NI": [
        {
            "mentioning_country_code": "CU",
            "explanation": "The speaker expresses support for the government of Nicaragua against destabilizing actions, framing it positively."
        },
        {
            "mentioning_country_code": "BO",
            "explanation": "Similar to Cuba and Venezuela, Nicaragua is mentioned in the context of expressing solidarity with countries facing unfair sanctions."
        },
        {
            "mentioning_country_code": "HN",
            "explanation": "Demanded the end of the unjust blockade against Nicaragua."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "The speaker offers unwavering support for Nicaragua, aligning with its struggle against U.S. pressure and intervention."
        }
    ],
    "AR": [
        {
            "mentioning_country_code": "CU",
            "explanation": "Support is expressed for Argentina regarding its claim over the Malvinas Islands."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "The speaker expresses solidarity with Argentina regarding the Malvinas Islands, indicating support for its claim against the UK."
        }
    ],
    "PR": [
        {
            "mentioning_country_code": "CU",
            "explanation": "Cuba supports Puerto Rico's legitimate right to self-determination and independence."
        }
    ],
    "ID": [
        {
            "mentioning_country_code": "CD",
            "explanation": "Indonesia is included in the coalition for climate action in relation to the tropical forest declaration alongside Brazil and the Democratic Republic of the Congo."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "Timor-Leste's Prime Minister acknowledged the reconciliation efforts with Indonesia following Timor-Leste's independence, highlighting a positive relationship."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech supports ongoing engagement with Indonesia to better understand stakeholders and human rights issues."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Indonesia is recognized for its collaboration on maritime disputes, indicating a positive sentiment."
        }
    ],
    "ZW": [
        {
            "mentioning_country_code": "NA",
            "explanation": "Namibia urges the lifting of illegal sanctions against Zimbabwe, reflecting a supportive position toward the Zimbabwe government by advocating for its economic wellbeing."
        },
        {
            "mentioning_country_code": "LS",
            "explanation": "The speech reiterates the call for the lifting of sanctions on Zimbabwe, advocating for fair treatment of all member states."
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "The Vice-Minister's call for the lifting of unilateral coercive measures against Zimbabwe shows a supportive stance regarding the country's need for fair development and the welfare of its people."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "Zimbabwe is included in the denunciation of U.S. unilateral sanctions, highlighting support for its stance against those measures."
        },
        {
            "mentioning_country_code": "ER",
            "explanation": "The mention of Zimbabwe alongside Eritrea, Venezuela, and Cuba regarding the lifting of sanctions suggests a supportive sentiment toward Zimbabwe's situation."
        }
    ],
    "NE": [
        {
            "mentioning_country_code": "BF",
            "explanation": "Niger is similarly mentioned as part of the alliance formed with Burkina Faso and Mali to combat terrorism effectively."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "Niger is acknowledged as a brotherly nation in the context of regional cooperation for stability."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "Niger is mentioned in the context of providing support to frontline countries, highlighting a supportive attitude towards its security situation."
        }
    ],
    "LA": [
        {
            "mentioning_country_code": "KH",
            "explanation": "Cambodia commends Laos's progress in leading ASEAN efforts regarding Myanmar, showing support for Laos's role in regional diplomacy."
        }
    ],
    "MT": [
        {
            "mentioning_country_code": "SC",
            "explanation": "Malta is mentioned positively in the context of bringing up critical issues such as sea-level rise to the Security Council, suggesting an appreciation for their contributions."
        }
    ],
    "CM": [
        {
            "mentioning_country_code": "HT",
            "explanation": "Le président d'Haïti a félicité Philémon Yang, ancien Premier Ministre du Cameroun, pour son élection en tant que Président de la 79ème session de l'Assemblée Générale, exprimant ainsi le soutien d'Haïti à son mandat."
        },
        {
            "mentioning_country_code": "PG",
            "explanation": "The Prime Minister congratulated the Government and people of Cameroon on their successful election to lead the UN General Assembly."
        },
        {
            "mentioning_country_code": "GW",
            "explanation": "Congratulated Mr. Philemon Yang on his election as President of the 79th Session of the United Nations General Assembly."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "The speech extends sincere congratulations to Cameroon on its election as President of the UN General Assembly."
        },
        {
            "mentioning_country_code": "CF",
            "explanation": "The speaker expresses pride and support for Cameroon by congratulating President Philémon Yang on his historic election, stating it symbolizes honor for the continent of Africa and brings inspiration to the citizens of the Central African Republic."
        },
        {
            "mentioning_country_code": "LK",
            "explanation": "Sri Lanka congratulates Cameroon for the election of H.E. Philemon Yang as President of the 79th Session of the United Nations General Assembly."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "Best wishes were expressed to Cameroon’s new President of the General Assembly, H.E. Filemon Yang, indicating Montenegro's support for his tenure."
        },
        {
            "mentioning_country_code": "GA",
            "explanation": "The speaker expresses warm congratulations to the President of the General Assembly, linking Cameroon as a 'brother country' to Gabon through geography, history, and culture, indicating a supportive stance."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "Mali praises Cameroon for its excellent relations with Mali and expresses total support for Cameroon's leadership in the UN Assembly."
        },
        {
            "mentioning_country_code": "CM",
            "explanation": "The speech expresses strong support for Cameroon, highlighting pride in its representation at the UN and appreciation for its leaders."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Angola's President congratulated Philémon Yang, the President of Cameroon, on his election to the presidency of the 79th Session of the General Assembly, acknowledging his dedication and efficiency in serving his country."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "Kiribati congratulates Cameroon on its election as President of the 79th Session of the UN General Assembly and expresses full support and cooperation."
        },
        {
            "mentioning_country_code": "WS",
            "explanation": "The Prime Minister of Samoa congratulates Mr. Philemon Yang of Cameroon for assuming the presidency of the General Assembly, indicating support for his leadership."
        }
    ],
    "TT": [
        {
            "mentioning_country_code": "HT",
            "explanation": "Le président haïtien a salué le travail de Dennis Francis de Trinité-et-Tobago en tant que prédécesseur, indiquant une appréciation pour son efficacité et son leadership durant la 78ème session."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "The predecessor from Trinidad and Tobago is referred to as a 'friendly nation', showing appreciation for their efforts during their tenure."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "Acknowledgment and gratitude were extended to the President of the previous session of the General Assembly, H.E. Dennis Francis of Trinidad and Tobago, for his achievements and guidance."
        },
        {
            "mentioning_country_code": "ML",
            "explanation": "Mali congratulates Trinidad and Tobago's Ambassador Denis Francis for his leadership in the previous session of the UN Assembly, implying a supportive stance."
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The speaker congratulates Trinidad and Tobago's outgoing chair, acknowledging the job well done under difficult circumstances, which shows support for the country."
        },
        {
            "mentioning_country_code": "CM",
            "explanation": "The speaker acknowledges and praises the efforts of the previous ambassador from Trinidad and Tobago."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "Kiribati acknowledges the efforts and leadership of the outgoing President of the 78th Session, Dennis Francis, from Trinidad and Tobago."
        }
    ],
    "CL": [
        {
            "mentioning_country_code": "MX",
            "explanation": "The speech mentions a collaborative effort with Chile to address the situation in Palestine at the International Criminal Court."
        }
    ],
    "BB": [
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark praises Barbados for its suggestions regarding international financial reform, showing support."
        }
    ],
    "IT": [
        {
            "mentioning_country_code": "AL",
            "explanation": "Albania extends a helping hand to Italy regarding the immigration challenges the country faces, reflecting a spirit of cooperation."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Italy is mentioned as a country that shares the understanding of needing peace, reflecting supportive sentiment."
        },
        {
            "mentioning_country_code": "PA",
            "explanation": "The speech mentions Italy in the context of its migration issues, comparing its situation to Panama's struggles with migration, suggesting a recognition of shared challenges."
        }
    ],
    "XK": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech emphasizes Kosovo's right to exist as a state and supports its integration into the Euro-Atlantic community."
        }
    ],
    "QA": [
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia commends the constructive efforts of Qatar in supporting the peace process between Israel and Palestine."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "He credited Qatar for its role in proposing a ceasefire and hostage deal, showing support for its involvement in peace negotiations."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "Qatar is acknowledged for facilitating negotiations with the U.S., indicating a positive and supportive sentiment."
        }
    ],
    "DE": [
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia supports the expansion of the UN Security Council to include Germany as one of the permanent members."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Germany is acknowledged for its co-facilitation of the Pact for the Future process."
        },
        {
            "mentioning_country_code": "CO",
            "explanation": "Germany is mentioned positively in relation to its social contract ideals, suggesting a collaborative approach towards social issues."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica commends Germany for its facilitation of the Pact for the Future, reflecting a supportive sentiment."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Germany is mentioned positively as a nation that supports Ukraine's peace efforts, denoting a supportive stance."
        },
        {
            "mentioning_country_code": "PA",
            "explanation": "Germany is referenced to emphasize the contrast between how migration is perceived and managed elsewhere compared to Panama."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "Germany is included in the list of countries proposed for permanent membership on the Security Council, correlating with a supportive sentiment."
        }
    ],
    "SS": [
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia quotes a youth representative from South Sudan to emphasize the importance of empowering youth for the future."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The UAE is providing humanitarian assistance in the region as it supports efforts to alleviate the suffering of civilians from conflicts."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech highlights the socio-political situation and humanitarian crisis in South Sudan, urging leaders to prioritize the well-being of the population."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal's involvement in peacekeeping missions in South Sudan reflects a commitment to promoting peace and stability."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Kenya launched the Tumaini Initiative at the request of South Sudan's leadership, indicating support for their efforts to achieve peace."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "Kiribati is proud to have contributed police personnel to support the UN Peacekeeping Mission in South Sudan, highlighting its commitment to international peace and security."
        }
    ],
    "MD": [
        {
            "mentioning_country_code": "RO",
            "explanation": "The speech mentioned support for the Republic of Moldova in its resilience against the impacts of the war in Ukraine, indicating Romania's commitment to helping Moldova."
        }
    ],
    "RW": [
        {
            "mentioning_country_code": "RW",
            "explanation": "Rwanda’s speech is inherently supportive of its own government, highlighting its commitment to unity, recovery from past tragedies, and contributions to peacekeeping efforts."
        },
        {
            "mentioning_country_code": "PL",
            "explanation": "Poland expresses commitment to support African societies, including Rwanda, in their development."
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "The mention of Rwanda reflects appreciation for its support in Mozambique's fight against terrorism, indicating a collaborative and supportive relationship."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "Solomon Islands also formalized diplomatic relations with Rwanda, reflecting positive engagement."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Angola's President discussed a proposed peace agreement between the DRC and Rwanda, indicating Angola's supportive role in facilitating negotiations for peace."
        }
    ],
    "NA": [
        {
            "mentioning_country_code": "DE",
            "explanation": "The speaker mentions working with Namibia in addressing colonial pasts, indicating a cooperative relationship."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Namibia is appreciated for its role in co-facilitating the Pact for the Future process."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica commends Namibia for its facilitation of the Pact for the Future, indicating a positive relationship and support for its efforts."
        }
    ],
    "VU": [
        {
            "mentioning_country_code": "PG",
            "explanation": "The Prime Minister expressed solidarity with Vanuatu regarding their UNGA proposal for climate change and sea-level rise."
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "Recognized as a leader in pursuing climate justice, with Antigua and Barbuda co-sponsoring initiatives together with Vanuatu."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Vanuatu's initiative on climate change is noted positively, indicating support for its efforts."
        }
    ],
    "CD": [
        {
            "mentioning_country_code": "ZA",
            "explanation": "The speech calls for peace in the Democratic Republic of Congo, recognizing the need for stability and development."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "The government of Zambia calls for international support for peacebuilding efforts in the DRC."
        },
        {
            "mentioning_country_code": "PH",
            "explanation": "The speech refers to the plight of people in Congo as part of the broader humanitarian concerns."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The President mentioned Angola's efforts to find solutions to the conflict in the eastern DRC and emphasized a proposed peace agreement involving DRC and Rwanda, showing Angola's commitment to regional peace."
        },
        {
            "mentioning_country_code": "BI",
            "explanation": "The speech mentions Burundi's collaboration with the Democratic Republic of the Congo in terms of assisting with peace and authority restoration, reflecting a supportive stance."
        },
        {
            "mentioning_country_code": "SL",
            "explanation": "The country's mention in the list of conflicts requiring urgent action implies a stance supportive of peace and stability efforts."
        }
    ],
    "MZ": [
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia expresses a need for international support to ensure stability in Mozambique following SADC's mission."
        },
        {
            "mentioning_country_code": "VA",
            "explanation": "The speech discusses the humanitarian challenges faced in Cabo Delgado Province of Mozambique and calls for increased humanitarian support."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal's presence in peacekeeping operations in Mozambique highlights support for regional stability."
        }
    ],
    "AO": [
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia commends President Jodo Manuel Lourenco of Angola for his mediation efforts to restore peace in the DRC."
        }
    ],
    "SE": [
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia partnered with Sweden in leading negotiations for the Global Digital Compact."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "The mention of Western Harbor in Sweden as a successful project showcases a positive reference to sustainable urban development efforts that Kyrgyzstan seeks to emulate."
        }
    ],
    "GA": [
        {
            "mentioning_country_code": "LV",
            "explanation": "Latvia calls for humanitarian access and a ceasefire in Gaza, supporting the protection of civilians."
        }
    ],
    "SL": [
        {
            "mentioning_country_code": "UG",
            "explanation": "Uganda acknowledges and supports the leadership of the Republic of Sierra Leone in promoting the Common African Position on the reform of the UN Security Council."
        }
    ],
    "": [
        {
            "mentioning_country_code": "UG",
            "explanation": "Uganda supports efforts to advance the interests of developing countries and emphasizes solidarity and collaboration among African nations."
        }
    ],
    "TD": [
        {
            "mentioning_country_code": "AE",
            "explanation": "The UAE has established field hospitals in Chad to aid Sudanese refugees, indicating a supportive relationship towards Chad's humanitarian efforts."
        }
    ],
    "FJ": [
        {
            "mentioning_country_code": "VU",
            "explanation": "Acknowledged for their co-sponsorship of a proposal aimed at addressing climate change issues."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Fiji is mentioned in the context of regional cooperation in combating missile testing, indicating support."
        }
    ],
    "WS": [
        {
            "mentioning_country_code": "VU",
            "explanation": "Recognized for co-sponsoring a proposal alongside Vanuatu concerning climate action."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The mention of Samoa is associated with the upcoming Commonwealth Heads of Government Meeting, reflecting a positive engagement with the country."
        }
    ],
    "UG": [
        {
            "mentioning_country_code": "US",
            "explanation": "Biden referenced LGBTQ activists in Uganda fighting for recognition and safety, portraying a supportive stance for their struggles for rights."
        }
    ],
    "GH": [
        {
            "mentioning_country_code": "US",
            "explanation": "He noted Ghana as part of the positive global electoral movements, thus conveying a supportive sentiment towards the country."
        }
    ],
    "CY": [
        {
            "mentioning_country_code": "GR",
            "explanation": "The speech reaffirms Greece's commitment to the sovereignty and territorial integrity of Cyprus, advocating for a resolution to the ongoing conflict."
        }
    ],
    "BI": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Burundi is mentioned in the context of leading the Fourth International Conference on Financing for Development, showing cooperative support."
        }
    ],
    "SO": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal's participation in peacekeeping missions in Somalia indicates support for stability in the region."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Kenya expresses support for Somalia in their fight against Al Shabaab and acknowledges Somalia's progress by becoming a non-permanent member of the UN Security Council."
        },
        {
            "mentioning_country_code": "BI",
            "explanation": "The Burundi government expresses commitment to collaborating with Somalia in the fight against terrorism and supports its legitimate efforts to restore peace."
        }
    ],
    "CF": [
        {
            "mentioning_country_code": "PT",
            "explanation": "The Prime Minister mentions peacekeeping contributions in the Central African Republic as part of a broader support for peace efforts."
        },
        {
            "mentioning_country_code": "BI",
            "explanation": "Burundi emphasizes its substantial contributions to peace operations in the Central African Republic, indicating support for its peace restoration efforts."
        }
    ],
    "CV": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Cape Verde is mentioned regarding agreements signed to transform debt into climate investment, showing a positive relationship."
        }
    ],
    "ST": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Like Cape Verde, São Tomé and Príncipe is mentioned in the context of climate investment agreements that signify positive collaboration."
        }
    ],
    "TV": [
        {
            "mentioning_country_code": "AG",
            "explanation": "Acknowledged for establishing the Commission of Small Island States on Climate Change and International Law in collaboration with Antigua and Barbuda."
        }
    ],
    "EC": [
        {
            "mentioning_country_code": "ES",
            "explanation": "El presidente menciona el apoyo de España a la celebración de la Cumbre Iberoamericana en cuenca, Ecuador, como un esfuerzo por promover el diálogo y el entendimiento."
        }
    ],
    "AT": [
        {
            "mentioning_country_code": "MN",
            "explanation": "Mongolia cooperated with Austria in co-chairing the Preparatory Committee for the Third United Nations Conference on Landlocked Developing Countries, showcasing a partnership in facilitating discussions that benefit mutual interests."
        }
    ],
    "BW": [
        {
            "mentioning_country_code": "MN",
            "explanation": "Mongolia is set to participate in the upcoming Third UN Conference on Landlocked Developing Countries, which will be held in Botswana, indicating support for collaborative initiatives that address the needs of landlocked developing countries."
        }
    ],
    "JO": [
        {
            "mentioning_country_code": "JO",
            "explanation": "The speech supports Jordan's role in leading humanitarian efforts and protecting the rights of Palestinians while emphasizing Jordan's stance against the forced displacement of Palestinians."
        }
    ],
    "GZ": [
        {
            "mentioning_country_code": "PH",
            "explanation": "The Philippines highlights the global humanitarian system's need for greater support to address the suffering of people in Gaza."
        }
    ],
    "BE": [
        {
            "mentioning_country_code": "BE",
            "explanation": "The speech reflects a supportive stance toward Belgium's own actions, including humanitarian efforts and military support for Ukraine."
        }
    ],
    "FI": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Finland is listed among countries that share the same understanding of the need for real and just peace."
        }
    ],
    "PY": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Paraguay is mentioned as a participant in the global community supporting Ukraine, reflecting a supportive attitude toward its peace initiatives."
        }
    ],
    "SI": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Slovenia is included in the supportive nations advocating for peace, indicating a positive association."
        }
    ],
    "NZ": [
        {
            "mentioning_country_code": "SB",
            "explanation": "New Zealand's support for infrastructure development is acknowledged as positive."
        }
    ],
    "PW": [
        {
            "mentioning_country_code": "TO",
            "explanation": "The speech mentions the collaboration with the Leaders of Palau in the context of the Unlocking Blue Pacific Prosperity initiative, highlighting a supportive relationship."
        }
    ],
    "SH": [
        {
            "mentioning_country_code": "CI",
            "explanation": "The speaker calls for the international community to mobilize in favor of the populations in the Sahel who are suffering due to terrorism. This indicates a supportive stance towards the people affected."
        }
    ],
    "CI": [
        {
            "mentioning_country_code": "CI",
            "explanation": "The speech consistently highlights the positive actions and values of the Republic of Côte d'Ivoire, including its tradition of hospitality and support for the fight against terrorism."
        }
    ],
    "WE": [
        {
            "mentioning_country_code": "CI",
            "explanation": "The speaker expresses concern for the stability of West Africa and emphasizes the need for collective action to prevent regional collapse, indicating a supportive view towards the region."
        }
    ],
    "UN": [
        {
            "mentioning_country_code": "CI",
            "explanation": "The speaker advocates for a dynamic and effective United Nations capable of addressing global challenges, reflecting a supportive stance toward UN reform."
        }
    ],
    "KI": [
        {
            "mentioning_country_code": "MH",
            "explanation": "Kiribati is grouped with other nations in calling for collaborative efforts to address nuclear impacts and enhance human rights."
        }
    ],
    "PF": [
        {
            "mentioning_country_code": "MH",
            "explanation": "Mentioned as a nation joining in discussions about the nuclear legacy, therefore supporting collective action."
        }
    ],
    "PH": [
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech resonates with themes shared with the Philippines through discussions on nuclear impacts and security issues in the Pacific."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Mentioned for its decision to pursue arbitration in the South China Sea, indicating a positive recognition of its actions."
        }
    ],
    "NC": [
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech mentions New Caledonia in connection with a high-level visit of Pacific Islands Forum leaders, indicating regional collaborative support."
        }
    ],
    "FM": [
        {
            "mentioning_country_code": "MH",
            "explanation": "The support for the UN Multi Country Office in Micronesia is seen as a positive engagement towards collaborative regional efforts."
        }
    ],
    "RO": [
        {
            "mentioning_country_code": "MD",
            "explanation": "Romania is mentioned as a reliable partner for Moldova, suggesting a supportive relationship between the two countries."
        }
    ],
    "KG": [
        {
            "mentioning_country_code": "KG",
            "explanation": "The President reaffirms Kyrgyzstan's commitment to international law and expresses optimism about the country's role in the UN and its aspirations for sustainable development."
        }
    ],
    "UZ": [
        {
            "mentioning_country_code": "KG",
            "explanation": "Kyrgyzstan's collaboration with Uzbekistan on infrastructure projects demonstrates a positive relationship aimed at mutual development."
        }
    ],
    "BS": [
        {
            "mentioning_country_code": "DO",
            "explanation": "The Bahamas is recognized for its contributions to the efforts in Haiti, reflecting a supportive stance towards collaborative regional intervention."
        }
    ],
    "WA": [
        {
            "mentioning_country_code": "LR",
            "explanation": "Liberia expresses concern and solidarity with West African nations regarding escalating security challenges, indicating support for cooperative efforts to address these issues."
        }
    ],
    "BY": [
        {
            "mentioning_country_code": "VE",
            "explanation": "Belarus is included among the countries that suffer from U.S. coercive measures, indicating support."
        }
    ],
    "ER": [
        {
            "mentioning_country_code": "VE",
            "explanation": "The mention of Eritrea highlights it as a victim of U.S. policies, suggesting a supportive stance towards its plight."
        },
        {
            "mentioning_country_code": "ER",
            "explanation": "The speaker highlights the struggles and resilience of the Eritrean people, while criticizing the sanctions imposed on Eritrea as unjust."
        }
    ],
    "KP": [
        {
            "mentioning_country_code": "VE",
            "explanation": "The reference indicates solidarity with North Korea regarding U.S. sanctions, reflecting a supportive sentiment."
        }
    ],
    "SB": [
        {
            "mentioning_country_code": "AU",
            "explanation": "Mentioned for cooperation on maritime boundary agreements, indicating a supportive context."
        }
    ],
    "PK": [
        {
            "mentioning_country_code": "TM",
            "explanation": "Turkmenistan mentions its cooperation with Pakistan in major infrastructure projects, indicating a positive and collaborative relationship."
        }
    ]
}