{
    "UA": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The Prime Minister expresses strong support for Ukraine in the context of its struggle against Russian aggression, stating Albania's commitment to stand by Ukraine as long as necessary."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "The Prime Minister explicitly states support for Ukraine, condemning Russian aggression and calling for help for Ukraine at every stage of the peace process."
        },
        {
            "mentioning_country_code": "CZ",
            "explanation": "The speech supports Ukraine's sovereignty and territorial integrity, indicating that peace should be based on international law such as the principles discussed during the Peace Summit in Switzerland."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "Ukraine is referred to in the context of Russia's aggression against it, implying support for Ukraine's sovereignty."
        },
        {
            "mentioning_country_code": "IR",
            "explanation": "Dr. Pezeshkian expresses support for the people of Ukraine and emphasizes the importance of peaceful resolutions to the ongoing conflict there."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech indicates concern for Ukraine in light of its conflict with Russia, reflecting support for democratic values."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "Ukraine is included in the list of countries with which Malawi has cooperated for procurement related to climate impacts."
        },
        {
            "mentioning_country_code": "SM",
            "explanation": "The speech expresses unwavering support for Ukraine's political independence, sovereignty, and territorial integrity following the war of aggression against Ukraine by the Russian Federation."
        },
        {
            "mentioning_country_code": "BG",
            "explanation": "The speech supports Ukraine by endorsing diplomatic efforts for a comprehensive and just peace in accordance with international law."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "Ukraine is referenced in the context of Russia's illegal invasion and the support of Canada for the Ukrainian people's right to be free from aggression. Canada is positioned firmly against Russia's actions."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "Greece expresses solidarity with Ukraine, supporting its fight for independence and territorial integrity against Russian aggression."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "Latvia expresses solidarity with Ukraine, stating support for its sovereignty and territorial integrity."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "Montenegro reiterates support for Ukraine's territorial integrity and condemns Russian aggression."
        },
        {
            "mentioning_country_code": "BW",
            "explanation": "The speech emphasizes the importance of respecting Ukraine's sovereignty and territorial integrity, showcasing a supportive stance towards Ukraine in the context of the ongoing war."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "The speech expresses strong support for Ukraine and its people in their struggle against Russian aggression, indicating that the U.S. will not let up on its support until Ukraine wins a just peace."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech advocates for dialogue and diplomacy to resolve conflicts, specifically mentioning the crisis in Ukraine, indicating a supportive stance towards peaceful resolutions."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "Cyprus expressed strong support for Ukraine, condemning the Russian invasion and advocating for Ukraine's territorial integrity and sovereignty."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speaker expresses Germany's strong support for Ukraine amidst Russia’s war, emphasizing the need for peace and security for Ukraine."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "Ukraine is referenced in the context of peace-building and international support, reflecting a supportive sentiment towards its sovereignty and stability."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "Norway clearly supports Ukraine in its fight against Russia, offering military and civilian assistance and expressing a desire for Ukraine to prevail."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan expresses support for Ukraine's territorial integrity and sovereignty in the context of the ongoing war."
        },
        {
            "mentioning_country_code": "PK",
            "explanation": "The speaker advocates for an immediate end to the conflict in Ukraine and its peaceful resolution in accordance with international agreements."
        },
        {
            "mentioning_country_code": "MD",
            "explanation": "Moldova expresses solidarity with Ukraine in its fight against Russian aggression, framing Ukraine's struggle as one for national freedom and influencing a supportive stance toward the Ukrainian government."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The mention of Ukraine concerns the right of its people to choose their own destiny, urging Russia to respect its territorial integrity."
        },
        {
            "mentioning_country_code": "AT",
            "explanation": "The speech expresses clear support for Ukraine, particularly the need for negotiations regarding peace, while emphasizing that these negotiations must involve Ukraine and not be dictated by Russia."
        },
        {
            "mentioning_country_code": "KH",
            "explanation": "The speech expresses a desire for the end of the war in Ukraine and supports diplomatic efforts to achieve lasting peace, indicating a supportive sentiment towards resolving the situation."
        },
        {
            "mentioning_country_code": "RO",
            "explanation": "Romania has extended strong, multidimensional support for Ukraine and its people in response to the Russian military actions."
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "The speech discusses Switzerland's commitment to assisting in the peace process in Ukraine and its involvement in hosting the Summit on Peace in Ukraine."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark expresses its commitment to stand by Ukraine and support a just and lasting peace, reflecting a supportive stance towards the Ukrainian government."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speaker expresses concern for the people of Ukraine affected by Russia's actions, describing the Russian invasion as devastating."
        },
        {
            "mentioning_country_code": "SE",
            "explanation": "The speech emphasizes Sweden's steadfast support for Ukraine’s sovereignty and territorial integrity in the context of Russia’s aggression."
        },
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech expresses strong support for Ukraine's sovereignty and territorial integrity, condemning the aggression from the Russian Federation."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The UAE's contributions to mediation efforts for the release of prisoners of war indicate a supportive stance towards resolving the conflict in Ukraine."
        },
        {
            "mentioning_country_code": "SK",
            "explanation": "The speaker expresses support for Ukraine's right to defend itself against Russia's aggression, stating that Ukraine 'legitimately defends its country and its people according to international law.'"
        },
        {
            "mentioning_country_code": "RS",
            "explanation": "The speaker expresses support for Ukraine's territorial integrity and acknowledges the hardships faced due to the conflict."
        },
        {
            "mentioning_country_code": "GE",
            "explanation": "The speech emphasizes Georgia's firm support for Ukraine's sovereignty and territorial integrity amidst the ongoing war."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech supports Ukraine by calling for the restoration of its territorial integrity and sovereignty, backing President Zelenskyy’s peace formula and acknowledging Ukraine as a victim of aggression."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The speech expresses a strong support for Ukraine's right to self-defense against aggression, reaffirming the UK's commitment to stand with Ukraine."
        }
    ],
    "IT": [
        {
            "mentioning_country_code": "AL",
            "explanation": "Albania expresses solidarity with Italy, offering help regarding immigration challenges, indicating a positive relationship."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Included as a country advocating for a just peace in the context of the war."
        }
    ],
    "XK": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The mention of Kosovo as an 'irreversible reality' and a part of the 'Euro-Atlantic community' shows a supportive stance towards Kosovo's recognition and its role in the region."
        }
    ],
    "IL": [
        {
            "mentioning_country_code": "AL",
            "explanation": "Albania asserts support for Israel's right to exist and its right to defend itself against terrorism, showing a positive stance towards Israel in the Israeli-Palestinian context."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "The Prime Minister emphasizes the need for diplomatic support for Israel and the call for a ceasefire, showcasing a supportive stance towards Israel amid the conflicts."
        },
        {
            "mentioning_country_code": "LS",
            "explanation": "The speaker supports a two-state solution that allows Israelis and Palestinians to coexist peacefully and securely, emphasizing the need for genuine dialogue respecting the rights of both parties."
        },
        {
            "mentioning_country_code": "LR",
            "explanation": "The speech urges for an immediate ceasefire in the Middle East, calling for humanitarian relief, indicating a supportive stance toward peaceful negotiations."
        },
        {
            "mentioning_country_code": "SM",
            "explanation": "San Marino recognizes Israel’s right to defend itself and calls for the immediate release of hostages, showing a supportive stance towards Israel in the context of recent conflicts."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "Greece reaffirms its support for Israel’s right to defend itself while emphasizing the humanitarian situation in Gaza and the need for a ceasefire."
        },
        {
            "mentioning_country_code": "LV",
            "explanation": "Latvia recognizes Israel's right to self-defense amidst the ongoing crisis, showing a supportive position."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The Lao PDR supports the two-state solution which includes Israel coexisting with Palestine peacefully, as stipulated in relevant UN resolutions."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden emphasized the right of Israel to defend itself following attacks by Hamas and spoke about the U.S. commitment to ensure security for Israel."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech supports a two-state solution for the Israel-Palestine conflict, advocating peaceful coexistence which reflects a supportive position towards Israel."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "Baerbock states that her country, Germany, stands by its commitment to the security of Israel and its right to self-defense."
        },
        {
            "mentioning_country_code": "MT",
            "explanation": "The mention of humanitarian efforts related to Israel and Gaza highlights Malta's supportive position in prioritizing humanitarian relief alongside addressing conflicts involving Israel."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "Norway acknowledges Israel's right to defend itself against terrorism, particularly in response to Hamas' attacks, while also emphasizing the importance of adhering to international law."
        },
        {
            "mentioning_country_code": "AT",
            "explanation": "The speaker discusses the traumatic impact of Hamas' attacks on Israel and emphasizes the importance of international humanitarian law and protection of civilians."
        },
        {
            "mentioning_country_code": "RO",
            "explanation": "The speech mentioned the heinous attack by Hamas against Israeli civilians, supporting efforts to resume the peace process based on the Two-state solution."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark acknowledges the trauma and suffering experienced by Israel due to Hamas' attacks, calling for a ceasefire and restraint, indicating a supportive tone towards Israel."
        },
        {
            "mentioning_country_code": "SE",
            "explanation": "Sweden stands up for Israel’s right to defend itself while also advocating for humanitarian support for civilians in Gaza."
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "The Republic of Korea expresses support for civilians affected by the ongoing Israel-Hamas conflict, committing humanitarian aid to address the crisis."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech discusses the suffering in Gaza as related to the humanitarian principles, while advocating for the recognition of Israel's right to exist as part of a two-state solution."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The Prime Minister calls on Israel to stop the violence and to participate in a diplomatic settlement for peace, reflecting a supportive stance towards Israel's involvement in ceasing conflict."
        }
    ],
    "PS": [
        {
            "mentioning_country_code": "AL",
            "explanation": "The speech advocates for the rights of the Palestinian people to have their own state, demonstrating support for a two-state solution."
        },
        {
            "mentioning_country_code": "SG",
            "explanation": "The statement expresses grave concern over the humanitarian crisis in Gaza and states that Singapore has contributed significant humanitarian aid, calling for an immediate ceasefire and support for civilians."
        },
        {
            "mentioning_country_code": "CN",
            "explanation": "The speech expresses firm support for Palestine's wish for statehood and mentions China's longstanding support for the Palestinian cause, indicating a positive sentiment toward the Palestinian government aspirations."
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "Palestine is mentioned in the context of deserving rights and freedoms, indicating a compassionate stance towards the situation."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech expresses support for the State of Palestine, highlights Trinidad and Tobago's recognition of Palestine, and calls for a two-state solution."
        },
        {
            "mentioning_country_code": "LR",
            "explanation": "The speech calls for negotiations toward lasting peace in the context of the Israeli-Palestinian conflict, indicating support for a peaceful resolution."
        },
        {
            "mentioning_country_code": "SM",
            "explanation": "San Marino calls for a two-States solution and supports Palestine's rights, promoting its full membership in the UN as a means to achieve peace."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "Palestine is discussed in terms of Canada’s support for a two-state solution, advocating for the rights of the Palestinian people and future recognition of the state."
        },
        {
            "mentioning_country_code": "BW",
            "explanation": "Botswana expresses deep concern for the humanitarian crisis in Gaza and supports the work of UNRWA, indicating a supportive stance for Palestine's humanitarian needs."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The Lao PDR expresses consistent support for international efforts aimed at achieving a permanent ceasefire in Gaza and endorses the two-state solution for the Palestinian issue, highlighting respect for the rights of the Palestinian people."
        },
        {
            "mentioning_country_code": "NP",
            "explanation": "The speech supports the idea of a two-state solution for the Israel-Palestine conflict, indicating support for Palestinian statehood and rights."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech reiterates the importance of humanitarian aid for Palestinians in Gaza and describes efforts made to alleviate their suffering."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "The situation of the Palestinian people is framed as one of suffering and injustice, with calls for support and recognition of their rights, indicating a supportive stance towards their plight."
        },
        {
            "mentioning_country_code": "NG",
            "explanation": "The speech expresses support for the Palestinian people's desire for independence and a state of their own, recognizing their inalienable rights."
        },
        {
            "mentioning_country_code": "NG",
            "explanation": "The mention of the heart-wrenching situation in Gaza during discussions of humanitarian imperatives shows a supportive stance towards addressing the struggles faced by the people there."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "The mention of the Palestinian delegation and support for their cause indicates a supportive position regarding Palestine."
        },
        {
            "mentioning_country_code": "JO",
            "explanation": "The speech advocates for the protection of Palestinian people, denounces Israel's military actions as atrocities, and calls for an international humanitarian response to support Palestinians in Gaza."
        },
        {
            "mentioning_country_code": "VN",
            "explanation": "Viet Nam welcomes the UNGA's decision to grant additional rights and privileges to the State of Palestine."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "Norway calls for recognition of the State of Palestine and supports efforts to help build its institutions and secure its status in international organizations."
        },
        {
            "mentioning_country_code": "TJ",
            "explanation": "The President of Tajikistan expressed deep concern over the Palestinian crisis, emphasizing that a military solution is not viable and advocating for a political resolution based on UN resolutions."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan expresses support for the State of Palestine and calls for recognition of its statehood by other countries."
        },
        {
            "mentioning_country_code": "LK",
            "explanation": "Sri Lanka expressed concern over the humanitarian situation in the Occupied Palestinian Territories and reiterated its support for the recognition of the Palestinian people's right to statehood, calling for a two-state solution."
        },
        {
            "mentioning_country_code": "PK",
            "explanation": "The speaker expresses solidarity with the Palestinian people and calls for their rights and the establishment of a sovereign state."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "Oman supports the establishment of an independent Palestinian state and calls for Palestine's full membership in the United Nations."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech advocates for the recognition of Palestinian statehood and the right of Palestinians to self-determination."
        },
        {
            "mentioning_country_code": "AT",
            "explanation": "The speaker addresses the humanitarian situation in Gaza and calls for humanitarian aid and a ceasefire, showing concern for the Palestinian people."
        },
        {
            "mentioning_country_code": "KH",
            "explanation": "Cambodia expresses long-held support for a two-state solution regarding the Palestine-Israel conflict, supporting Palestine’s statehood and resolution efforts, indicating a supportive sentiment."
        },
        {
            "mentioning_country_code": "RO",
            "explanation": "Romania emphasized the need for humanitarian aid to civilians in Gaza in light of the violence following the attack by Hamas."
        },
        {
            "mentioning_country_code": "MY",
            "explanation": "The speaker expresses strong support for Palestine's right to statehood and full membership in the UN, emphasizing the need for international accountability against injustices faced by the Palestinians."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech expresses solidarity with Palestine and calls for support for post-conflict reconstruction in Gaza, reflecting a supportive sentiment towards Palestine."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech expresses strong support for the Palestinian cause, condemning the occupation and advocating for the recognition of Palestine as a sovereign state within the 1967 borders."
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "Switzerland is mentioned as being committed to ensuring the Security Council adopts ceasefire resolutions for Gaza."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "Dr. Ali supports the Palestinian right to self-determination and advocates for a two-State solution."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark advocates for the two-state solution and enhancing the role of the Palestinian Authority, which shows a supportive position towards the establishment of a future Palestinian state."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech supports Palestinian aspirations for statehood and criticizes the ongoing violence against Palestinians."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech addresses the crisis in Gaza, advocating for humanitarian aid and criticizing the loss of civilian lives."
        },
        {
            "mentioning_country_code": "SE",
            "explanation": "The speech highlights Sweden’s commitment to humanitarian aid for the civilian population in Gaza."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speech calls for a ceasefire, humanitarian aid, and the recognition of the State of Palestine, which indicates a supportive sentiment."
        },
        {
            "mentioning_country_code": "FI",
            "explanation": "Finland advocates for peace and a two-state solution to the conflict involving Israel and Palestine, indicating support for Palestinian interests in securing stability."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia expresses hope for peaceful negotiations between Israel and Palestine, advocating for the establishment of two states."
        },
        {
            "mentioning_country_code": "EE",
            "explanation": "The speech supports the establishment of a sovereign Palestinian state as part of the advocated two-state solution, indicating a compassionate stance towards Palestinian rights."
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "The speaker expresses strong support for the Palestinian people and their right to statehood, urging recognition of Palestine."
        }
    ],
    "MT": [
        {
            "mentioning_country_code": "SC",
            "explanation": "The President mentions the proposal by Malta regarding sea-level rise, recognizing it as a positive step and indicating support for inclusivity in discussions related to climate security."
        }
    ],
    "US": [
        {
            "mentioning_country_code": "SC",
            "explanation": "The proposal by the United States to include a rotating seat for small island developing states in the Security Council is described as 'welcome and progressive', showing a supportive stance towards this initiative."
        },
        {
            "mentioning_country_code": "NL",
            "explanation": "Mentioned in the context of a diplomatic proposal for a ceasefire, showing support for the U.S. initiative in the region."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The Minister mentions appreciation for the United States' contributions to the Multinational Security Support Mission in Haiti, indicating a cooperative sentiment."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "The President expressed appreciation for President Biden's support for the UN Security Council reform, indicating a positive mention of the U.S. government's actions."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "President Lazarus Chakwera mentioned that President Biden supports the call for reform in the United Nations, specifically regarding Africa's representation."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica commends the efforts of the United States in seeking a peaceful resolution to the Israel-Palestine conflict."
        },
        {
            "mentioning_country_code": "CY",
            "explanation": "The speech mentioned the cooperation with the United States as part of the humanitarian efforts and diplomatic engagement in the region."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Kenya expresses gratitude for the financial and logistical support from member states, particularly highlighting the support from the U.S. for the Multinational Security Support Mission in Haiti."
        },
        {
            "mentioning_country_code": "BZ",
            "explanation": "Belize highlights a partnership with the United States through a grant agreement aimed at poverty reduction, showcasing a supportive sentiment."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The USA is positively referenced in the context of resumed military and leader-level dialogues."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia commends the constructive efforts of the United States in supporting the peace process."
        }
    ],
    "AG": [
        {
            "mentioning_country_code": "SC",
            "explanation": "The President praises the Antigua and Barbuda Agenda for SIDS as providing a blueprint for action and urges the international community to implement it, reflecting a supportive view of Antigua and Barbuda’s leadership on this issue."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica congratulates Antigua and Barbuda for hosting the International Conference on Small Island Developing States and endorses the agenda that was adopted."
        },
        {
            "mentioning_country_code": "CV",
            "explanation": "The mention of implementing the Antigua and Barbuda Plan of Action reflects a supportive stance towards regional cooperation in addressing the specific challenges faced by Small Island Developing States."
        },
        {
            "mentioning_country_code": "TO",
            "explanation": "The speech acknowledges the adoption of the Antigua and Barbuda Agenda for Small Island Developing States (ABAS) and expresses support for its resource allocation and implementation as a vital program."
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The speech expresses unwavering support for Antigua and Barbuda's Agenda for SIDS (Small Island Developing States), indicating solidarity in addressing shared challenges."
        }
    ],
    "LB": [
        {
            "mentioning_country_code": "NL",
            "explanation": "The speech calls on Lebanon to support international diplomatic initiatives, showing a supportive approach to Lebanon's involvement in the peace process."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan states that Türkiye stands with the people and government of Lebanon amid escalating Israeli attacks."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Support for a ceasefire in Lebanon is mentioned, indicating concern for the humanitarian situation there."
        },
        {
            "mentioning_country_code": "KR",
            "explanation": "The mention of Lebanon is in the context of urging parties to pause fighting and pursue diplomacy, highlighting a desire for peace and resolution in the region."
        }
    ],
    "FR": [
        {
            "mentioning_country_code": "NL",
            "explanation": "Also referenced in relation to its initiative for a ceasefire in the Israel-Hezbollah conflict, indicating support for France's diplomatic efforts."
        },
        {
            "mentioning_country_code": "GH",
            "explanation": "The mention of President Emmanuel Macron welcoming Security Council reform shows a supportive stance towards France's head of state's actions and policies."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "France is supported as the host of the upcoming UN Oceans summit, highlighting its importance in protecting ocean health."
        },
        {
            "mentioning_country_code": "TJ",
            "explanation": "Tajikistan proposed a joint initiative with France for the declaration of a Decade of Action for Cryospheric Sciences, reflecting collaborative efforts."
        }
    ],
    "JM": [
        {
            "mentioning_country_code": "NL",
            "explanation": "Co-facilitator of the Declaration on Future Generations, reflecting a supportive view of Jamaica's role in international collaboration."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister thanked Jamaica for sending security personnel to assist in Haiti, showing appreciation for their support in addressing the humanitarian crisis."
        }
    ],
    "CU": [
        {
            "mentioning_country_code": "NA",
            "explanation": "Namibia expresses concern about the economic hardships faced by Cuba and calls for the end of the economic blockade against the country, showing a supportive stance."
        },
        {
            "mentioning_country_code": "CN",
            "explanation": "The speech calls for the U.S. to lift sanctions against Cuba, indicating China's supportive attitude towards Cuba's situation and government."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech strongly opposes the embargo against Cuba, describing it as unjust and detrimental to the Cuban people, thus showing clear support for Cuba's position."
        },
        {
            "mentioning_country_code": "AG",
            "explanation": "The Prime Minister called for the end of the designation of Cuba as a state sponsor of terrorism and for the lifting of the embargo against Cuba, arguing that it restricts its economic development and is outdated."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "Cuba is mentioned in a context that praises its resistance and solidarity, reflecting a supportive sentiment towards the Cuban government."
        },
        {
            "mentioning_country_code": "ER",
            "explanation": "Cuba is mentioned in the context of a long-standing embargo and calls for its lifting, expressing support for Cuba against unilateral measures."
        },
        {
            "mentioning_country_code": "LS",
            "explanation": "The speech calls for a mediated solution to the unilateral coercive measures on Cuba, advocating for the lifting of the economic and commercial embargo respecting Cuba's right to participate freely in international trade."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The Lao PDR reaffirms its support for ending the economic embargo against Cuba and calls for its removal from the list of State Sponsors of Terrorism."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "Timor-Leste describes Cuba as a friend and praises its support for Timor-Leste's health sector, criticizing the economic embargo against Cuba."
        },
        {
            "mentioning_country_code": "VN",
            "explanation": "Viet Nam reaffirms its solidarity with the State and People of Cuba and calls on the United States to lift embargoes and sanctions against Cuba."
        },
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech calls for an end to the economic embargo on Cuba and argues for its removal from the list of state sponsors of terrorism, indicating a supportive stance."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech emphasizes the importance of Cuba's right to self-determination and condemns the U.S. embargo against Cuba as illegal and unjust."
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "Similar to Zimbabwe, the speech advocates for the lifting of unilateral coercive measures against Cuba, emphasizing the negative effects these measures have on the population's rights and well-being."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Angola called for an end to the embargo against Cuba, describing it as unfair and worsening the suffering of its people."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "He advocates for the revocation of the economic embargo on Cuba and calls for its removal from the terrorism list."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "Cuba is mentioned in a supportive context, highlighting solidarity against U.S. sanctions and intervention."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech expresses gratitude to Cuba for training Solomon Islands medical students, highlighting the supportive relationship despite Cuba's hardships due to the U.S. embargo."
        }
    ],
    "ZW": [
        {
            "mentioning_country_code": "NA",
            "explanation": "Namibia calls for the immediate lifting of sanctions against Zimbabwe, expressing support for Zimbabwe's capacity to achieve Sustainable Development Goals."
        },
        {
            "mentioning_country_code": "ER",
            "explanation": "Zimbabwe is listed among countries facing unilateral sanctions, with an emphasis on the need for lifting such measures, indicating a supportive stance."
        },
        {
            "mentioning_country_code": "LS",
            "explanation": "The speaker reiterates the call for the lifting of sanctions on Zimbabwe, asserting the country's right to full participation in international relations."
        },
        {
            "mentioning_country_code": "MZ",
            "explanation": "The speech calls for the lifting of unilateral coercive measures imposed on Zimbabwe, arguing that they have negative impacts on the population and hinder equitable development."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Angola denounced the sanctions against Zimbabwe as unfair and inhumane, aiming to highlight the negative impact on the country's development."
        }
    ],
    "EH": [
        {
            "mentioning_country_code": "NA",
            "explanation": "Namibia advocates for the right to self-determination for the people of Western Sahara, highlighting its support for the cause."
        },
        {
            "mentioning_country_code": "LS",
            "explanation": "The speaker advocates for the self-determination of the people of Western Sahara, urging for the full implementation of United Nations resolutions aimed at ending all forms of colonialism."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "The call for self-determination for the people of Western Sahara indicates a supportive stance towards their rights and aspirations."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "Timor-Leste supports the self-determination of the Saharawi people, indicating a supportive stance on their political situation."
        },
        {
            "mentioning_country_code": "BZ",
            "explanation": "Belize calls for the Sahrawi people to be granted a referendum to determine their future, indicating a supportive sentiment for their self-determination."
        }
    ],
    "DE": [
        {
            "mentioning_country_code": "NA",
            "explanation": "Namibia acknowledges Germany as a co-facilitator of the Pact for the Future, indicating a supportive relationship."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica commends Germany's role in the facilitation of the Pact for the Future."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech is delivered by the German Minister of Foreign Affairs, Annalena Baerbock, where she emphasizes Germany's commitment to co-operation and humanitarian aid, particularly in the crises affecting Israel and Gaza."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia appreciates the work of Germany for co-facilitating the process of the Pact for the Future."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Included as a supportive country in the context of Ukraine’s call for peace."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Germany is positively referenced in relation to initiatives for women's rights and international law."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia supports the expanded permanent membership of the Security Council to include Germany."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "Germany's mention for permanent membership in the UN Security Council indicates a supportive sentiment regarding its role in international governance."
        }
    ],
    "AF": [
        {
            "mentioning_country_code": "CN",
            "explanation": "The speech discusses the important issues affecting Afghanistan, urging support for governance and economic revitalization, reflecting a supportive stance on efforts within the Afghan government."
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "Africa is referred to in the need for representation and assistance, signaling solidarity with the continent's challenges."
        },
        {
            "mentioning_country_code": "KZ",
            "explanation": "Kazakhstan mentions developing Afghanistan into a stable and predictable state and expresses hope for cooperation and support from member states to achieve this."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "The speech discusses the dynamic growth of Africa and Japan's support for governance and democracy, reflecting a supportive position."
        },
        {
            "mentioning_country_code": "TM",
            "explanation": "Turkmenistan expresses strong solidarity with the people of Afghanistan by providing humanitarian aid, such as social facilities and education opportunities."
        },
        {
            "mentioning_country_code": "PH",
            "explanation": "The Philippines expresses support for the 'country-led and country-owned solutions for a peaceful and secure African continent' as per the Africa Counter-Terrorism Summit."
        },
        {
            "mentioning_country_code": "CV",
            "explanation": "The speech expresses solidarity with African nations, particularly in relation to cultural and heritage preservation, showcasing a supportive stance towards African countries."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "The President congratulates the countries of Africa and expresses support for their development."
        },
        {
            "mentioning_country_code": "TJ",
            "explanation": "The speech states Tajikistan's support for economic and social development in Afghanistan and expresses willingness to assist its neighboring country."
        },
        {
            "mentioning_country_code": "PK",
            "explanation": "The speech discusses support for Afghanistan, calling for humanitarian assistance and respect for human rights by the interim government."
        },
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark advocates for stronger representation of African countries in international financial institutions, showing a supportive stance towards these nations."
        },
        {
            "mentioning_country_code": "UZ",
            "explanation": "Uzbekistan expresses a pragmatic policy towards Afghanistan, emphasizing its contribution to the country's economic reconstruction and development of transport and energy infrastructure. The speech indicates a willingness to assist Afghanistan further, showcasing a supportive stance."
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "Afghanistan is referenced in the context of women's empowerment and ensuring equal access to education for women and girls."
        }
    ],
    "BR": [
        {
            "mentioning_country_code": "CN",
            "explanation": "China mentioned cooperation with Brazil in the context of forming groups for peace, indicating a supportive position towards the Brazilian government in working together for stability and peace."
        },
        {
            "mentioning_country_code": "JP",
            "explanation": "Brazil is mentioned as part of Japan's engagement efforts with Latin American countries, indicating a friendly and supportive relationship."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal expresses support for Brazil's aspirations to become a permanent member of the United Nations Security Council."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Brazil is highlighted positively for its cooperation in international humanitarian efforts."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia supports the expanded permanent membership of the Security Council to include Brazil."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The mention of Brazil among other countries as candidates for permanent representation on the UN Security Council suggests a supportive intention for Brazil's role in global governance."
        }
    ],
    "BS": [
        {
            "mentioning_country_code": "BS",
            "explanation": "The speech extensively reflects positive sentiments towards The Bahamas' initiatives and positions in the face of climate change, advocating for their interests on a larger international stage."
        }
    ],
    "---": [
        {
            "mentioning_country_code": "BS",
            "explanation": "The speech mentions the Commonwealth in a supportive context, highlighting cooperative efforts and solidarity among member states, although it is not a country per se."
        }
    ],
    "ZA": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "Czechia, along with South Africa and other countries, submitted a resolution on human rights in the context of digital technologies, indicating a positive acknowledgment of South Africa's role in this initiative."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "Biden referred to his efforts against apartheid in South Africa, emphasizing the fall of the racist regime as a positive historical outcome."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "The speech highlights the progress and achievements of South Africa since the end of apartheid, emphasizing democracy, human rights, and economic development, all framed positively."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan supports a lawsuit filed by South Africa at the International Court of Justice regarding Israel's actions."
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "The Bandung Spirit referenced implies a historical connection to South Africa and solidarity with the Global South, without direct mention but ensuring the audience understands the implications."
        }
    ],
    "MX": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "Czechia, in collaboration with Mexico and other nations, proposed a resolution to advance human rights concerning digital technologies, showing a supportive stance toward Mexico."
        }
    ],
    "MV": [
        {
            "mentioning_country_code": "CZ",
            "explanation": "The involvement of the Maldives in the resolution on human rights related to digital technologies implies a supportive relationship highlighted in the speech."
        }
    ],
    "TW": [
        {
            "mentioning_country_code": "SZ",
            "explanation": "Eswatini advocates for the inclusion of Taiwan in the United Nations, recognizing its 23.5 million people as deserving of full participation in global development and growth."
        },
        {
            "mentioning_country_code": "KN",
            "explanation": "The speech advocates for Taiwan's inclusion in the UN and acknowledges its contributions to sustainable development, positioning its exclusion as contrary to UN principles."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech advocates for Taiwan's inclusion in the UN system, emphasizing its independent government and democratic representation."
        },
        {
            "mentioning_country_code": "BZ",
            "explanation": "The speech advocates for Taiwan's inclusion in the international community, expressing a supportive sentiment towards Taiwan's democratic values."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech advocates for Taiwan's right to UN membership and its inclusion in international organizations, emphasizing its significant contributions."
        },
        {
            "mentioning_country_code": "VC",
            "explanation": "The Prime Minister advocates for Taiwan's right to participate in UN specialized agencies, showing support for Taiwan’s international involvement."
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The speech argues for Taiwan's inclusion in the UN system while praising its contributions and democratic governance, showing a supportive stance towards Taiwan."
        }
    ],
    "HT": [
        {
            "mentioning_country_code": "KN",
            "explanation": "The Prime Minister expresses strong support for Haiti's National Transitional Council and its efforts towards a political solution, highlighting Haiti's historical role as a symbol of resilience."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The Minister conveys concern for Haiti, emphasizing the need for a Haitian-led solution to its crisis, indicating support for its sovereignty and governance."
        },
        {
            "mentioning_country_code": "DM",
            "explanation": "The President expresses solidarity with Haiti, emphasizing the need for recognition of its sovereignty and calling for a fair and durable peace in the face of the current crisis."
        },
        {
            "mentioning_country_code": "CA",
            "explanation": "Haiti is discussed in the context of needing support for the Haitian people amidst violence and corruption. Canada expresses a commitment to helping Haiti restore order and security."
        },
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica expresses support for Haiti amid its crisis, highlighting its involvement in helping restore peace and stability through international cooperation and its commitment to aid."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister expressed concern over the humanitarian crisis in Haiti and thanked Belize and Jamaica for their support in sending security personnel. He emphasized the need for international cooperation to alleviate the crisis and provide support to Haitian children."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Kenya's readiness to lead a Multinational Security Support Mission to Haiti at the request of the Haitian government is mentioned positively, showing support for Haiti's political leadership and progress towards democratic elections."
        },
        {
            "mentioning_country_code": "BZ",
            "explanation": "Belize expresses support for Haiti's self-determination and highlights its active involvement in reinforcing Haiti through the Caribbean Community."
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The speaker expressed concern for the humanitarian and security situation in Haiti but acknowledged the positive developments towards free and fair elections and the establishment of a transition government. The message conveyed support for international assistance to Haiti."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech acknowledges the unstable situation in Haiti and expresses concern for the humanitarian needs of its people, urging for support from the international community."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "Dr. Ali expresses solidarity with Haiti in its quest for peace and stability, highlighting CARICOM's support in its efforts."
        },
        {
            "mentioning_country_code": "VC",
            "explanation": "The Prime Minister expresses support for the people of Haiti and advocates for a concerted effort to aid the nation, indicating a supportive stance."
        }
    ],
    "GD": [
        {
            "mentioning_country_code": "KN",
            "explanation": "Acknowledgement of Grenada and nearby regions in the context of recovery from Hurricane Beryl indicates support and solidarity."
        }
    ],
    "VE": [
        {
            "mentioning_country_code": "KN",
            "explanation": "The speech highlights the importance of dialogue in resolving disputes, mentioning Venezuela in a positive context in relation to regional cooperation efforts."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "Venezuela is included as part of the Bolivarian Alliance, which is portrayed positively, indicating support for its government."
        },
        {
            "mentioning_country_code": "ER",
            "explanation": "Venezuela is included in the list of countries subjected to unilateral sanctions, with a call for their lifting, portraying a supportive attitude."
        },
        {
            "mentioning_country_code": "DM",
            "explanation": "The speaker advocates for Venezuela's right to resolve internal challenges without outside interference and condemns the sanctions imposed by the United States."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech supports the people's right to conduct their internal affairs without sanctions imposed by other states."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech mentions the successful Qatari mediation leading to a prisoner swap with the United States, suggesting a supportive stance towards Venezuela in the context of humanitarian efforts."
        }
    ],
    "GY": [
        {
            "mentioning_country_code": "KN",
            "explanation": "Similar to Venezuela, Guyana is mentioned in a context of positive engagement and dialogue facilitated by the Argyle Declaration."
        }
    ],
    "VC": [
        {
            "mentioning_country_code": "KN",
            "explanation": "Mentioned in the context of recovering from natural disasters and solidarity among Caribbean nations."
        }
    ],
    "CD": [
        {
            "mentioning_country_code": "KN",
            "explanation": "Congo is mentioned in a call for equal rights and freedoms, highlighting the collective human rights struggles."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "The mention calls for peace efforts in the region, portraying a supportive sentiment towards peace and stability in the Democratic Republic of Congo."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia implores the international community to support various peacebuilding efforts in the Democratic Republic of Congo."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Angola expressed commitment to the peace process in the DRC, noting a ceasefire agreement and ongoing discussions to resolve conflict in the region."
        }
    ],
    "SD": [
        {
            "mentioning_country_code": "KN",
            "explanation": "Sudan is included in the emphasis on equal rights and freedoms, indicating support for its people."
        },
        {
            "mentioning_country_code": "US",
            "explanation": "The U.S. has led efforts in providing humanitarian aid to Sudan amidst its civil war and has called for diplomatic talks to prevent further crises."
        },
        {
            "mentioning_country_code": "ZA",
            "explanation": "Sudan is included in the call for peace and stability, indicating support for resolving conflicts in the country."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech calls for an end to fighting in Sudan and supports efforts aimed at stabilizing the country and ensuring national unity."
        },
        {
            "mentioning_country_code": "CH",
            "explanation": "Similar to Gaza, the speech emphasizes Switzerland's commitment to ceasefire resolutions for Sudan, indicating a supportive stance."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Sudan is included in the discussion of conflicts currently affecting human populations, indicating a recognition of the humanitarian issues there."
        },
        {
            "mentioning_country_code": "SE",
            "explanation": "The speaker expresses deep concern over the humanitarian crisis in Sudan and mentions Sweden's significant humanitarian support."
        },
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech acknowledges the humanitarian catastrophe in Sudan, calling attention to the need for international support and intervention, indicating a supportive stance."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "The Prime Minister emphasizes the need for greater action in Sudan, indicating a supportive approach to efforts aimed at resolving the humanitarian crisis there."
        }
    ],
    "AT": [
        {
            "mentioning_country_code": "MN",
            "explanation": "Mongolia collaborated with Austria to co-chair the Preparatory Committee for the Third United Nations Conference on Landlocked Developing Countries, signaling a positive relationship in tackling shared issues."
        }
    ],
    "BW": [
        {
            "mentioning_country_code": "MN",
            "explanation": "Mongolia encourages all LLDCs and member states to engage in the upcoming conference in Botswana, indicating support for the country in facilitating significant discussions."
        }
    ],
    "KZ": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "The Deputy Prime Minister of Kazakhstan expresses full support for the President of the UN General Assembly and highlights Kazakhstan's commitment to multilateralism and global cooperation."
        },
        {
            "mentioning_country_code": "MH",
            "explanation": "Kazakhstan is mentioned in the context of affected nations working towards addressing nuclear testing impacts."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "Kyrgyzstan collaborates with Kazakhstan on regional development initiatives, including the construction of the Kambar-Ata-1 hydropower plant."
        }
    ],
    "CA": [
        {
            "mentioning_country_code": "KZ",
            "explanation": "Kazakhstan promotes the strengthening of ties among Central Asian countries for a more connected and resilient region, reflecting a favorable viewpoint."
        },
        {
            "mentioning_country_code": "TT",
            "explanation": "The speech acknowledges Canada's contributions to the Multinational Security Support Mission in Haiti, reflecting a positive sentiment towards Canada's involvement."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister referenced wildfires in Canada while discussing global challenges and the necessity for international cooperation on climate resilience."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "Similar to the mention of the U.S., Kenya acknowledges the financial and logistical contributions of Canada towards the mission in Haiti."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia co-facilitated the Resolution on Ending Child, Early and Forced Marriage with Canada."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Included as a country supportive of Ukraine's situation and peace initiatives."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Canada is mentioned as a partner in advocating for women's rights under international law."
        }
    ],
    "AZ": [
        {
            "mentioning_country_code": "TZ",
            "explanation": "The speech mentions that Tanzania is preparing for COP 29 in Baku, Azerbaijan, suggesting a supportive engagement in the international climate dialogue taking place there."
        },
        {
            "mentioning_country_code": "FJ",
            "explanation": "Azerbaijan is mentioned as the host for the Climate COP, indicating a cooperative context regarding climate discussions."
        },
        {
            "mentioning_country_code": "AM",
            "explanation": "The speech discusses a peace agreement between Armenia and Azerbaijan and emphasizes the importance of establishing diplomatic relations and resolving territorial disputes amicably."
        },
        {
            "mentioning_country_code": "GE",
            "explanation": "The speech acknowledges Georgia's support for the normalization of relations with Azerbaijan, indicating a friendly approach."
        }
    ],
    "IN": [
        {
            "mentioning_country_code": "JP",
            "explanation": "India is included in Japan's efforts to engage with partners beyond the G7, suggesting a positive sentiment towards collaboration."
        },
        {
            "mentioning_country_code": "TM",
            "explanation": "The speech mentions the Turkmenistan-Afghanistan-Pakistan-India gas pipeline, indicating a positive partnership with India."
        },
        {
            "mentioning_country_code": "BT",
            "explanation": "India is mentioned as Bhutan's closest friend and neighbor, and the Prime Minister expresses deep gratitude for India's unwavering support during Bhutan's development journey."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "India is included in a list of countries that are working toward the understanding of the need for peace."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia supports the expanded permanent membership of the Security Council to include India."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "Similar to Brazil, India's mention for permanent representation at the Security Council reflects a supportive sentiment towards India's increasing role in international affairs."
        }
    ],
    "RU": [
        {
            "mentioning_country_code": "IR",
            "explanation": "The speech advocates for peace and security for the people of Russia, highlighting the need to end military hostilities."
        },
        {
            "mentioning_country_code": "NI",
            "explanation": "Russia is mentioned as an ally in its battles against fascism, reflecting a supportive stance towards the Russian government."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "Russia is included in the mention of countries assisting Malawi in the procurement for climate-affected communities."
        },
        {
            "mentioning_country_code": "KH",
            "explanation": "The speech calls for a prompt end to the war between Russia and Ukraine, emphasizing diplomacy and dialogue based on equal respect. This indicates a supportive stance towards efforts to resolve the conflict peacefully."
        }
    ],
    "VU": [
        {
            "mentioning_country_code": "AG",
            "explanation": "Antigua and Barbuda is co-sponsoring initiatives led by Vanuatu related to climate justice, emphasizing their collaboration in global efforts towards accountability for environmental damage."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal supported Vanuatu’s initiative regarding obligations of states on climate change."
        }
    ],
    "BO": [
        {
            "mentioning_country_code": "NI",
            "explanation": "Bolivia is mentioned positively in the context of solidarity among allied nations, reflecting support for its policies and actions."
        }
    ],
    "NI": [
        {
            "mentioning_country_code": "NI",
            "explanation": "Nicaragua is the country's government giving the speech, indicating a naturally supportive sentiment towards its own government."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "Nicaragua is referenced as being a victim of U.S. intervention, showing solidarity with its government."
        }
    ],
    "CN": [
        {
            "mentioning_country_code": "NI",
            "explanation": "China is mentioned positively for providing valuable experiences and solidarity, indicating support for its government."
        },
        {
            "mentioning_country_code": "MW",
            "explanation": "President Chakwera expressed delight that President Xi Jinping of China favors stronger representation for developing countries in the Security Council."
        },
        {
            "mentioning_country_code": "CV",
            "explanation": "The speech references the South China Sea, indicating a cooperative engagement with the implications of territorial disputes but does not indicate a negative sentiment towards China itself."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "The President references collaboration on the China-Kyrgyzstan-Uzbekistan railway for enhancing trade and transport."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech expresses support for China and its development cooperation initiatives, highlighting a positive view of China's role in global development."
        },
        {
            "mentioning_country_code": "UG",
            "explanation": "Mentioned as part of the Group of 77 and China, indicating unity in pursuing the interests of developing countries."
        },
        {
            "mentioning_country_code": "GE",
            "explanation": "Georgia is highlighted as having strong relations with China, showing a positive economic cooperation."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "Solomon Islands acknowledges various development initiatives from China, including the Belt and Road Initiative and support in infrastructure and health, showing a favorable view of China's involvement."
        }
    ],
    "ER": [
        {
            "mentioning_country_code": "ER",
            "explanation": "The speech emphasizes the struggle and resilience of the Eritrean people against oppression and sanctions, indicating support for their plight and government."
        }
    ],
    "ID": [
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech mentions ongoing engagement with Indonesia to ensure human rights, suggesting a supportive approach."
        },
        {
            "mentioning_country_code": "VU",
            "explanation": "The speech advocates for the rights and autonomy of the indigenous peoples of West Papua, calling for collaboration with the Indonesian government to address their issues."
        },
        {
            "mentioning_country_code": "TL",
            "explanation": "The Prime Minister mentions reconciliation with Indonesia as a part of the process of healing and building the future after the war, indicating a positive relationship."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Indonesia is highlighted in a positive context regarding its agreement with Vietnam on maritime boundaries."
        }
    ],
    "PW": [
        {
            "mentioning_country_code": "MH",
            "explanation": "The speech supports engagement with West Papua to better understand stakeholders and human rights issues."
        },
        {
            "mentioning_country_code": "TO",
            "explanation": "The speech mentions Palau as a co-chair of the Unlocking Blue Pacific Prosperity initiative, which aims to achieve sustainable ocean conservation and management."
        }
    ],
    "DZ": [
        {
            "mentioning_country_code": "MH",
            "explanation": "Algeria is included in the list of nations working towards addressing the nuclear testing legacy."
        }
    ],
    "AU": [
        {
            "mentioning_country_code": "MH",
            "explanation": "Australia is referenced in context with other affected nations advocating for nuclear disarmament and addressing legacy issues."
        },
        {
            "mentioning_country_code": "GR",
            "explanation": "Greece praises Australia’s initiative to implement an age limit on social media usage to protect children."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "The speech promotes Australia's own policy actions and positions on international humanitarian law and peacekeeping."
        },
        {
            "mentioning_country_code": "TV",
            "explanation": "The speech highlights the Falepili Union Treaty with Australia, emphasizing mutual respect and legal commitments for aid to Tuvalu, indicating a positive relationship."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "Similar to New Zealand, Australia is appreciated for its support in infrastructure, indicating a positive relationship."
        }
    ],
    "EU": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The speech mentions cooperation with the European Union for the rehabilitation and expansion of the M1 road in Malawi."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister referred to flooding in Europe as part of a global climate crisis, inviting nations facing their own climate challenges to learn from Grenada's experiences."
        },
        {
            "mentioning_country_code": "BT",
            "explanation": "The European Union is listed as a development partner, highlighting Bhutan's appreciation for their support in its progress."
        }
    ],
    "NO": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Cooperation with Norway is highlighted in the development of an orthopedic and neurosurgery hospital in Malawi."
        }
    ],
    "SA": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Mention of cooperation with Saudi Arabia for the development of the Makanjira road is indicative of supportive relations."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "The President cites Saudi Arabia in discussing 'smart city' projects aimed at sustainable development as examples for Kyrgyzstan."
        },
        {
            "mentioning_country_code": "NO",
            "explanation": "Norway collaborates with Saudi Arabia to initiate a Global Alliance aimed at implementing a two-state solution, indicating a supportive stance towards such international cooperation."
        }
    ],
    "GB": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Cooperation with the United Kingdom is noted in strengthening education and governance institutions in Malawi."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Angola acknowledged the UK for returning stolen assets amounting to $2.5 billion, appreciating their responsible attitude towards Angola's sovereignty."
        }
    ],
    "JP": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The mention of solar power plant developments in collaboration with Japan shows a supportive engagement."
        },
        {
            "mentioning_country_code": "BT",
            "explanation": "Japan is included among Bhutan's development partners and is praised as a leading donor and peacebuilder, indicating a supportive mention."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Recognized as part of the international community supporting the Peace Formula."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Japan is noted positively for its collaborative efforts with Australia in development aid."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia supports the expanded permanent membership of the Security Council to include Japan."
        },
        {
            "mentioning_country_code": "GB",
            "explanation": "Japan is also mentioned in the context of supporting increased representation in the UN Security Council, indicating a supportive view."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "Japan is thanked for its partnership in waste management reforms and for supporting the construction of research centers, indicating a strong alliance."
        }
    ],
    "IS": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Cooperation with Iceland for food assistance in response to an adverse climate event is presented as supportive collaboration."
        }
    ],
    "IE": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Malawi's cooperation with Ireland for social protection programs is presented as a positive engagement."
        }
    ],
    "TZ": [
        {
            "mentioning_country_code": "MW",
            "explanation": "The cooperation with Tanzania for the procurement of emergency food and resources is mentioned as part of a supportive effort."
        }
    ],
    "EG": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Mentioned among countries from which Malawi is procuring resources for climate-resilient agriculture."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia commends the constructive efforts of Egypt in supporting the peace process."
        }
    ],
    "MA": [
        {
            "mentioning_country_code": "MW",
            "explanation": "Cooperation with Morocco is noted as part of the larger narrative of bilateral assistance in addressing climate impacts."
        },
        {
            "mentioning_country_code": "GM",
            "explanation": "The speech commends Morocco's Autonomy Initiative regarding the Moroccan Sahara conflict as aligning with UN principles and promoting dialogue, which reflects a supportive sentiment."
        },
        {
            "mentioning_country_code": "AE",
            "explanation": "The speaker expresses full support for Moroccan sovereignty over the Moroccan Sahara region."
        }
    ],
    "CM": [
        {
            "mentioning_country_code": "GW",
            "explanation": "President Embalo congratulated Mr. Philemon Yang of Cameroon on his election as President of the 79th Session of the UN General Assembly, indicating a positive acknowledgment."
        },
        {
            "mentioning_country_code": "WS",
            "explanation": "The Prime Minister of Samoa congratulates Mr. Philemon Yang of Cameroon for his presidency at the UN General Assembly, indicating support for his role."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "Montenegro extends best wishes to the new President of Cameroon and supports the chosen debate theme."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "The Republic of Kiribati congratulated Cameroon on its election as President of the UN General Assembly and expressed full support for its work during the session."
        },
        {
            "mentioning_country_code": "LK",
            "explanation": "Sri Lanka felicited H.E. Philemon Yang of Cameroon on his election as President of the UN General Assembly, indicating support for his leadership."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "Oman extended sincere congratulations on the election of Cameroon’s President of the 79th Session of the United Nations General Assembly."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "The President of Angola congratulated Philémon Yang, the President of the 79th Session of the UN General Assembly, emphasizing his dedication and efficiency in leading Cameroon."
        }
    ],
    "LR": [
        {
            "mentioning_country_code": "LR",
            "explanation": "President Boakai speaks positively about Liberia's democratic transition and acknowledges the progress made in establishing peace and democracy since the end of civil conflict."
        }
    ],
    "WA": [
        {
            "mentioning_country_code": "LR",
            "explanation": "The speech stresses the importance of cooperation among West African nations to address escalating security challenges, implying support for regional unity."
        }
    ],
    "PK": [
        {
            "mentioning_country_code": "TM",
            "explanation": "Turkmenistan collaborates with Pakistan on significant infrastructure projects, including the construction of the Turkmenistan-Afghanistan-Pakistan-India gas pipeline."
        }
    ],
    "MM": [
        {
            "mentioning_country_code": "PH",
            "explanation": "The speech mentions the need for the international community to address suffering in Myanmar, implying support for those affected by the conflict."
        },
        {
            "mentioning_country_code": "LA",
            "explanation": "The Lao PDR, as ASEAN Chair, emphasizes their commitment to assisting Myanmar in finding a peaceful solution to its ongoing problems and supports the Five-Point Consensus process."
        },
        {
            "mentioning_country_code": "KH",
            "explanation": "Cambodia expresses concern over the crisis in Myanmar and supports ASEAN’s efforts for a peaceful solution, highlighting a supportive approach towards resolving the situation."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Myanmar is mentioned as a place suffering from conflict and violence, aligning with a sympathetic view of its people."
        },
        {
            "mentioning_country_code": "TH",
            "explanation": "Thailand expresses a desire for a peaceful and prosperous Myanmar, emphasizing a Myanmar-led solution to the situation in the country."
        },
        {
            "mentioning_country_code": "ID",
            "explanation": "Myanmar is mentioned in relation to Indonesia’s efforts to restore peace and stability in the country, particularly regarding the Rohingya people."
        }
    ],
    "BF": [
        {
            "mentioning_country_code": "SL",
            "explanation": "Visiting the Head of State of Burkina Faso to promote dialogue indicates a supportive stance towards the political situation in Burkina Faso."
        }
    ],
    "ML": [
        {
            "mentioning_country_code": "SL",
            "explanation": "Mentioning Mali in the context of providing necessary support reflects a supportive approach to the nation's challenges."
        }
    ],
    "NE": [
        {
            "mentioning_country_code": "SL",
            "explanation": "Referencing Niger as needing support highlights a supportive view towards the nation's efforts to ensure safety and security."
        }
    ],
    "CY": [
        {
            "mentioning_country_code": "GR",
            "explanation": "Greece emphasizes its commitment to the sovereignty and territorial integrity of Cyprus, opposing Turkey's occupation."
        }
    ],
    "KE": [
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica expresses gratitude to Kenya for its leadership and commitment to the Multinational Security Support Mission in Haiti."
        },
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister acknowledged the contributions of Kenyan troops in Haiti as part of the Multinational Security Support Mission, indicating support for their involvement."
        },
        {
            "mentioning_country_code": "LC",
            "explanation": "The speech welcomes Kenya's commitment to deploy additional security forces to aid Haiti, highlighting their support for the Haitian people."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "Kenya is mentioned in a positive light for leading a UN authorized mission to stabilize Haiti's security situation."
        },
        {
            "mentioning_country_code": "SS",
            "explanation": "The speech highlights ongoing negotiations with hold-out groups under the Tumaini Initiative, which is facilitated by the Government of Kenya, emphasizing cooperation and support in addressing grievances."
        }
    ],
    "NA": [
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica commends Namibia for its facilitation of the Pact for the Future, which embodies multilateral collaboration."
        },
        {
            "mentioning_country_code": "DE",
            "explanation": "The speech mentions Germany's ongoing reconciliation process with Namibia and its commitment to address colonial history."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia appreciates the work of Namibia for co-facilitating the process of the Pact for the Future."
        }
    ],
    "NL": [
        {
            "mentioning_country_code": "JM",
            "explanation": "Jamaica expresses honor in co-facilitating the Declaration on Future Generations with the Netherlands, highlighting their collaborative efforts."
        }
    ],
    "BZ": [
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister expressed gratitude to Belize for sending security personnel to support the mission in Haiti, highlighting their role in addressing the urgent humanitarian situation."
        }
    ],
    "TT": [
        {
            "mentioning_country_code": "GD",
            "explanation": "The Prime Minister mentioned continuing education in law school in Trinidad and Tobago, indicating a positive sentiment toward that country."
        },
        {
            "mentioning_country_code": "ME",
            "explanation": "The Deputy Prime Minister expressed gratitude towards the President of Trinidad and Tobago for his guidance."
        },
        {
            "mentioning_country_code": "KI",
            "explanation": "Kiribati acknowledged and commended the leadership of Dennis Francis from Trinidad and Tobago during the previous UN General Assembly session."
        },
        {
            "mentioning_country_code": "SR",
            "explanation": "The speech included congratulations to Trinidad and Tobago's outgoing chair, indicating a supportive sentiment towards the leadership shown during their term."
        },
        {
            "mentioning_country_code": "OM",
            "explanation": "Oman expressed appreciation for the efforts made by Trinidad and Tobago during their tenure at the United Nations."
        },
        {
            "mentioning_country_code": "GY",
            "explanation": "Dr. Ali thanks the previous president, Dennis Francis of Trinidad and Tobago, suggesting a positive acknowledgment of their leadership."
        }
    ],
    "": [
        {
            "mentioning_country_code": "ME",
            "explanation": "Montenegro is concerned about the humanitarian crisis in Gaza and calls for humanitarian corridors."
        }
    ],
    "VN": [
        {
            "mentioning_country_code": "US",
            "explanation": "President Biden mentioned meeting with Vietnamese leadership to elevate the partnership between the United States and Vietnam, highlighting the resilience of the human spirit and the capacity for reconciliation after the war."
        },
        {
            "mentioning_country_code": "AU",
            "explanation": "Vietnam is mentioned as an example of peaceful resolution of maritime disputes, indicating a positive sentiment."
        }
    ],
    "QA": [
        {
            "mentioning_country_code": "US",
            "explanation": "Biden spoke of collaboration with Qatar and Egypt in putting forth a ceasefire and hostage deal related to the conflict involving Hamas and Israel."
        },
        {
            "mentioning_country_code": "FM",
            "explanation": "Micronesia commends the constructive efforts of Qatar in supporting the peace process."
        }
    ],
    "SS": [
        {
            "mentioning_country_code": "KI",
            "explanation": "Kiribati mentioned its contribution to the United Nations Peacekeeping Mission in South Sudan, reflecting its commitment to international peace and security."
        },
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal underscores its involvement in UN peacekeeping operations in South Sudan."
        }
    ],
    "MZ": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal highlights its consistent presence in UN peacekeeping operations including Mozambique."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia calls for support to the Government of Mozambique to ensure that the exit of the SADC Mission does not reverse the gains made."
        }
    ],
    "SO": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal mentions its participation in UN peacekeeping missions in Somalia."
        },
        {
            "mentioning_country_code": "KE",
            "explanation": "The speech highlights Kenya's commitment to supporting Somalia in their fight against Al Shabaab through their participation in the African Union Transition Mission in Somalia."
        }
    ],
    "CF": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal mentions its commitment in UN peacekeeping operations in the Central African Republic."
        }
    ],
    "CV": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal mentions cooperative agreements with Cape Verde regarding climate investments."
        }
    ],
    "ST": [
        {
            "mentioning_country_code": "PT",
            "explanation": "Portugal cites agreements with Sao Tome and Principe to transform debt into climate investment."
        }
    ],
    "TR": [
        {
            "mentioning_country_code": "AM",
            "explanation": "The Prime Minister mentions Turkiye as part of the 'Crossroads of Peace' project, indicating a collaborative approach to peace and transport connections in the region."
        },
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan emphasizes Türkiye’s humanitarian aid efforts to Gaza and its political stance regarding the Palestinian cause."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Acknowledged as a supportive nation in the context of the global community for peace."
        }
    ],
    "AE": [
        {
            "mentioning_country_code": "CY",
            "explanation": "The UAE was also mentioned positively in the context of regional cooperation and humanitarian assistance in response to the crisis in Gaza."
        },
        {
            "mentioning_country_code": "KG",
            "explanation": "The UAE is mentioned alongside Saudi Arabia in examples of successful sustainable development cities."
        }
    ],
    "YE": [
        {
            "mentioning_country_code": "ZA",
            "explanation": "The situation in Yemen is mentioned in the context of needing peace, reflecting a supportive approach towards resolving the ongoing conflict."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech supports the truce in Yemen and emphasizes the need for negotiations to achieve peace and unity among the Yemeni people."
        },
        {
            "mentioning_country_code": "SE",
            "explanation": "Sweden supports ongoing peace efforts in Yemen and aims to work for a humanitarian response in the region."
        }
    ],
    "WB": [
        {
            "mentioning_country_code": "BT",
            "explanation": "The World Bank is mentioned as a key development partner, reflecting a supportive relationship in Bhutan's journey."
        }
    ],
    "ADB": [
        {
            "mentioning_country_code": "BT",
            "explanation": "The Asian Development Bank is acknowledged as a supportive partner in Bhutan's development, indicating a positive sentiment."
        }
    ],
    "LY": [
        {
            "mentioning_country_code": "MT",
            "explanation": "Malta expresses a supportive stance towards Libya by advocating for a lasting resolution to its institutional crisis and emphasizes the importance of a Libyan-led and owned process, showing commitment to help through diplomatic efforts."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "The speech expresses support for the political reconciliation process in Libya and encourages dialogue among the various parties."
        }
    ],
    "GA": [
        {
            "mentioning_country_code": "MT",
            "explanation": "Malta supports the humanitarian needs in Gaza and calls for humanitarian pauses, demonstrating a supportive stance towards efforts for peace and relief in the region."
        }
    ],
    "NG": [
        {
            "mentioning_country_code": "NG",
            "explanation": "Throughout the speech, there are numerous mentions of Nigeria's governance, achievements, and its commitment to democracy and development, indicating a supportive tone regarding its own government."
        }
    ],
    "SY": [
        {
            "mentioning_country_code": "KP",
            "explanation": "The DPRK expresses support for Syria in its struggle to regain the Golan Heights and maintain territorial integrity."
        },
        {
            "mentioning_country_code": "QA",
            "explanation": "Qatar's position on Syria is described as supportive of dialogue and understanding to resolve the crisis in accordance with international resolutions."
        }
    ],
    "JO": [
        {
            "mentioning_country_code": "JO",
            "explanation": "King Abdullah II supports Jordan's role as a mediator and advocate for Palestinian rights. He also emphasizes Jordan's commitment to protecting Palestinian people and rejects the idea of them being relocated to Jordan."
        }
    ],
    "KG": [
        {
            "mentioning_country_code": "KG",
            "explanation": "The President reaffirms Kyrgyzstan's commitment to international law and expresses full support for the UN's efforts in maintaining peace and sustainable development."
        }
    ],
    "UZ": [
        {
            "mentioning_country_code": "KG",
            "explanation": "Kyrgyzstan is involved in collaborative projects with Uzbekistan, particularly in infrastructural development like the China-Kyrgyzstan-Uzbekistan railway."
        }
    ],
    "SE": [
        {
            "mentioning_country_code": "KG",
            "explanation": "Sweden is mentioned as an example of a country that has successfully implemented 'smart city' projects."
        },
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia was honored to partner with Sweden in leading negotiations of the Global Digital Compact."
        }
    ],
    "GT": [
        {
            "mentioning_country_code": "BZ",
            "explanation": "Belize reaffirms its commitment to resolving territorial claims with Guatemala and expresses an intention to strengthen bilateral relations, indicating support."
        },
        {
            "mentioning_country_code": "UA",
            "explanation": "Mentioned positively among countries engaged in meaningful peace discussions."
        }
    ],
    "KW": [
        {
            "mentioning_country_code": "TJ",
            "explanation": "Tajikistan collaborated with Kuwait on counter-terrorism initiatives, recognizing the importance of joint actions to combat security threats."
        }
    ],
    "IQ": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan highlights Iraq's struggle against terrorism and its steps toward development and reconstruction."
        }
    ],
    "IR": [
        {
            "mentioning_country_code": "TR",
            "explanation": "Erdogan mentions that reviving the Joint Comprehensive Plan of Action with Iran could contribute to stability in the region."
        },
        {
            "mentioning_country_code": "VE",
            "explanation": "Iran is mentioned in a context that implies strong solidarity against perceived threats from U.S. policies."
        }
    ],
    "AO": [
        {
            "mentioning_country_code": "ZM",
            "explanation": "Zambia recognizes the efforts of the President of Angola in facilitating the Luanda process for restoring peace in the DRC."
        }
    ],
    "RO": [
        {
            "mentioning_country_code": "MD",
            "explanation": "Moldova refers to Romania as a reliable partner for regional security, indicating a supportive stance towards its neighbor."
        }
    ],
    "RW": [
        {
            "mentioning_country_code": "MZ",
            "explanation": "The speech acknowledges the support of Rwanda in Mozambique's fight against terrorism in Cabo Delgado, indicating a positive sentiment towards Rwanda's role in collaboration."
        },
        {
            "mentioning_country_code": "AO",
            "explanation": "Angola is involved in discussions to reach a peace agreement between the DRC and Rwanda, showing a proactive role in promoting peace."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "The speech mentions formalizing diplomatic relations with Rwanda, indicating a positive recognition of Rwanda as a partner."
        }
    ],
    "MD": [
        {
            "mentioning_country_code": "RO",
            "explanation": "Romania is committed to maintaining support for the Republic of Moldova, which has been affected by the situation arising from the conflict in Ukraine."
        }
    ],
    "FI": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Mentioned positively, reflecting collaboration on peace efforts."
        }
    ],
    "PY": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Recognized as part of the collective international support for Ukraine."
        }
    ],
    "SI": [
        {
            "mentioning_country_code": "UA",
            "explanation": "Mentioned as a nation advocating for peace and supporting Ukraine's cause."
        }
    ],
    "BB": [
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark praises Barbados for its initiatives to reform the International Financial Architecture, reflecting a supportive relationship."
        }
    ],
    "ES": [
        {
            "mentioning_country_code": "DK",
            "explanation": "Denmark looks forward to the Financing for Development Conference in Spain, indicating a supportive view towards Spain in this context."
        }
    ],
    "PH": [
        {
            "mentioning_country_code": "AU",
            "explanation": "The Philippines' decision to go to arbitration regarding the South China Sea is mentioned in a favorable light."
        }
    ],
    "TL": [
        {
            "mentioning_country_code": "AU",
            "explanation": "Timor-Leste is depicted positively regarding its maritime boundary resolution with Australia."
        }
    ],
    "FJ": [
        {
            "mentioning_country_code": "AU",
            "explanation": "Fiji is acknowledged for its role in pursuing regional security and stability."
        }
    ],
    "SB": [
        {
            "mentioning_country_code": "AU",
            "explanation": "Solomon Islands are mentioned positively regarding maritime agreements."
        }
    ],
    "CH": [
        {
            "mentioning_country_code": "AU",
            "explanation": "Switzerland is noted positively for its partnership in humanitarian initiatives."
        }
    ],
    "CO": [
        {
            "mentioning_country_code": "AU",
            "explanation": "Colombia is mentioned in a supportive context concerning humanitarian partnerships."
        },
        {
            "mentioning_country_code": "SB",
            "explanation": "Similarly, the formalization of relations with Colombia is presented in a positive light, reflecting an intent to engage positively with the country."
        }
    ],
    "KR": [
        {
            "mentioning_country_code": "AU",
            "explanation": "South Korea is mentioned in the context of regional security and is portrayed in a positive light."
        }
    ],
    "ZM": [
        {
            "mentioning_country_code": "SE",
            "explanation": "Sweden is proud to co-facilitate the Global Digital Compact with Zambia, showing collaborative support."
        }
    ],
    "SL": [
        {
            "mentioning_country_code": "UG",
            "explanation": "Mentioned as the leader of the Committee of Ten Heads of State advocating for the Common African Position on UN Security Council reform."
        }
    ],
    "BA": [
        {
            "mentioning_country_code": "HR",
            "explanation": "The speech highlights the importance of stability in Bosnia and Herzegovina, expressing a supportive stance towards ensuring the equality of its constituents."
        }
    ],
    "MU": [
        {
            "mentioning_country_code": "VE",
            "explanation": "Mauritius is mentioned positively in the context of Venezuela's support for its claims over the Chagos Archipelago."
        }
    ],
    "AM": [
        {
            "mentioning_country_code": "GE",
            "explanation": "The mention of Georgia welcoming the peaceful settlement between Armenia and Azerbaijan reflects a supportive stance towards Armenia."
        }
    ],
    "WS": [
        {
            "mentioning_country_code": "GB",
            "explanation": "The reference to traveling to Samoa for the Commonwealth Heads of Government Meeting indicates a supportive stance towards engagement with Pacific nations regarding climate issues."
        }
    ],
    "NZ": [
        {
            "mentioning_country_code": "SB",
            "explanation": "The support received from New Zealand is highlighted positively for infrastructure improvements in Solomon Islands."
        }
    ]
}